{
  "podcast_details": {
    "podcast_title": "Music Entrepreneur Club Podcast",
    "episode_title": "Episode 200: The Final Episode, No More Middle Men",
    "episode_image": "https://ssl-static.libsyn.com/p/assets/b/e/f/e/befe08c629e5febb/The_Music_Entrepreneur_Club_Podcast_White_Border.jpg",
    "episode_transcript": " Are they going to represent me when I sell a drum kit for $29.99 on BeatStars? No, but they're going to represent me when I get a Drake record and the label is paying $20,000 for that beat. What's going down everyone? This is the MEC Podcast, the final episode. The final episode. I have two very special celebrity guests, Aaron Knight and Damon Ritter to celebrate the last episode with me. How are you feeling? Episode 200. We should have built this up more. We should have built this up more like the finale of The Walking Dead or something. Well, we can do 201. I think 200 is a good number to end it on. It's been, jeez, and it's 200 straight. We didn't, I don't think we missed a week, Payne. No, we didn't. Even though we were on tour. Yeah, we were on tour. Obviously, we've been sick through COVID. Like, I'm just, I'm just patting us on the back because we did 200. I mean, we kind of came just kind of routine. Like once you get into it, you know, hopefully this is a message for other creators. And I know that, you know, it's not the same as like making a song a week. I don't want anybody. I'm just talking about the idea of being this consistent for almost four years, essentially. Sheesh. You know, just showing up. Obviously, we have our personal lives. We have other things going on in our business lives, but we showed up. And I just want to thank you guys for that because obviously, you know, I definitely, when I started this, I was just kind of dolo. And then, you know, then I was rocking with Kato for a minute and then Payne came on. And then we were, we were blessed enough to have Aaron's voice join us and give us a little pick up, a little energy. You know, so we all showed up every week. I know that at times, like maybe I wasn't on an episode or there weren't that many episodes where we weren't where we were missing somebody. But we still held it down. So I think, I think that's dope. I think that's dope. I don't, you know, and then hopefully it was just an example. You know, we always tell creators that they got to be consistent. We had to be an example of that. So props to y'all for showing up every week and dropping gems. It's been dope. And shout out to the people that grew with us. That's what was really amazing to me. And it felt like the right combination when Aaron joined. It just, it felt like the energy went up. And then the viewership did as well. So, you know, I appreciate everyone on the other side of the screen supporting us for, I mean, 200 episodes. That's a lot. And I know that I got a comment this morning from someone who was like, who's the young lady on the show? I just tuned in. This is the first time. So there are people who are just now starting to consume our episodes, which is, you know, it's amazing. After 200 times, 200 weeks of doing that, that's a lot. Yeah. Like for me, like, you know, the MEC was born out of a pretty dark time for me. So it was kind of therapeutic, you know, just to kind of rant on here every week as I was going through some pretty ridiculous shit. Like, obviously, I don't think I haven't met anybody that's gone through, or at least what I think, is as ridiculous of a time as I went through at the end of Funk Volume. I'm not just trying to compare like war stories or whatever, but I went through a pretty dark time and looking back on it, I didn't even realize how dark the time was. Because sometimes when you end something, you know, you're just trying to figure shit out. Like, what are you doing? Like, what am I working on? Who am I? And I just think that the MEC kind of gave me something to just like vent sometimes. But I thought it was necessary because like, I believe that a big part, there were a lot of reasons Funk Volume failed. One of the biggest reasons is like just a lack of education, you know, on Hop's behalf. And I was like, okay, there needs to be a platform that really, that comes from a perspective, a management perspective, label perspective, or just a real perspective to just kind of explore some of these topics 360. And encourages artists to be educated so they can lower the chances of having that tension with their manager or their label. Because education is just super important. I've been a fan of education my whole life. Like institutions, whether you go through a formal institution or whether it's YouTube University or whether, however you get education, hopefully you just get it from a great source that actually knows what the hell they're talking about. We're really hitting them with the hot takes on this final episode. Dane values education. But yeah, so this is what this platform to me was because I looked around, I was like, I don't really see that many platforms that are really given like what it's like on the ground. Right. You can read Donald Passman's book. You can read all these books or whatever. But it's really not going to help you with like how to manage the tension with your managers or what it's like to really hit the road or, you know, so it's a lot of different things that not saying that you shouldn't read Donald Passman's book, but this podcast right here is three perspectives that have, you know, build something from the ground up that have, you know, been in so many different situations. There's a big difference between reading Donald Passman's book and doing what you guys have done. And that's what we wanted to share on this podcast. And I think we've done that because we've gotten a lot of great feedback. And that's really what kept me going. Oh, people, because at first I thought we were going to be able to to like make this a subscription based thing. And we did for a little while because the MEC went through different transitions. Right. We tried to, I thought, oh, artists are going to value this education. I'll be able to do a subscription based thing. And I quickly found out that artists don't pay for shit. So I was like, OK, it wasn't supposed to be a huge moneymaker to begin with. So let's let's let's figure this out. And we did have it was subscription based for how long paying? What was it like? Two years to two years at least. Yeah, two years. And it was cool. And then B-Stars came in and sponsored it and allowed us to just open it up to everybody. You know, and it's been a free a free platform ever since. So we've definitely gone through different phases and transitions of the MEC. But again, we've been consistent. So an MEC existed in 2016 because it was just membership based and then we didn't have a podcast. The podcast obviously started 200 episodes ago, but the MEC existed probably two more years before that, or at least a year and a half before that. And we've toured. We did the MEC tour. That was dope. So we've done a lot. We definitely have done a lot. So this this episode will be a combination of what we normally do and then maybe some fluff and tears at the end. I'm crying the whole time. I'm going to let you know. I've just been sitting over here trying to hold it in. So not just at the end because, you know, I'm emotional. So this is going to be tears the whole time. Yeah, no, I mean, so I so why don't we I mean, we can talk about why we feel comfortable with the partnership or you just give our individual takes on why we feel comfortable with the partnership with radio and then kind of taking over content and programming going forward. We don't have a specific date for that yet, but it should be sometime in the next month, two months, three months, hopefully before that. But no specific date yet. But maybe we just talk about that. Like why why we feel like this partnership makes sense. Do you got I mean, I've already probably kind of I don't want to just dominate this conversation. You guys can go first and then I, you know, I get my my reasons because they might be different. I don't know. We've actually never discussed. I don't know if we discussed this. So I'm curious to hear your guys's response. I mean, for me, I think that radio is such a interesting and dynamic company. I guess it was like it was when we still had the BeatStars partnership and we were, you know, still interviewing people once a week or well, it was a couple of times a week. And I remember you hit me. You were like, hey, I'm interviewing Bononi for my episode. He's the CEO of radio. Do you want to hop in on this? And that was so exciting to me because you know how big of a fan I am of Issa Rae. Clearly, she's on my my black girl Hall of Fame wall. But yes, so I remember interviewing him and being like, OK, I see why their company is doing so many things because he was such an intelligent human, but so grounded, so kind. So for me, even before we even knew they were interested in, you know, partnering, I was excited because now I have a new professional contact that I'm like, this guy runs one of my favorite companies in music and he cares about black people, which, you know, is big for me. And he cares about music and he cares about artists. So just knowing Bononi and getting to know him since then, he was always super generous with information after that and very caring. I tapped in with him in L.A. a couple of times in person and then you hit us and you were like, hey, they're looking to partner with us, whatever, whatever. So what most people don't know is we've actually been working on this process of transition for months on end. So I went out to meet the radio team at the end of last summer and it was one of the most affirming experiences for me because, again, it's not just Bononi. It's like the whole team has the same type of energy. They care about art. They care about people and they want to keep it going. So for me, the reason that I feel so comfortable with this is because I know that the M.A.C. is very personal to me. I've only been around. I think I joined like just after episode 100. I think you interviewed me when y'all were around like 103, 104, and then you invited me to join. So I think I joined like 110, 112, something like that. So I haven't been here as long as you and Payne have, but it still feels very personal to me. It feels very much like a family to me. I get stopped almost every time I'm at a music event by somebody who listens to the M.A.C. or has tuned in previously or follows the page. So it just feels like it feels like family. And so you don't want to let your family go to just like some corporate entity that's like, yeah, we're going to monetize this and change this and so for me, I feel comfortable because I feel like the M.A.C. is now going to be in good hands with people who want to progress and move what we've done so far and elevate it. And I think that it'll be a good place for people to land, to have more questions answered, to be exposed to a wider base of knowledge. And so I'm not exactly sure how we're going to continue with it and what our involvement is. But I think that it is really in good hands and I feel confident in the people who are invested in this now. Aaron said a lot. Yeah, I didn't I didn't have the pleasure of meeting the radio team, but what Issa Rae has done in the entertainment, theater, TV, universe, feels authentic. And then obviously, Dame and the team have a relationship and I trust Dame. Someone commented, I think it was a joke. I hope it was a joke like M.E.C. podcast is breaking up. I guess it's another funk volume. And it's like, yeah, fun volume didn't get an exit interview. So I don't know what we're not bringing up. We are not bringing up. And honestly, I OK, I have a I really do want to just like transition out by dropping something, some kind of podcast on Mondays, just so people don't feel like there's suddenly a vacuum. Maybe that's selfish. I don't want people going to other platforms. But no, I think pain, I think you got especially from in the producer community, because I should I didn't tap into the comments like I should have. But when I did, you know, you got folks, there's no reason to stop, especially especially from a producer perspective. I think they continue to need your voice, your experiences, your sense of humor. They need they I think they need that. And a lot of times the videos that you did solo just for the producer community that weren't the M.E.C. podcast that you do, I don't know how frequently you do those. I just see them pop up every once in a while. You know that. Yeah, I don't think any of us, none of us are like leaving music. Right. None of us are like, hey, you know, you're still out on that one for me. Yeah. Aaron keeps faking. I was faking like two years ago and then I just finally realized, look, then you're always going to be a music in some capacity. Just deal with it. Doesn't mean you're not going to get into other stuff, but you know, that doesn't really make sense to leave music 100 percent when you have so much experience that you can leverage. But this this new partnership is to prevent I mean, nothing like Fong Volume was ever going to happen with us. That's ridiculous. But, you know, I Fong Volume doesn't exist anymore. And I wanted to prevent that because like I personally, you know, I was kind of losing steam myself. Like, you know, where did where is this going to go? Like, I always want to progress. I don't want to just plateau and just kind of just do the same things over and over and over again. And I think, yeah, we probably could have thought of other ways to kind of take the MEC to the next level. But when I had the conversation with Bononi and they already have an infrastructure, it's almost like the conversation of like signing to a label, right? Like they have an infrastructure. They're working with all these big brands already. And like Aaron said, the most important thing is like these are genuine folks that are knowledgeable and care about the creator community. So I felt like, you know, what we started would be in great hands with with radio, with just additional resources. So it is kind of like, you know, signing to a label, essentially a lot of the same lot of the same thought process. I just wanted to see the MEC continue. I wanted even if it's not me sitting here every day, like I just wanted to see the MEC continue as opposed to volume, which hasn't continued and doesn't exist anymore. Like that would have been a shame to me. So I thought this was a perfect opportunity, you know, to have somebody come in and just kind of build on on the foundation that we set. So that's what I was going to make was whatever episodes, you know, because I have a million ideas and very little time. But since Monday's already blocked off for MEC, there's an open invitation. I don't whatever I'm talking about. I know the two of you have stuff to talk about. So even if you have a particularly eventful week that you want to talk about on any platform I have, you know, please join. I'm taking you up on that. I'll be texting both of you regularly and saying, hey, I'm thinking about doing this topic. You want to jump on and say, you know, and it won't be live or anything, but similar format. You know, why why break up or not break up? Why? Why eliminate a certain chemistry and energy from your life when it works so well? Hopefully, there aren't too many people that feel like this is the end of anything. It's just a different path. You know, there's going to be people in the comments that just continue to make up their own stories anyway. No, they broke up because they're fighting. They don't like each other. They, you know, they did something shady again and stole a million dollars. MEC was gross, what, two point five million an episode. And I found out, you know, we're only paying me twenty dollars. So I had to leave. There there. So, I mean, there, there. One of the things I probably don't often fail that it like I didn't we didn't really try to monetize the MEC like that. But I didn't want to ever be seen as one of these like click funnel platforms where we're trying to sell people. It wasn't never this was never supposed to be like a big moneymaker. Did we make a little bit of money here and there? Obviously, the subscriptions never got to a crazy subscription base and B-stars definitely didn't pay us a lot of money. Radio didn't pay us a lot of money. Like, it's never been about, you know, trying to just make as much money for us. It's always been about the community. It's always been about sharing information that I know that the independent creator community needs. So, we had sponsorship offers that Dame was shooting down. He's like, no, we're not. Oh, I'm not going to say the companies, but we had a couple of offers and it just you were like, no, I'm not trying to do it. And I was I was like, oh, well, this is money. Let me see if they'll sponsor something I have going on. No, they wanted MEC. So we stayed 100 percent ad free. We never had a sponsored video. We never had any kind of money. We never had a pot. I mean, we have I mean, B-stars essentially. But on the podcast, we weren't advertising them there. We were never shoving an ad in anyone's face on any one of these episodes. Right. Yeah. And I mean, I don't know if you're protecting the brown on mine. If you say it, maybe you don't want to talk about that. I honestly don't remember. I don't remember either. I definitely want to. You know, I think people have to be protective of their brands and what you associate with. You know, so maybe that was maybe that was the thought process. I don't know. But it was never this never been about money. We didn't. None of us made a lot of money to the MEC. What I did the most valuable thing for me selfishly has been like the people that I've been able to meet, like through the MEC. Right. Because when we especially when we used to have the live sessions every week, a lot of those it started out with my personal contacts, just reaching out to people like, hey, would you mind coming on the platform and sharing your experience? But then when I kind of exhausted all those relationships, because it's a lot of weeks like I was just cold emailing or cold DMing people and and, you know, start starting conversations. And a lot of people that I've had on the MEC, I've continued to build relationships with or work with or they've connected me like that. That's that's been the most valuable thing for me selfishly by, you know, by creating the MEC. I definitely built a lot of dope relationships. So, yeah, I would say on that same tip, like on the selfish part. I like always feel like I don't see me in the world. Like, there are a lot of black women execs, but a lot of them are just like behind the creator that they support or behind the label that they support. And so for me, it was like, I don't see black women talking about their woes in the music industry or problem solving. It's typically white men, I think there's a rise in black creators making podcasts right now or black business people, you know, like JR from NPR Global and then the brand man guys, which is cool. But again, for me, one of the hardest things being in this industry is not having somebody who I can look to to say like, oh, you have a similar experience to me, even if it's not completely lined up. So for me, I wanted to be a part of being a voice for other women, but especially black women. And then I think that even leads back into why radio felt like a good choice, because I know that not only are they considering black women, but they're led by a black woman. So we're not going to be discounted. It's not going to turn into, okay, all right, we're going to take this over. And now it's going to become this super corporate thing. I think that black women will always be a thought process, which is something for me is like, how can I give us more access to the knowledge base and how can I think that's like some of the consistent feedback I get people are just like, I love the way that you say things. When you say something and make I can understand it, because I can tell that you come from a similar place or a similar struggle that I do. And so for me, like, yeah, I think selfishly that's what I'm like, oh, even for me like coming back and rewatching clips and being like, oh, that's where I was in that moment or I needed, I wish somebody would have said this to me when I was first getting started, or I wish I knew it was okay to be that emotional as somebody in business, you know, and so yeah, I think that the NBC has, has given me space to be me, which is something that I felt like I yelled never asked me to fit into a mold or like, we'll say it like this or don't offend anybody or maybe don't talk about being black so often which is like, speed back that I've gotten from so many different places you know I'm saying, they're like, oh, well, we get that. But can you assimilate and then bring that out later, like we'll add your face for the diversity ad but we don't really want your experience. So I feel like I've been welcomed and I'm super grateful to you, Dane and pain for having me and giving me space to really really be me like come hell or high water you know. Nah, for sure. We don't feel like we, I mean we really needed to do at that point. I just think we needed another another voice another perspective and the fact that when I had you on and we spoke I was like okay that this this voice makes a lot of sense and I think it's a voice that it's a perspective that's that's missing from pain and I going back and forth every week on the podcast. So I think it just fit fit right in and then just personality wise I think it gelled pretty much right away. Also, so, you know, I think you've been a blessing to the podcast and to our community. So I'm glad you were rocking with us. Yeah, I mean let's jump in let's jump into a couple of topics. I know that my guy, my guy Russell has been an example that we've used time and time again because he's doing so well like he's doing so many things right. You know, I think a lot of independent artists they start doing things well and then they turn around and start, you know, giving advice and sometimes I agree with it sometimes I don't. But he had a video in particular where he was talking about middleman. And we were talking before this podcast started basically like the this the idea or the label of a middleman is already just kind of seen as a negative thing. Right. And I don't know if you have that definition still up, but maybe if you just kind of read the definition we get to just talk a little bit about middleman because middlemen are middle women they just from the jump get a bad rap. And, you know, sometimes these are very crucial pieces to a process. And when you say just a, like when you minimize somebody who likes to hate that shit like, oh, he's just the business guy, or he's just the manager, I'm like, bro, do you know, like, that I am the glue to this like, you know, I never really kind of beat my chest or said anything like that and, you know, just hella ego but like that's the reality like, stop minimizing people's roles. The just like is, you know, just make somebody feel like you can replace them with any cog in the wheel. Like that's not. That's not a thing like these people have, I mean, maybe they're I mean, they're, I don't say everybody there are people that probably can be replaced easily replaceable but you know when you start referring to somebody as just a when they have a lot of experience, they're super professional. And just a passion for something, especially that you can really get on my nerves because like I really care. You know I'm saying like finding somebody that cares is is ridiculously hard like just cares about you as a person. But I'm trying to get you to I'm trying to get you to therapy I'm trying to figure out what's wrong like I'm, I care about you, my family cares about you. Like don't ever just me like that that is ridiculous. But anyway, back to the middle. I feel you I tell you all the time you can't pay people to care. And that's like the video I just posted when I talked about women in hip hop with the grill. I was like, artists are just like oh, people come up to me at my events or artists and be like yo this is dope. Are you excited I'm like, no, I already like, I created this whole thing. Like I know you're having fun, but this is a labor of love that I had to develop, especially when it comes to events festivals it's like, this is eight months in the making I'm tired. Like I'm not just happy to be here. I'm happy to see go off for sure but I'm not experiencing this from a fan perspective or from an artist perspective, and I agree that like oh, they're just, it's like yo, you cannot pay people to care. You cannot pay people to give you all of their best. You know what I'm saying like, you can pay somebody and they can give you something but people showing up to give their best. Like that's a that's a that you can't put a dollar amount on somebody given their best so I think the minimization of people who serve as middlemen, which I'm going to read the definition of is an oversimplification of what they do. And to me is a is is a sign of ignorance or a lack of value."
  },
  "podcast_summary": "The podcast episode celebrates the final episode of the MEC Podcast, with special celebrity guests Aaron Knight and Damon Ritter joining the host.\n\n- The hosts reflect on the consistency and importance of showing up for 200 episodes, being examples of consistency for other creators.\n\n- The hosts express gratitude for the viewership and growth of the podcast over the years, acknowledging that there are still new viewers discovering the show even after 200 episodes.\n\n- The creation of the MEC Podcast originated from a dark time for one of the hosts and aimed to provide an educational platform from a management and label perspective to encourage artists to be more informed about the industry.\n\n- The hosts discuss how the MEC Podcast went through different transitions, including being subscription-based, before becoming a free platform.\n\n- The decision to partner with radio is discussed. The hosts mention their positive experiences with the radio team and how radio's knowledge and care for the creator community aligns with the goals and values of the MEC.\n\n- The hosts emphasize that the MEC Podcast is not ending, but rather transitioning to a new partnership with radio, and they express their commitment to continue sharing valuable content and discussions.\n\n- The importance and value of the MEC community is mentioned, with the hosts highlighting the relationships and connections they have built through the podcast.\n\n- The hosts address concerns and rumors about the podcast ending, reaffirming their passion for music and their plans to continue sharing content on various platforms.\n\n- The hosts discuss the misconceptions and negative perception of middlemen in the music industry, emphasizing the importance of their roles and the value they bring to the process. They argue that minimizing the roles of middlemen is ignorance or a lack of understanding their contributions.\n\n- The hosts acknowledge that middlemen, such as managers and business professionals, play crucial roles in the industry and should not be dismissed or undervalued.\n\n- The episode ends with the hosts expressing their gratitude to the MEC community and their excitement for the future of the podcast under the radio partnership.\n\nOverall, the tone of the podcast is reflective and appreciative, with moments of humor and lightheartedness. The hosts emphasize the importance of consistency, education, and community within the music industry while debunking misconceptions about middlemen. The podcast episode serves as a farewell to the MEC Podcast in its current form, while also setting the stage for its evolution and continuation through a new partnership with radio.",
  "podcast_guest": "Aaron Knight",
  "podcast_highlights": "Here are three quotes from the transcript that stand out:\n\n1. \"Middlemen are middle women they just from the jump get a bad rap. And, you know, sometimes these are very crucial pieces to a process.\" - Damon Ritter\n\n2. \"Stop minimizing people's roles. The 'just' like is, you know, just make somebody feel like you can replace them with any cog in the wheel.\" - Aaron Knight\n\n3. \"I think the minimization of people who serve as middlemen, which I'm going to read the definition of, is an oversimplification of what they do. And to me, it's a sign of ignorance or a lack of value.\" - Aaron Knight"
}