{
  "podcast_details": {
    "podcast_title": "DIY Musician Podcast",
    "episode_title": "#344: Growing a Band into a Business (with Bombadil)",
    "episode_image": "https://ssl-static.libsyn.com/p/assets/9/2/b/8/92b8b1b5599c56f9/DIY_podcast_SQUARE_3000.png",
    "episode_transcript": " You got to write a lot of crappy songs to write one decent one, I think. Yeah, agreed. And that's probably true with every aspect of the business, really. You know, got to play a lot of crappy shows to have good shows. You're listening to the CD Baby. CD Baby. CD Baby. DIY. DIY. Musicians. Musicians. Podcasts. Hey, everybody. Welcome to episode 344 of the DIY Musician Podcast. I'm Kristina. Today, we're doing something a little bit special. We're bringing on an artist to interview in our Artist Spotlight series, James Phillips of the band Bombadil, a folk band that has been together for 18 years. I believe that they are the true embodiment of the DIY musician. They've had incredible albums. They've worked with top, top artists, and they've just done it. They've figured out how to do it. They've turned this band into a successful business, so we're going to talk to James about how they did that. Let's bring Chris on. Hey, what's happening? Hey, Chris, how you doing? I'm good. I've got a concert tomorrow that I'm doing with my friend Greg. He's an amazing, like, apparently there's something called a master fiddler. Like, what does that mean? It just means, I actually don't know what it means in that world, but it just means you're really good and someone has acknowledged that you're really good. He's amazing. Now I'm backing him up on guitar and we're playing French-Canadian dance tunes. Cool. Like, people who listen to this podcast, they probably know I'm like an indie rock, indie folk guy, but I've gone fast and furiously into this world of fiddle tunes. But anyways, how are you? I love it. I love that your versatility is always evolving. I'm doing great. I just did a fun shoot this week for my next single. I saw pictures. Yeah. I'm excited to see how they turned out. I'm sort of doing the thing that we always tell people not to do, which is distributing it like the week before the single comes out. I thought you were going to say making an actual music video. That's the thing I tell people not to do. What you're doing. No, I'm not. I didn't make a music video. What was the Corvette for? Well, for the photo shoot, but also to take some video for everything else. So I couldn't afford a videographer, but I was able to get my photographer to bring a VHS camera. So we took some footage and we had a lot of fun just seeing what we could make out of it. So I'll definitely have promo video and I'll have those sorts of things. Maybe I'll be able to piece it together. It was. We drove up to Malibu. This is what you do in LA. We did. We just blasted Randy Newman along the way. Yeah, we had a great day. It was really fun. One thing I was going to say about our episode ahead is we'll be having the artist discussion, like you said, and then Rue from our business development team will be on here to tell us about this program that Amazon Music has launched called AMP. I won't give too much away, but it's a really cool thing that any artist with music on that platform can use. So she'll tell us all about that after. Very cool. And I am so excited to have James on today. Full disclosure, James is a great friend. I've worked with James creatively. I've been at James' wedding. It's definitely a good friend of mine and I think you'll be able to hear that in the interview. But I'm so impressed with this band, how they've been able to succeed for 18 years. I believe this is their full-time job. To me, that is sort of the goal. I think that's at least my personal goal is to be able to just survive off of music. So how did they do it? So much has changed in 18 years, how they continued to do it. So I'm excited. Let's bring James on. Hey, James. Hey, Christina. How you doing? I'm doing great today. James, this is the first time you've joined us on the DIY Musician podcast. And the reason why we're bringing you on is because you are in Bombadil, which has been a band for... How long have you been a band? 18 years, I guess. That's amazing. And yeah, how did it start? I mean, I know that you joined... Did you join like a year in or how did that start? I joined a year, I guess two years in. The band started when my bandmate, Daniel, put together some friends in college to start a band. They were at Duke University. I was at UNC Chapel Hill up the road. At the time, the original drummer of the band was Daniel's brother, who wanted to go on to medical school. And so I responded to a Craigslist ad seeking a drummer in 2007. The only requirements were that you'd be willing to travel and that you like burritos. That was a great requirement. Yeah. So our first meeting was at a burrito joint. And yeah, that was... Were they good burritos? Yeah, really good. So when you essentially joined an existing band, what were the expectations or what were you expecting about your involvement and maybe your creative input? Were you sort of just a side guy at first? You know, the band, everyone sang in the band and everyone wrote songs. So from the outset, I was encouraged to do both and have creative input. There was controversy about that at times as we got to know each other. And we're just in our early to mid 20s, kind of figuring it out. But I joined originally to be a touring drummer. Only at that time played the drums and hadn't started songwriting. So yeah, I just expected to hit the road. And I guess I joined in the fall of 2007 and in 2008, we probably played 180 gigs, maybe 200. Holy smokes. And that was only after like two years of being a band? Yeah. Well, I guess three. Yeah. Did you eat 180 burritos? No, at the time we were eating a certain fast food sandwich chain, foot long sandwiches I would eat half kind of around lunchtime and half around dinner time. And now I can't even look at that sandwich chain without being utterly revolted. I can't believe I haven't done it. If it's the one I'm thinking of, I can't even smell it without. It has a distinct smell. PTSD thoughts. There's a lot of conversation on the internet about the smell and whether the bread classifies as bread or not. In the UK, they ruled that it was not bread. There's no nutritional value at all. You might want to fact check me on that, but I did look it up on this last tour. And it said not bread. Yeah, we were reminiscing about the good old days. Well speaking of bread, in the first few years that you were starting, you were touring, you were recording, you were writing. Did you have time to also have a job or was this your full time job? This was our full time, it feels generous to call it a job. Hey it is a job. I had little to no money ever. Sure. But also no time to really work a job. When I joined the band, I was temping at UNC doing administrative work. And I did end up doing some temping when I wasn't on tour at that time, doing things like shipping mouse genetic material around the country. It was a weird job. But we were just so busy, we didn't have time to work. And this was 2008, which you probably don't remember at this moment, but we do, that there was a gas crisis that coincided with the economic crisis. So we were driving this Ford E150 around the country with epically high gas prices. So we just never had any money. The way we were able to do that is we lived in a really run down house together. We had roommates beyond that. So I lived in what should have been the dining room and paid $75 a month in rent. Had its ups and downs, but it was easy to make rent. And yeah, I don't know, we were young and dumb. I had forgotten about that gas crisis, but now I'm remembering we were taking a Sprinter around the West Coast in the middle of that. It's been like, this does not make any sense, this vehicle at this time. Totally. Well, what's funny is that you guys are saying gas prices were astronomically high, but I think that at their peak, they were maybe $3 at that time. And now they're $8 in certain parts of Los Angeles, just saying. Wow. Yeah, I know. Okay, so I do have a few questions because like you said, you were really taking off in 2007, 2008, and at that time we didn't have Instagram. People were sort of using Facebook, but not really. Maybe Facebook events was a big thing. What did we use MySpace at that time? We were using MySpace, yeah. So that was your main social promo or how did you reach fans? MySpace and our email newsletter, we sold a lot more CDs and got a lot more email addresses at that time. And in that era, I remember kind of a year into that we got our first GPS. So before every tour, we would print out like the MapQuest directions and had a special binder for that, which I feel like even when I've talked to people who toured earlier than that, that was an advance that like computers could help you get there in the fastest way. Right. It was just having the Atlas in the car and pointing and figuring it out along the way. How did we do it? I don't understand. We seemed to get by. I don't even feel like we were really texting all that much. Remember texts used to cost money, so you would just mostly call on your phone. So we were talking about this on the most recent tour. We were all dating people and I remember just like all of us getting to a gas station and then doing like slow walking laps around the gas station and talking to our various partners on our flip phones. Because texting took too long back then because you had to push the button three times to get to the letter, right? Right. Yeah. T9. What's crazy that we're talking about this as if it was ancient history. Now when we think about these things, it feels like that was 30 years ago, but it really was only 15 years ago. And so it's sort of like bananas that even something as simple as GPS was such an advancement at that time and now everybody has it in their phone. Everybody has it on their watch. It's undeniable that we have these advances. We have social media. We have all these ways to reach people. So very cool that you were able to build something that was able to transcend into this era with tech. Yeah. What were you going to say, Chris? Sorry. Oh, I was curious. So you mentioned MySpace and your own email list and obviously people coming to shows as a way of you're like interacting with your audience. And both of those things are somewhat within your control. I'm wondering if you also like explored things that were out of your control, like a publicist or pitching your records to labels or kind of wanting to get outside help at that age. We did have outside help at that time. I don't think we could have done that without outside help. We had a booking agent, New Frontier Touring in Nashville and we were already signed to a record label, Ramza Records. So we had help. And at that time getting fans of the label and the cities we were going to hang up posters was a big part of our job. So we were... Street team. Yeah, street teams and so on. Which feels less of a thing now, but that certainly took up a lot of time. If you could back up a little bit then, like what had the band done to get the attention of the label and the booking agent and stuff? It all came from the label and honestly the band just got really, really lucky and that happened before me. A friend of the band was working at UNC's performing arts branch as their college job and a band called the Avett Brothers were coming to play at UNC. And this friend got Bombadil to open for the Avett Brothers and the Avett Brothers manager, Dolph Ramzer, listened to the songs on MySpace and saw the band and signed them before there was even any music out. So I have no idea how to get signed to a record label. It just was baked into our experience and Dolph is still a big supporter and still puts out our recordings and helps us out in any way that he can. So as Ramzer, you're sort of more independent now with Dolph, right? Dolph releases the music as Ramzer records and is just like an old confidant. I wouldn't say he really manages us anymore. Kind of a gray area, I would say, that has come from having such a long relationship. Like if we have a specific thing we need his help with, he's more than happy to help us if he can. Well I know that you're on the road all the time and now do you have a booking agent or is that still? We have had two other booking agents over the intervening years, one more of a DIY situation and then we were on a high road touring for a couple of years. But at this point we are in the US booking ourselves exclusively. That's really impressive because you just did a whole tour, right? Yeah, we just did six weeks. Mostly Daniel, the other long running member of the band handles the booking. But I booked a few shows as well. And then in Europe, we're going to Europe for our fourth tour in the fall. We just signed with a booking and publicist company over there. So this will be actually our first tour in Europe that wasn't self booked. That's amazing. Question just about the basic leadership structure or whatever you'd call it or even ownership of the band. Is it primarily you and Daniel at this point and then other people are ancillary members or is it still a proper band? From a business perspective and even really a musical perspective, the band is Daniel and I at this point. We wrote all of the last record. We have a new guitar player who came in and helped finish up, I think, definitely one, maybe two songs on the composition side on the new record and sang one song and did some background vocals. But at this point, definitely as a business, it's the two of us and as a creative entity, it's the two of us, but we try to make the live performance be a little more democratic of a situation. And in the last year, we've actually had an old songwriter rejoin the band for live performance purposes, but his name is Stuart Robinson, but he hasn't contributed to any of the new creative work at the moment. Do you and Daniel over the years explicitly divvy up responsibility? Like he's doing booking, like have you had conversations like, you handle this, I'll do this, et cetera? Oh yeah. And when we both lived in Durham, we just got together every day. We considered it our job and it was just every day. Every day? Every day. Our Monday through Friday, we would get together kind of two to six and work on business, our new merch, our songwriting. We've done just, yeah, we have so many unreleased song ideas. I wouldn't go so far as to call them songs. And that I think Daniel now lives in France. So that has continued to where we were on FaceTime a couple of times a week and texting and emailing every day about business questions, creative ideas. I think that's so aspirational that you are meeting every day and that they say if you want your creative passions to become your career, you have to treat it like your career. You need to put in the time, you need to put in what's 40 hours a week and you literally did treat it like that. Every day was a day job. We meet, we talk business, we talk creativity. I think that's really impressive considering a lot of us, myself included, are the kind of artists that can just sort of do it in spurts. And then there aren't a lot of results from that, but you're literally putting in the time to make sure that it's a career. You got to write a lot of crappy songs to write one decent one, I think. Yeah, agreed. And that's probably true with every aspect of the business really. Got to play a lot of crappy shows to have good shows. I feel like if I have one piece of advice, yeah, it is that, just like persistence, stubbornness and volume. It's always better to do something than not to do something. From our perspective, I feel like there are folks who have different approaches to music career that I think can end up in a more lucrative place, but to me, that's kind of winning the lottery or something. Speaking of doing something a lot and maybe not always getting the results you want, like you said, write a lot of crappy songs to get to the good ones, that still implies you're judging everything by your own compass. You're still trying things in your direction. Did you ever go through a phase or have to confront something that felt really, I don't know, the wrong road or inauthentic, whether creatively or business-wise? We've had our interpersonal struggles. I feel like we've made enough records now to know that we have no idea what people are going to like, even at this point. I know what I like and I'm really happy if we get to the end of a record and I like the whole thing and feel really proud of it, which has been true of the last few records, which is great. Three in a row that I'm incredibly proud of. But at the same time, when we're done with a record, we have no idea which are the tunes that the fans are going to gravitate towards. We've been in the last few years playing weddings kind of regularly and it's always surprising to see. We will learn a cover, but we just play a Bumbledale show at a wedding, but let the bride and groom choose the songs. It's always really kind of surprising to me, the ones that they pick. Yeah. So again, going back to the volume idea and that art is, to me, a practice. We have to practice being Bumbledale by being Bumbledale, writing songs, playing shows, creating new larger vision projects. I know that you've also had music on TV and film and I'm sure that that's also helped supplement your careers, but how did that help amplify you as a band? Honestly, I'm very grateful that we've been in TV and movies. We in our interpersonal relationships with our fan base haven't seen that that had an incredible impact other than being big paydays and a nice recognition of our work. It's pretty cool to be in a cineplex and have your song come over the speakers. I actually went to the movie to see the song come on. When yours was the Heartbreakers for the Judd Apatow movie? Was that the movie? Yeah, it was called Amy's Friend. It was the song that was in the Judd Apatow movie. We were the second song in the credits, so we had this great time where we went to see it all together. It was a pretty full theater, but by the time our song came on, only we were in the theater. Everyone else had left already because it was the credits. It was a great score for us. That's so classic. I do think part of the industry is the things that you can talk about on your bio as well. It's a feather in your cap, as our manager likes to say. Definitely. Yeah, and that's helpful. It helps you get gigs and get other movies and TV shows. I had that experience too where I was so excited because of song placement and went to go watch the episode to wait for it to come on. I'm like, where is it? And then I turned to Justin, my husband, and he's like, I think that's it. It was in the radio way in the back of the scene while they're talking over. I'm like, oh man, I thought this was going to be my big moment. People were going to shazam me forever. No, but big opportunity. Yeah. Well, I'm imagining in both those instances, the paycheck was nice to help support some future project, but that makes me curious about, you mentioned early on, CD sales being kind of a big source of revenue. You don't have to talk numbers, but how has that shifted over the years? What was supporting the band as a business 20 years ago versus today? Has it become much more scattered and diversified, I guess? Nothing was supporting the band 20 years ago. I just have to really quickly say that when I first met you, I learned how really good you are with saving money and that you were always making peanut butter jelly sandwiches whenever you'd come into town from tour or whatever. You had your economically safe meals and you're very good at that. I have to say that before you. It's a skill that has been kind of fading away from me, unfortunately. It's nice to be comfortable. Yeah, no, totally. We go to the fancy coffee shop every day on tour now. Nice. You can. But I'm also almost 40. There you go. But now I would say still the biggest dependable source of income is playing shows. Merch sales at shows help a lot. We've started in the last few years before the pandemic and now we obviously didn't play for two years during the pandemic. But we've shifted to doing a lot of house shows, which are just more lucrative. We've had this experience playing clubs where just the club's expenses are so high that it's pretty hard to make money from the tickets, even if you're filling up the rooms. Having a little more informal event can be both more intimate for us and the listener and more financially lucrative for us. I figure that you're probably also creating more meaningful fans when you have those intimate settings because you can actually go shake hands and talk to people. I love house shows for that because you're a part of the party rather than the entertainment, etc. Right. I love house shows and the entertainment at house shows every now and then. Yeah. Or the background music. Pretty diverse in how they go. But we also have been doing that enough that there's maybe 10 houses in the US that we could do every year. Wow. Which is wild. Yeah. And really fun for me. I love potlucks and barbecues. Usually they provide food. At this point, we have a small but loyal fan base, so these people are my friends and people I care about and want to catch up with. So I enjoy that intimate setting. It's a lot of social work, which I wasn't expecting getting into the music game in my 20s. Meaning you're becoming their psychologist as you're at the mall. More that socializing at that volume is laborious. Totally. Not in a bad way, but it just is a draining thing. Yeah. When I get home from tour, I kind of have to be in my building by myself for a while. Do you have ways built in, like when you're at house shows or even venues, to protect your own energy level? Because there's that weird fine line between not wanting to blow someone off. You want to respect their support of you, but you can't make yourself totally available at all times. Right. Yeah. Usually we ask that there be a room that we can go into. Honestly, I don't use that too much. Probably more now, over the pandemic, I had a child and my son's three and a half now. So this tour was the first one where I feel like he was really cognizant that I was not there. So whenever I was having a moment of free time, I was trying to FaceTime with him. Which FaceTime with a three and a half year old is usually a three or four minute thing. But it was nice to have those rooms to go find him. And then he'd usually want me to show him if there were any kids there. So I kind of tore him through the party on FaceTime and cruise back. And somehow that actually gave me a nice, I feel like people give you space when they recognize what you're doing like that. And again, we know so many of these people. I feel like the first time is always that we do house shows a bit like testing the waters and getting to know someone. But now kind of people."
  },
  "podcast_summary": "In this episode of the DIY Musician Podcast, James Phillips of the band Bombadil is interviewed. Bombadil is a folk band that has been together for 18 years and is seen as the embodiment of the DIY musician. They have achieved success and turned their band into a business. James shares their journey and the strategies they have used to succeed. They discuss topics such as joining an existing band, working with record labels and booking agents, using social media (primarily MySpace and email newsletters), touring and playing shows, diversifying sources of income (including house shows), and the importance of persistence and volume in the music industry. They also touch on the impact of song placements in TV and film, but note that while it's a feather in their cap, it hasn't had a significant impact on their fan base. Throughout the interview, James emphasizes the importance of treating music as a career and putting in the time and effort to achieve success. They also discuss the challenges of balancing personal life and touring, as well as the need for self-care and boundaries in managing energy levels. Overall, the podcast has a laid-back and conversational tone, highlighting the camaraderie and friendship between the hosts and guest. There are moments of humor and nostalgia as they reminisce about the early days of touring and the changes in the music industry over the past 15 years. The main takeaway from the episode is the importance of persistence, creativity, and perseverance in building a successful music career.",
  "podcast_guest": "James Phillips",
  "podcast_highlights": "1. \"You got to write a lot of crappy songs to write one decent one, I think.\" - James Phillips\n\nThis quote emphasizes the importance of persistence and volume in songwriting, acknowledging that not every song will be a hit, but the more you write, the greater the chance of creating something good.\n\n2. \"I think if I have one piece of advice, yeah, it is that, just like persistence, stubbornness, and volume. It's always better to do something than not to do something.\" - James Phillips\n\nThis quote further emphasizes the value of persistence and taking action. It suggests that it's important to keep pushing forward and taking steps, even if they don't always lead to immediate success.\n\n3. \"I figure that you're probably also creating more meaningful fans when you have those intimate settings because you can actually go shake hands and talk to people.\" - Christina\n\nThis quote highlights the benefits of intimate performances and personal interactions with fans. It suggests that by connecting with fans on a personal level, artists can build a stronger and more dedicated fan base."
}