{"podcast_details": {"podcast_title": "The New Music Business with Ari Herstand", "episode_title": "A Sync Licensing Music Executive is Changing the Game", "episode_image": "https://assets.pippa.io/shows/614da10f772a06733661598c/1659202057312-f105d523ac15bf7f40e73f2d40a9c4d1.jpeg", "episode_transcript": " That's why indie musicians do so well in sync. And it's still kind of like their world because if they have their housekeeping in order, meaning they know where all the bodies are buried, um, or they, they wrote and recorded their song, they're likely going to get a sync over maybe somebody who has like 16 writers and, you know, et cetera. I always love being able to represent both sides of music because it makes it more, what we deem more clearable in sync because the less parties you have to, to get in contact with, to clear something, the easier it is to license it. Right. So artists that we work with, they really want to win in this space, but maybe they worked with a co-writer that signed to a major publisher and they're playing a different game. This is when, uh, it's the most frustrating for me and also the most frustrating for my artists because, you know, there are partners and I want to see them succeed. And when an artist can't feed themselves and they're living paycheck to paycheck, you know, a $5,000 placement can make a really big difference in their lives. And, um, it's not something to poopoo in my opinion. This episode is brought to you by band Zugal from garage bands to Grammy winners, band Zugal powers the websites for tens of thousands of musicians around the world. I can tell you firsthand band Zugal is awesome. I've been using them for years. I've built many, many websites on band Zugal. It's super simple. You don't need any coding knowledge, graphic design knowledge. I'm actually a really terrible graphic design artist. I'd like to think I'm okay. I'm decent. I have Photoshop and you know, I've designed my fair share of show posters over the years. I should not have. I'm not a good graphic design artist. I know my strengths and weaknesses. Anyway, band Zugal, you don't need any of that. You can be a horrible graphic designer artists like me. You don't need any coding knowledge. I know very, very, very basic HTML that I learned about 15 years ago. I can still design kickass websites on bands ago. They also have a bunch of other cool features like a way to create an EPK. You can host and create your custom domain name. There's tools to sell your music and merge. It's all committed commission free. There's a mailing list. There's social media integrations. They have a crowdfunding feature, which is very new and very cool. They have a subscription service kind of like Patreon also all commission free. If you want to try out band Zugal, you can go to band Zugal.com. Use the code Ari. That's just a R I my name Ari for 15% off the first year of any subscription, but you get a 30 day free trial to just give it a go. Try it out. What's going on? Welcome to the new music business. I'm your host Ari Hurstand, author of how to make it in the new music business. The book third edition is out everywhere. Now, audio book, ebook, hardcover book, however you like to consume your books, you can find the book wherever you get books. Today, my guest is Jessica Vaughn. Now Jess wears many hats in the industry. She is an artist. She's a songwriter. She actually has one of those nifty songwriter profiles on Spotify because she's written for so many other artists and she has many artists projects and has had countless sync placements with her own music and songs that she's written and performed on. She has the artist projects, Laces, Jay Poland, Charlotte sometime, sometimes just to name a few of them. And she has had many other releases just for other artists. But currently today, what we're mostly discussing is her role as head of sync at Venice music. Um, and she also is the president of head bitch music, which is a kind of indie label as well. And, um, she, so she's, we, we cover all of this in the conversation, but the, the primary focus of this conversation is sync. And, uh, you know, her experience in sync, not only placing her own music now, head of sync at, uh, Venice, she's landed placements in, uh, Superbowl spots, uh, with the NFL ESPN, the CW, Netflix, Hulu, CBS, MTV, VH1, BET, Disney plus. Peacock, I mean, you name it. It's just pretty much everybody she's worked with and gotten songs placed from her artists, um, and for herself and all of that stuff. So we really cover, um, the whole kind of sync realm right now is where we're at. Um, it's changed quite a bit, uh, you know, but where we're at kind of midway through 2023. And so we had a very fascinating conversation. We even got into AI, um, and how AI music is going to affect, uh, sync. We talked about the, the writers and actress strike, uh, happening right now. And, and, you know, what musicians and songwriters can, can kind of do and, and what to look out for in contracts and how to negotiate. And then we, we break it down. We, you know, we go very into the weeds, very deep, very specific with how licensing works, how music supervisors, uh, want to be contacted, can be contacted, uh, where to find them, who to talk to, who are the ones that want to be contacted, who are the ones that don't. We talk a bit about how licensing works and breakdown of royalties. And we talk about how the specifics of licensing works with the master and publishing and all that stuff. But then we, we zoom out to the 30,000 foot view and we talk about the state of the industry and where we're heading. So this is a very fascinating conversation. We went on a few tangents. Jessica is a, a brilliant mind in the industry and executive now in the industry. And I was so thrilled to get to chat with her on record. Uh, we've chatted a bunch at conferences and other stuff, you know, off the record, uh, over the years. And so, um, it was great to kind of catch up in this more formal setting. You can find Venice music on Instagram and, uh, Venice music.co. You can find Jessica Vaughn on Instagram and, um, on all the socials on, you can find head bitch music on Instagram as well. You can find, uh, her also on LinkedIn and on Twitter. You can find all of us that make the show happen at Ari's take on Instagram, Tik TOK, Twitter and threads. Are we still calling it Twitter? Are we calling it X? I've lost track. I don't really know what's happening in Musk's brain right now. So I don't know. We, we find us in that platform, formerly known as Twitter with the bluebird. I don't know what's going on. Anyway, we're there. You can find me at Ari Hurstand on Instagram and threads. Visit Ari's take.com. Get on the email list. That's where we send out the most important up-to-date information about the new music business. Go to Ari's take.com. But right now, just, just pause the episode, hit subscribe, hit follow, leave us a five star review. Uh, however you're listening to this on Spotify or Apple podcasts or wherever you're listening, give us a thumbs up on YouTube, all that good stuff. All right, let's kick into the show. Jessica Vaughn. Welcome to the show. Hi, thanks for having me. Yeah. Yeah. Um, so, um, you are a very fascinating, uh, person to me in the industry as a fellow artists, songwriters slash kind of industry person, executive, just wearing all these different hats. Um, and over the years, you know, I'm not, I don't, we don't have time unfortunately to get into your entire backstory, which you've had like 12 different careers up into this point, but, but they all, as I was going through this, they all make perfect sense to me. And they like, and this like trajectory makes a lot of sense, but like, I want to focus more like right now where we're at present day, because I think that's, um, incredibly interesting and specifically in the sync licensing realm, because that's what you've been specializing in for, for so long. Um, and, and you're kind of your new, well, it's not actually, I guess, new anymore, but role at Venice as kind of their head of sync. Um, so why don't you just like start off by just telling us about kind of what your current day to day is in all capacities, you know? And so if, if Laces slips into that a bit, a songwriting, you know, the release schedule, all of that, I'm curious, like in this moment where we're at in, you know, uh, nearly August, 2023, like, what are you doing on a day to day basis? Yeah. Um, that's a great question. Um, I ask myself that every day. Um, so right now I'm the head of sync at Venice, uh, music, which is a distribution company. We offer, uh, high level services strategy, distro and sync. Um, so I run that department globally. Um, and then I'm also president of my own company called head bitch music, cause I don't want there to be any confusion. I am the head bitch. Um, and we also have a label imprint. We do custom music, um, as well as my husband's management company is also a DBA on head bitch. Um, and your husband, Ryan Vaughn, who is going to be our next guest on the music podcast. So stick around for that, but yes, continue. Yeah. We like to keep it a family business. Um, and then we also do a ton of songwriting under HBM as well. So I am a, a still a professional songwriter. I have many artists projects. So, um, my day to day looks different every day. Yeah. Um, you mentioned custom music. What does that mean? Yeah. So beast spoke music. So like, um, I work with Hasbro, the toy company and Fox and Paramount and box sign, and what we do is that we create music, um, based on their specifications. So maybe that's for a show. Maybe that's for a toy or a product. Maybe it's for a commercial. Um, but people come to us to kind of problem solve their music needs and it looks different depending on the project. Give me an example. Yeah. So right now we're, we just released the my little pony EP for their, I think it was their 40th anniversary. And so we did a bunch of re-imagined themes of, uh, you know, the main 80s theme. So we have like a 90s girl pop version. We had an acoustic version and 80s remix. So, um, they came to us to kind of, uh, figure that out with them. And, uh, another example is a box sign. There's a toy called Tony's and there's, it's a, uh, screenless speaker box and little toys go on it and there's, uh, albums worth of music on the toys. And we're responsible for creating original music as well as, uh, the covers for, uh, the toy. Cool. And when you say we, uh, specifically, what does that mean? Yeah. So I have a team of amazing, um, up and coming and, you know, very professional, uh, singer songwriters, producers, um, that I have worked with, trained them. Um, and so it's me as well as, um, this amazing group of, uh, a lot of amazing women and a lot of amazing men. Um, because apparently I cannot be everywhere all at once, even though I try to be. Right. So, so Hasbro will come to you and they say, okay, we're doing this My Little Pony, um, you know, anniversary special thing. We'd like to turn it into an EP. Can you, Jessica, help us with that? And you're like, yes, I totally can. Then you go back to your team and you're like, all right, guys, this is what we need to do. And, uh, I think I can sing this one, but like my voice wouldn't, maybe, uh, isn't connecting so much for this like 80s remix one. So why don't you sing this one? And like, maybe you're the best producer for this. Is that kind of, so you're almost kind of like A&R in the project, like you're running a production company or something. Yes, it's very much a creative direction, A&R and creation. Um, and so I'm always on the side of how do we get the best possible product? And, um, it doesn't always involve me as much as like, I think as a former artist, you know, I, or I guess I'm still an artist, but you know, doing the whole song and dance. Um, I think that that's can be challenging, um, when you're first starting out. And now I look at it as an opportunity and, um, it's so fun to be able to create like actual monetary wins for my friends and the people that are up and coming. How do, is this considered these, this relationship with Hasbro and these other toy companies and all of that? And I don't, I don't know how the licensing works in this capacity. Is it similar to sync where they're going to pay you kind of an upfront fee for these songs that's going to be placed inside the toys slash they might probably want to use it for maybe commercials or something like that? Or, or what are these licensee, what are these deal? If it even is a license, like what does it look like? Yeah, I mean, every project requires a different set of licensing or buyout or an exchange of rights. And that's always, I think no matter what you do, the rights that you exchange are always up to negotiation. I always wear my licensing brain no matter where I am and what I'm working on. So if there is a play to be able to license a song, if we're creating it from scratch, I'm always going to want to try to retain some of those rights, but sometimes it's not possible. So it just depends on the relationship and what they're going to be using the songs for. And that can change. So I wouldn't say I'm responsible to do any of the music supervision though. If I am, let's say doing a cover of a song, I don't have to be the one to license that when I'm doing custom music. That being said, like when I'm working at Venice, I definitely have worked with major brands and we're making music with our artists that's original. And a lot of times that will be a licensing term. And I try to keep that down to a year and then retain those rights. Because usually the artists and the company are taking on the liability. Right. So that's something happens. Right. So, okay. So let's talk about your role at Venice and kind of head of sync there. And you're essentially correct if I'm wrong, but it sounds like you're kind of acting as a sync agent and you have, is that correct in that? I guess so. I mean, I always feel like the word agent is just reminds me of like these huge agencies and I don't feel like a used car salesman. No offense to anybody who does sales, but I'm not like, oh, my name is Jessica Baum on a future license from us. I feel like I'm not wheeling and dealing. I'm really listening to the artists that we have. Where's our catalog? What's missing in our catalog? What are my clients consistently coming to me for? And how can I better support the artists and communicate and translate the needs of my clients? So at Venice, yeah, I mean, they range. I handle all media. So film, TV, advertising, and gaming, and I run the department globally. So everyone. But just specifically for people that aren't really familiar with this realm of the industry, when you say film, TV, so I'm just going to, I'm going to, I'm going to force you to get specific in a lot of these areas just because it helps illustrate what we're talking about for people that aren't really familiar with this. So a client might be Netflix, a client might be HB or Max, I guess now, or Fox. Streamers, yeah, so streamers, streamers are like Hulu, HBO Max, you know, Netflix, et cetera, Amazon Prime. But then you have your network TV like CBS, ABC, NBC, and then you have films and that could be like huge theatrical releases or it could be an indie release or, you know, a film festival circuit. And then you have advertising and you're either working directly with the brand or an agency that supports the brand. So for example, there's plenty of huge, huge brands that work with outside music supervision companies that will be the ones who are actually sourcing and licensing and negotiating the music on their behalf. And then you have gaming and that can be in the game or it could be maybe a trailer around the game or promo or their gaming radio. So there's a lot of different things and they all require the same rights, but they all kind of have different terms to the deal and different fees that are associated with that style of media. And so the client, because they're the ones essentially like signing the contract and paying you the money for these upfront fees and dealing with the licensing and stuff like that. But really the people that you're working with, you mentioned music supervisors, where do they fall into all of this? Yeah, I would say similar to my position, which is, you know, I'm going to be pitching the music and negotiating the terms of that agreement or that license on behalf of the artist. For me, I work with the sound recording or the master rights of a song because I work for a distribution company. I'm the middleman, right? Like I'm not the artist. I am basically the delivery system and the negotiator on their behalf. I'm the artist representative. And then you have the music supervisors and they're the representative of their client. And maybe it's a production company. Maybe it's a brand. Maybe it's a game and that can look differently. So it's their responsibility to kind of what is the budget for this specific media or this specific use? What kind of music is my client looking at? How can I negotiate the best deal? How can I make sure that they're not going to have a headache? So they're really also middlemen. So we're both kind of coming together, working out a deal that is fair or we deem fair to both parties. And then we try to lock and load that. And sometimes music supervisors will also have somebody else clear for them or maybe the company they work for will clear it. But they are responsible for, you know, kind of helping source that music. I think that there's a lot of confusion about that with music supervisors. And just like anything in business, some people have more power and some people don't, right? Like a lot of people think, oh, Jess is really going to get my song into this TV show. But I'm always at the mercy of my client what works for their narrative. Does the song work for their narrative? Does it lift it up or does it distract? Does it fit within their budget? I can get it in front of the supervisors, but then the supervisor has to also deem the same things to be true. And then they have to give it to their client and the client goes, actually, I'm going to license my nephew's song. So, you know, there's a lot that goes into it. And some music supervisors... Hollywood nepotism at its finest. You can never avoid it. Yeah. Even in sync, right? Even in sync. And some supervisors, you know, they're a part of the music producers, you know, they're a part of the production and they might have a bigger voice in the choosing or the selection of the music. But that's not always the case. And so I think, again, we were all just kind of working together and maybe taking away the fantasy that everyone's going to save you would be helpful for everyone. No, it's great. Yeah. No, absolutely. And it's really a helpful perspective, especially for artists, to understand the process that, you know, there is no one God that's part of this. I think a lot of people either look at, you know, people like you, the sync, I call them agents, but I know whatever you want to call it, you know, or like the music supervisors are like the people that hold the keys to the universe or they have the full authority to do anything. But really, you know, sure, you pitch the songs you think are best based on what their needs are, then they pick the songs that they think are best from what they've been pitched based on what their needs are. But then they still, there's this whole jury of people like the director or the producers or the studio or the ad company, like you mentioned, that also have to sign off on it. I mean, you know, my wife is an artist who, you know, and she was in the running. She had this song that was pitched, cleared, licensed, contracts were signed for now. This was a couple of years ago. This was a national ad campaign for the vaccine. This was going to be like the United States official commercial rolling out everywhere to try to promote the vaccine, be like, all right, it's safe. It's here. It's ready to go. And it was a hilarious and amazing commercial. It was so good. And it was her song and it was her voice and she wrote it and it was, and they sent, they sent her the actual final edit, the cut. They're like, and it was like Wednesday. It's like, all right, it's airing Friday. And we're like, oh, oh my gosh, we did. This is incredible. It's great. So Friday we're like, you know, flipping the channels, trying to like, when is this getting looking on YouTube? Like, where is this airing? Why isn't this up? We can't find it. And then we hear the next day that someone at the very, very, very, very top of the government was like, oh, I don't like that one lyric in this part here. No, we got to scrap the whole thing. I'm killing it. We're pulling it. Yeah. And we're like, what? So it's like, even at that stage, there's people behind the curtain that you don't even know about. And, you know, and then she never got paid, of course, because it didn't air. You don't get paid. It's, it's pretty wild. And depending on what the terms of the, the deal was and what the license says, you know, they probably protected themselves so they didn't have to pay her. But, you know, I try to avoid that. But I will say that when artists ask me that they're like, okay, so like the quote happened. So like, when's it going to air? And I'm like, right. Well, maybe I was like, as soon as I know, you'll know, but I probably won't know because they probably won't tell me. And then I just have to Google and look, and then I listen and I watch everything. And I'm like, so it looks like it's confirmed because we don't always get the confirmation from our clients. And I think, you know, why that seems so insane. I would say it happens more on the TV side. It's not going to happen on the advertising side really, because it moves so quickly. And there's just a lot, a lot more that goes into that. But with TV, they have so much content. They're responsible. Let's say it's back to back, wall to wall music and a show. Let's say there's like a hundred songs. They have to reach out to all of the rights holders before it airs. The likelihood of that happening while they're also licensing a song and quoting on other episodes is low, right? It's probably, they're probably behind. So sometimes we'll get a confirmation, maybe the day of, maybe a week later. Luckily, I'm pretty on top of it because I understand what that feels like. Not knowing that your song got confirmed and it's on TV and you are not prepared to support it. So I really try to, I empathize with that. So I really try to over communicate. But yeah, it can happen. And sometimes it's like, you know, you'll get a confirmation and they can still like change their mind. So it's not a sure thing until something airs. And I wish I had better answers to give to creators, but I don't. The world's crap. Yay. Yeah, you're right. Yeah, of course. I mean, in the past, I've gotten texts from friends who were watching a show in real time and like, I think I hear your song on this. I'm just like, nobody told me this. Like I knew I was maybe in the running, but like, come on communication people. But like it makes sense, right? With shows like that that are, you know, yeah, just placing music so frequently. So I want to go back to something you mentioned a little while ago. You, and just to break this down a little bit, you mentioned master rights and that you are only really representing the master rights within Venice because Venice is a distribution company. So you're only dealing with the master rights and you're not dealing with the publishing with the songwriting side of this equation. Can you talk about what that means more specifically, but also maybe some of the challenges that go into this just representing the master, like you said? Yeah, 100%. I always love being able to represent both sides of music because it makes it more, what we deem more clearable in sync because the less parties you have to get in contact with to clear something, the easier it is to license it, right? So that's why I think- Both sides mean master and publishing. The master and the publishing. Got it. And I would say that's why indie musicians do so well in sync. And it's still kind of like their world because if they have their housekeeping in order, meaning they know where all the bodies are buried, or they wrote and recorded their song, they're likely going to get a sync over maybe somebody who has like 16 writers and, you know, et cetera. So like I said, I work for a distribution company. So we release sound recordings, right? So sound recordings, master recordings, it's my responsibility to negotiate on the behalf of the artist or the rights holder. On the sound recording side. It's a little bit easier in my opinion to do that than on the publishing side because usually publishing is much more complicated. I worked for a publisher, so in sync. So that is where I came from, which makes working with the sound recording a little bit easier for me. I'm like, oh, really? You don't have to do all this stuff. I still do all of it. And by doing all of it is that there is no sync if not all parties clear the song. So let's say I have 100% of the master or control of 100% of the master for synchronization purposes, but there are three writers and they have three different publishers on the publishing side, equal splits. I need to know who the writers are. I need to know who the publishers are, their point of contact, if they have any like threshold that they won't clear for anything under this amount of money, et cetera. Maybe they don't want to have their music be used in certain ways. And if I don't know that, I might pitch to like a Target ad or something. And they hate Target. They hate commercialism. And they're not going to clear it. That means there is no sync. And if no one can get in contact with the other writers or the other publishers, then authority decisions are taken suddenly, why don't we just all do it with like internal and internal"}, "podcast_summary": "podcasts? I could do marketing partnership deals and then all the artists could split the licensing fee equally. And then on their W9, I just make them see themselves as distribution partners and music supervisors. And then because they're interested, there's no need to negotiate multiple licenses. Instead, they just have to work with the company and into the different kinds of deliverables. It would be so much easier. And I think that the chances of artists to succeed in sync is higher if they have all of that in order. So on the master side, we still face challenges. I'm like, okay, I know what the master is. It's super simple. I can make sure that this must be sound like I can get the instrumental and the caps in it. I can get different versions. I can get the lyrics. It's super easy because I'm in possession of the sound recording. I can't do that. So challenges that we've come across are literally not being able to get in contact with some people. And also, you have musicians that can't afford a publishing deal and they meet people and then five years later, they don't even know that they assigned their publishing rights. And no one has stake in their career that kind of they don't know. And this is when it's the most frustrating for me and also the most frustrating for my artists because they're partners and I want to see them succeed. And when an artist can't feed themselves and they're living paycheck to paycheck, a $5,000 placement can make a really big difference in their lives. And it's not something to poopoo in my opinion. So it's so frustrating because I feel like they get punished. And also when you're a marketer and you maybe can't find even sometimes the artist, maybe you can find the songwriter, maybe you can find the master, but no one can get back to you in a timely manner. They have to pass. Chances are, you know, even if you've been tracking that song for years and they're like, \"Oh, I want to license that track,\" chances are you've found another. And, you know, that's what \"Hedwig and the Angry Inch\" is all about. It's like, just try to create something where we can have checks and balances with each other, keep everything in house so that we don't have these complications. I can do my best to mitigate some of the, to mitigate the complications that come along with, you know, sync and publishing and master ownership. But at the end of the day, until you can have that conversation, sometimes it's impossible. And by having everything in house, I found that to be the most, that has worked the best. But yeah, there's a lot of complications when you're just talking with trying to clarify who is responsible for what rights. Because... Right, yeah, especially in the independent artist world where, you know, maybe they is probably the last thing on their mind when they... They think songwriting. Yeah, you're right, exactly. And that's like, I mean, that's where I come from. I'm a DIY artist. I don't ever want to have to deal with publishing. Like, you don't want to have anything to do with it. I don't know anything. Yeah, I don't want to. Yeah, happily, I don't want to, you know? But classically, it was, we were forced to. And now I think there's such a learning curve and there's such an education. Like, people are becoming... People are becoming aware that like, oh, wait, I can, you know, I don't need a publisher. Yes, you don't. And I tell artists this all the time. And just have your housekeeping order. Just make sure you know that you wrote the song, you recorded it, and you know it, and you have the files. You're already doing it. You're the producer. And, you know, people think that like, oh, if I get a publishing deal, then they'll do all the work for me. No, you still have a lot of work to do, you know? And like, what your... And just reiterating what you said about, you know, with these complications, if you're not available, if these people can't get in touch with you, then, you know, these opportunities can pass by. And I think that's really important. And again, it's something that I try to emphasize over and over on this podcast is like, you never know what's gonna resonate with somebody. And it might be something you wrote 10 years ago and it blows up overnight because somebody discovered it or somebody wants to use it in a commercial or a TV show. You just never know. And so you always have to be prepared and have your housekeeping in order, like you said. So, to wrap this up, I want to talk about something that I think is, could be considered controversial or at least it's being debated right now, but the rise of AI-generated music and how that is affecting the sync world. So, what are your thoughts on that? What are you seeing with AI-generated music in the sync world? Are there opportunities for that music to be placed? Are there challenges that come with that? Yeah, it's funny. I had a conversation with my husband about it today. We went on a walk and, you know, it's so funny because it's just, I don't think it's well thought out because I just don't know if humans have the capacity to listen to AI songs from an emotional perspective the way they do human-written songs. And so, until that to seem materialized, I just-- what are we gonna-- are we gonna just all listen to computer-generated music ourselves and not have songs that express human condition or emotion on popular playlists? Like, how are we gonna do that? You know? At the same time, what other things can AI do? And then, when AI can do that, what does that mean it's gonna look for us? I don't know. It's fascinating, but, you know, I think a lot of musicians-- I've said this before, I think there's a built-in egotism to being a songwriter where they're like, \"No one can do what I do. You can't replace us. These fucking kids on their MacBooks can't produce a hit the way I can,\" you know? And I think that that comes across in their writing. A lot of these songs that have blown up have really come from people who believe in that-- that philosophy, what that theory is, is it? And we were talking earlier about my songwriting. I try to come at my songwriting as just, what does this song need? To feel. What's the arrangement need? What does the lyric need? What does the melody need? What does it need? And it's not about ego. It's about expanding and exploring possibilities. I don't know if AI has arrived at that, but maybe someday it will. I don't know. But I wouldn't sell humanity short of what their capability is. And it is tough, you know? We've seen AI take on different instrumental parts and then we've seen lyrics, we replaced lyrics with AI, but never has it felt, at least to me, I've never been like, \"Oh, this is a beautifully crafted, then it was like, 'Mm.'\" It's like, here's everything you need to know. It's \"Human Condition.\" It's just about like, I feel it between every single part that's supposed to be sad, it just builds so much anxiety. And I just, it's just, I've not experienced it yet. But I would say maybe by the time it arrives, like maybe that's what music needs. But people connect to stories and I think without stories it's gonna be a tougher sell. So, I don't know, it will be fascinating, but I don't think that there is a replacement for humans and human storytelling. It is the very, it's the fabric that knits us all together as a society. And that's just not gonna derail.\n\nYeah, no, I completely agree. And I think that's a really important point is that the emotional connection that we have to music, at least right now, is so deeply rooted in the human experience and in storytelling. And I just, yeah, I don't see that being replaced by AI-generated music. But it is interesting to see how it's being used and how it's being incorporated, you know, like you mentioned. Maybe taking on instrumental parts or, you know, generating lyrics or whatever it may be. And I think there is a space for it, but I don't think it's a replacement for the work that humans are doing.\n\nAnd I also think too, though, like, you know, as a songwriter, as an artist, like we're always improving and it leaves space for us to be creative. And you've heard, I think, you've definitely heard me say this before, but take advantage of what computers can't do. So don't be mad that AI can replace something or maybe it's like fun or maybe it's cold and successful to you as a songwriter. And I, you know, we've all fit in the background music. Background music used to be orchestras. They still want background music, but they just like, honestly, don't really care here. Because commercially, music can be thrown off by the spoken word. So avoid that. And I would say that just ideally as a songwriter, I think that the way to be successful is to just always pushing yourself to the next level to be the best. Because until that me leaps the human experience, I don't think that's going to totally change the landscape of musical societies. Right. Yeah. I completely agree. Well, thank you so much for your time, Jessica. This has been a really fascinating conversation. I feel like I've learned so much about this world and there's so much more to discover. But thank you for shedding some light on it and for sharing your insights and experiences. Yeah. Thank you so much for having me. It's been a pleasure to talk. I love this stuff. So happy to make it more accessible or demystify. Is there any last, like, if you had to give one piece of advice to an artist who is looking to be successful in the sync world, what would that be? I would say educate yourself on sync and all the opportunities that are there for you. Get to know your sound recording, get to know your publishing, get to know the differences between them. Get to know your PRO and what they do for you. Reach out to supervisors, touch base with them, try to make a connection. Make sure you're registered with SoundExchange. Make sure you're registered with your PRO. Really, just be knowledgeable about your business because you're an entrepreneur of your own music. And if you choose to work with a publisher or manager, any of that, make sure they're doing work for you and that you are able to recognize and advocate for yourself. Be the CEO of your own music career. There's so many opportunities in sync and I always hear \"Oh, we'll do any money on the table with me.\" I'm like, \"My God, you are on the table with me.\" And they're right. I mean, millions and millions and millions and millions of dollars every day. They don't know who to pay. So it's your responsibility to make sure you know what you're supposed to pay in the same way the radio has to pay royalties and stuff and all of it. So yeah, just be responsible.\n\nYeah, absolutely. Well, thank you again. It's been such a pleasure to chat with you and learn from you. And yeah, thank you so much.\n\nYeah, thank you for having me. It's been a real pleasure.\n\nThat was such a great conversation. Jessica is incredibly knowledgeable and passionate about the sync industry. Her vast experience in both songwriting and sync licensing gives her valuable insights into this evolving landscape. In her role as head of sync at Venice Music, Jessica is responsible for negotiating licenses for master recordings with various clients, including streaming platforms, TV networks, films, and advertising agencies. She emphasizes the importance of indie musicians excelling in sync due to their ability to streamline the clearance process. However, challenges can arise when multiple writers and publishers are involved, highlighting the need for artists to have their housekeeping in order. Jessica also discusses the rise of AI-generated music and the impact it may have on the sync world. While AI can take on certain instrumental parts or generate lyrics, human emotion and storytelling remain crucial for creating a meaningful connection with listeners. She advises artists to continually improve their craft and take advantage of the unique qualities that computers are unable to replicate. Overall, Jessica emphasizes the importance of understanding the ins and outs of sync licensing and taking charge of one's music career to succeed in this lucrative industry. In summary, sync licensing offers valuable opportunities for indie musicians to generate income from their music. A clear understanding of the master rights and publishing rights involved, as well as proactive communication and relationship building with music supervisors, are key to success in the sync world.", "podcast_guest": "Jessica Vaughn", "podcast_highlights": "quotes that stand out from the podcast transcript are:\n\n1. \"That's why indie musicians do so well in sync. And it's still kind of like their world because if they have their housekeeping in order, meaning they know where all the bodies are buried, um, or they, they wrote and recorded their song, they're likely going to get a sync over maybe somebody who has like 16 writers and, you know, et cetera.\" - Jessica Vaughn\n\n2. \"When an artist can't feed themselves and they're living paycheck to paycheck, you know, a $5,000 placement can make a really big difference in their lives. And, um, it's not something to poopoo in my opinion.\" - Jessica Vaughn\n\n3. \"There's a lot that goes into it. And some music supervisors... Hollywood nepotism at its finest. You can never avoid it.\" - Jessica Vaughn"}