{"podcast_details": {"podcast_title": "Paid In Full Podcast", "episode_title": "Episode 27: How Artists Can Monetize From YouTube", "episode_image": "https://assets.pippa.io/shows/5e4f297b71514f3125850a34/1582249755159-157665b0af4373064fc5cb71db4f2182.jpeg", "episode_transcript": " Hey, what's up everybody? Welcome to the Paid in Full podcast. I'm your host, Joe Rausch, and this is episode number 27. It's the second week of 2021, and I hope you guys are staying safe. Hope you guys are staying healthy. It's been madness the first week of this year between everything going on politically and COVID still rampant. So I really hope you guys are taking care of yourselves mentally, physically, and staying safe and healthy. It's just super, super important. Try to remain optimistic. Hopefully we have brighter days ahead for everybody and we can make it through this year and all get the success and joy and peace that we're looking for. So really, really hope that for you guys. Thanks for tuning in. Just a little housekeeping. If you haven't yet, please subscribe to the podcast that makes sure you'll get updated every time we drop an episode. And if you want to give me a little rating and a review, please do. I would appreciate that. And if you want to sign up for coaching, we're still doing coaching on the weekends. You could sign up for free. It's on the website at PaidInFullPodcast.com. Just pop in for a 30 minute session and I'm happy to talk to you guys. Everyone that's taken me up on that, it's been great to talk to you. Really exciting to hear everything you guys have going on. It's super ambitious and it's really inspiring to see all the energy, all the innovative ideas, and all the enthusiasm and hope that so many artists have for this year. And I'm excited to see all the success that will come from that. So definitely tap in with the coaching and it would be great to connect with all you. So for today's topic, we're going to be talking about YouTube. And it's one of the things that have come up from time and time again with so many artists as touring and live performance has basically stopped around the world. That's taken a big hit for a lot of artists. And it's such a big way to get in front of people, engage with fans, and also make money. You sell merch, you sell concert tickets, especially for independent artists where not only are you trying to push your streaming and your music distribution, but touring and all the support that goes behind that is so important. So I've been getting a lot of questions from artists about how to properly build their exposure on YouTube so they can create, whether it's recorded concerts or vlogs or any type of way they can visually continue to get in front of people as another means using YouTube as a platform. So understanding that side of it, how to build a proper channel, and also how to really make money from YouTube. How does it work, especially for artists? So I want to broadly talk about the world of YouTube today. It's a quite complex world. There's a lot of moving parts to it, but today we'll do a general walkthrough of some of the important things that you need to know. The good thing is YouTube provides so many great resources for artists. If you just do a little research online, tap into their Creator Academy. They have a lot of resources, a lot of videos that will help walk you through things. And I suggest you really take some time, take a few hours to navigate all their resources. I think it would really help all the artists out there think about better ways of using YouTube and understand it a bit more. But today, let's run through some of the important things with the world of YouTube. So first off, for YouTube as an artist, when you're building a channel, it's quite difficult to actually monetize when you first start, because there's a lot of requirements that you kind of have to hit and grow. So when artists think about YouTube, the best thing I say, and I'm not like an expert in YouTube, but I've gone through a lot of the YouTube courses to become YouTube certified. And I just have learned a lot about optimization. I've helped people work through their channels to better engage with fans, to better make their videos, just connect better with keywords and tags and all that good stuff. So I have spent some time, but I'm not an expert by any means. There's some people that spend their life on YouTube that know it a lot better than me, but I'll hopefully give you guys some tips and some insight into the things that I've learned that have seen artists really, really grow their channel from just a few hundred to a few million subscribers. So first thing I got to say, if you're going to get in the YouTube game, you have to be serious about it and you have to be consistent about it. It's going to take time and energy and really look at it like a big time investment. It's really one of those things. The more you really put into it, the more you're going to get out of it. Now, of course, any video can have its viral moment, but those are kind of outlier examples. Those are not always the norm. The people that are being really successful on YouTube, like straight up YouTubers, are spending a lot of time and driving a lot of content and really, really cracking the code with YouTube and constantly engaging. A lot of artists aren't actually that active on YouTube. They have their music videos or they'll have their tracks up there or things like that, but they actually, a lot of artists don't spend a ton of time on YouTube. There's some other platforms that they use for their marketing, but I think if artists can start thinking about YouTube a little bit differently, especially in 2021, and thinking about creating content differently, then YouTube can be a tremendous creator platform. And at the end of the day, you guys are not just musicians or artists or performers, you're creators. And really think about all the content you can create around yourself as an artist. And the biggest thing that's going to get you to that success on YouTube is really putting in the time and creating really amazing content. So that's the first thing. Don't think like, oh, I'm seeing all these YouTubers make a ton of money from ad revenue and getting millions of views and millions of subscribers. It takes a lot of work. It's definitely, definitely a grind, and it takes a long time. So just know that going into it. And I suggest you do it, but definitely know what you're signing up for. Just like anything that you're getting into, know what you're signing up for and commit. You have to be a hundred percent committed or else it's really, really not going to work. So to start, the first way to kind of monetize from YouTube is going to come from ad revenue. And I'm sure a lot of you guys are aware of this, but when you create a YouTube video or you have your music up on YouTube, there can be ads that come in many different ways. There's banners, there's ads in the beginning, like full on, maybe 15 second clips. Like I said, there's the little banners that pop up midway through a video. There might even be some ads that pop in during the video and even at the end too. So there's multiple different ways ads can be placed on your video and displayed on your video. And because of those ads are there, advertisers basically pay YouTube and YouTube gets, you know, they generate ad revenue and a portion of that revenue will then go down to the artist, depending on, you know, your views of your video subscribers and however your video is weighted in the major calculation. And depending on what kind of ads there, there's a lot that goes into the actual monetization and calculation. But essentially when you do have ads on your video, there's the ad revenue model. So you're getting paid basically from those ads. Now, in order to monetize your video, you have to reach minimum requirements. And the first one is that you have to have a thousand subscribers. So that's actually very hard to do for a lot of people, you know, getting a thousand subscribers doesn't seem like that much, but it can take up to a year to really do that depending how hard you're pushing your channel, especially if you're an independent artist, that's kind of just starting out and, you know, you don't have a huge following yet, but that's what you want to build for that. That first thing that you want to hit is a thousand subscribers. Otherwise you're not monetizing. So don't think like once you, you know, start a YouTube channel day one that you start monetizing, no, you actually have to first hit your thousand subscriber mark. Then the second one is you have to have 4,000 hours of watch time in 12 months. So not only do you have to have a thousand subscribers, but it has to all the watch time that's calculated has to at least be 4,000 hours. So, you know, if you have, you know, whether it's a three minute music video and people are only watching 30 seconds of it, that's only going to count as 30 seconds. You know, it's not going to count as the full three minutes. So obviously it's a good idea to have all different types of timing content on your platform, meaning you may want to have your music video, your traditional, you know, three and a half minute music video all the way to maybe a 10 minute vlog or a 30 minute vlog, something that's a little longer that's going to maintain people on your site. And watching that video, that's how you can rack up your hours a bit more diversify the styles of video you have on. Because if you just have a bunch of really, really short videos, it's going to be more of a challenge to really hit that 4,000 hours. But if you can keep a person on your video for quite some time and really extend that, so long playing videos can actually have a real great benefit. So just another way to think about how can you get to that 4,000 hours of watch time per year, and that has to happen in the year. So that's why the first year you're not really monetizing unless you really hit these marks. And it does take a long time to do that. That's just the reality. The other thing that you're going to need is called an AdSense account, Google AdSense. And this is basically, you can sign up for free, but this is how once you are eligible to monetize, this is how it all functions through your AdSense account. So get that set up. You could just Google it, totally free to set up, very easy to set up, but you have to have that in place to start monetizing and getting paid. So make sure you have your AdSense account. Now, the other component to is having 10,000 lifetime views also across your channel. That's just another standard that you're going to need to is based on the actual viewership. All right. Now, as you're thinking about these different things and hitting these marks, in order to monetize, you'll have to sign up for YouTube's partner program. But like I said, once you become a part of their partner program, the thing is you have to hit these marks to become a YouTube partner. So I'm trying to explain it in a way of like, you know, so many artists are like, yo, I signed up for YouTube's partner program. How come I, you know, didn't get approved or I'm not monetizing? It's because you have to hit these marks in order to be eligible. So that's like the first thing you want to do is really start building your channel up and getting those subscribers and getting those hourly watches and those views. That's the best thing you can start to do before you even think about monetizing. The other thing is like, because you're dealing with ads, your content has to be ad friendly. And that's something a lot of artists don't think about, you know, ads, advertisers are only going to want to place their ads on videos that they align with. So YouTube actually has some guidelines around this. And I have the page up here, but just to give you a sense of how you can do that, just to give you a sense of kind of examples of content that's just not going to be suitable for ads. And it'll either limit your ads or give you just no ads on those videos. But some of the things they list is like inappropriate language, violence, adult content, shocking content, harmful or dangerous acts, hateful or derogatory content, recreational drugs or drug related content, firearms, controversial issues, sensitive events. So tobacco related content, adult themes, things like that. So keep in mind that this stuff may affect ads being placed on your videos. So when you're thinking about content look as artists, yeah, you know, there's artists that use obviously profanity, they're expressing themselves in all the different ways that maybe that may fall in one of these non ad friendly ways. And, you know, part of being an artist is doing those things is how you want to express yourself. However, just know that there are drawbacks to that. So you may want to create other content that may be more ad friendly or in line with things, even if your songs or some other content might not be as artist friendly. So just wanted to be that clear because yeah, some artists have come and said like, look, I've created all this content, but I'm not interested in it. I'm not able to get ads placed on it. And it could be because of one of these reasons. So definitely something just to, just to keep in mind when you're thinking about content creation, definitely don't want to stifle a creativity at all, but just be mindful of if you're trying to monetize YouTube properly, these are just some of the barriers that you may be up against as an artist. So just keep it in mind when you're thinking about the content you're creating. All right. So that breaks down the ad revenue and how you can start monetizing. So just to recap real quickly, it's a thousand subscribers, 4,000 hours of watch time in 12 months. You have to have an AdSense account set up and then 10,000 lifetime views, then obviously abide by the policies around getting ads placed on your videos. And that's how you will become a YouTube partner through their YouTube partner program. So that's the first way ad revenue. Now you can also get revenue through their subscription based model. So they offer YouTube premium where members, they pay basically like a monthly fee. So it's not based solely on ads. You can also, another stream of revenue is getting paid based off those subscriptions. So that just creates another stream of revenue that YouTube can provide. Also, they have YouTube music and as a premium member, you also get the YouTube streaming. So that's through their YouTube streaming app and all the music that's there. So if your music is on YouTube, which will probably be there through like a distributor, that's also another kind of separate stream of income, but in this YouTube universe. So already there's the ad revenue that can come, there's subscription based revenue that can come and then anything generated from your songs on YouTube music through that app. So those are just different types of ways to basically monetize using the YouTube platform. Now that's thinking of yourself when you start to build your channel. This is just beyond your music. And we're going to get into a couple other factors of how music gets on YouTube. But I wanted to break this down. Like if you're setting up your personal artist channel today and based on all the content you're creating and all the music that you'll have in that content or your music being used in other people's content, music can live in a lot of different ways on YouTube. So when you're building your channel, another great thing to strive for is to upgrade to an artist channel. And what that does, it gives you a lot of added benefits. It kind of creates a single place where all your content lives. It helps you better engage with fans. There's a lot of cool things with upgrading to an artist channel. And to do this, basically there are some requirements. You basically, one, you have to have a YouTube channel that represents you as an artist or a band. You have to have at least three official releases on YouTube that were delivered and distributed by either a music distributor or a record deal. And then have basically no violations on any of the YouTube policies. So they're real big on their policies. So definitely don't violate any of those two. Also in order to get an artist channel and upgrade to that, you do have to work with a YouTube partner manager and a part of their partner program. And that's what we just talked about earlier, meeting all those minimum requirements. So those are a couple of the things that you have to think about when upgrading to an artist channel. And I'll probably do a separate episode on exactly how to optimize and how you can pull all this stuff together. But this is just tapping you a little bit into what you can do as an artist on YouTube and what you should be researching and looking into. Now, a lot of you distribute your music through a distributor like Tunecore or DistroKid, something like that. Now, what they do is distributors, there are a lot of good advantages to it because one, they distribute what are called art tracks. And that's when your music is on YouTube and you basically have the song as a video, right? It shows the art of your track, but it's a video and you play it and it's just the song. There's no visuals or anything like that. It's kind of a static image of your art. They're called art tracks and those get distributed when, you know, often, and it always depends on your distribution deal, but often a lot of these distribution services and companies distribute art tracks to YouTube. So your music is automatically on there and that's different from you putting your music on there. So you yourself, if you work with a distributor that does that, you don't also have to personally put up an art track, but you can put up your official video or you could put up behind the scenes stuff, but you don't actually have to put your track up by yourself. That's again, a lot of the time done by your distributor and a lot of also distributors, they can upgrade your artist channel because they have a deal with YouTube. So if some distribution companies, when you do a deal with them, you're kind of like packaged into their deal and they could help automatically get your song upgrade, sorry, your channel upgraded to an artist channel too. Also distributors work with YouTube's content ID, so they can claim basically if your music is being used across other videos, let's say people use your music in the background or, you know, they just, yeah, they use your song in their videos for whatever they want. Maybe they're doing a performance themselves, using your background music, anything like that, a dance, whatever it may be. If your music, or maybe it's just another video that's out there of your stuff that's uploaded by another user, what a distributor is going to do is use YouTube's content ID to basically claim your song in those other videos and filter that money back to you, any of that ad revenue that's generated from other users. So you want to make sure that not just the content that's living on your channel that you're personally putting up there or your distributor is putting up there, but if you have, there's a lot of other users that are putting up your music in, you know, in their ways, then you want to be able to claim that revenue as well. So a distributor is going to help you do that. So this is like, I hear it all the time and artists is like, look, I put up my video, but now I've got like 10 other users that have put it up and they've garnered a lot of views on their videos. How come I'm not getting that money? I'm like, you often are, it's usually going through the distribution company, but you have to make sure that that money is being claimed properly. So just another thing to think about of how revenue can be generated. You can actually get it from other users now. And that's just, again, really important to collect all the uses of your music across the YouTube platform. So the other thing too, in terms of like where revenue is coming in from YouTube. So if you don't work with the distributor, but you have a label deal, like if you're with an independent label or a major label, usually in those contracts, they'll also collect YouTube revenue as well. Again, it's all based on the contract, but often labels function the same way. They're going to claim your music and get all the ad revenue that your music has been generating across their platform. So that's all going through the label. Now, just to be clear, this is sound recording money. So this is different from publishing, and we'll get into publishing in a second, but I just want to be very, very clear that remember if you wrote the song and recorded the song, there's two sides of the industry. There's the music publishing side that represents your songwriting, and then there's the sound recording, the artist side that represents your sound recording, your master. So when I talk about revenue being generated through, you know, it's going through the distributor or the label, or using the recording of your song, that's what I'm referencing. I'm not talking about publishing right here. So all this ad revenue and everything that we've been referencing is for the master. So you know, if you own your own masters, these are different ways that you can get revenue, and it's all, you know, get royalties. And this is all coming from the ad revenue or the subscriptions or things like that. Now, also, aside from just your music, you know, I talked about this too, creating like vlogs or other additional content when however, you know, your content, you're sorry, your revenue doesn't always have to come from your actual music. It can come from your videos, obviously garnering a ton of views and getting a lot of subscribers. So the more subscribers you have, the more views you're going to have. And the more videos you have, the more chances you have of getting more revenue. So the more content you're creating and building your universe on YouTube, the more chances you have of tapping into some of that ad revenue and some of that subscription revenue that YouTube has. So that's why it's so important to not just think about YouTube as a place to put up like music videos or art tracks, but it's a place to really create content, visual content. And this can be anything from like, like I said, a vlog, you know, a day in the life of behind the scenes, a recording session, maybe a live performance, maybe you're doing something like acoustically with you and you know, someone like a producer on a guitar or something or, you know, any way that you're thinking about creating content, as long as you put that in another video, that's content that gives people more things to tap into your world. People love watching the recording process or they just like you, you know, tapping into your life and seeing, you know, where you go to eat and seeing, you know, they, they, your fans are interested in you and the things you do. So engage with them in fun, different ways. And you know, YouTube also has like a lot of other resources for artists in terms of like merch or even like event, you know, selling tickets. If you're a touring, they do have a lot of other aspects once you build a profile and a channel with them that they offer, but really think about what are you doing to connect with your fan base through this platform? It's, you know, as an artist, it doesn't always have to be just your music. You know, for example, I knew an artist that actually was really great at origami, making like origami figures. And part of his YouTube channel was he had videos on instructional videos on how to make these origami figures. It was really, really cool. And people liked that. It was like a fun little thing that people didn't really expect from him, but something cool to just offer that wasn't just music. So, you know, really think of YouTube as a way to create all different types of content and keep engaging. And, you know, they allow you to make some playlists. So, which is great because people can tap into different sides of you. You know, you can have a playlist for, you know, the process and it could be your writing process, your recording process. It could be studio sessions. It could be, you know, live performances. You can structure playlists in any different way. It's really, really cool, but it gives people a place to navigate your channel. And again, really, really just diversifying the content that you have. And this is how you're going to be able to hit some of those marks so you can start monetizing. Now let's get into another side of this, which is publishing. So, if you write your own songs, if you're a writer, you can also get revenue from YouTube. And it comes in two ways. One, you've got to be with a publishing administration service. So, if you, or a publishing deal. So, if you're not in a deal or you're not with a service like, you know, a SongFest or Centric or TuneCorp publishing or any other publishing service that offers like administration, then you're not going to be able to monetize the publishing side of this, which is some income that you may be missing out on. So, definitely try to get your publishing represented so you can collect YouTube on the publishing side. Also, you know, you can also get your own music. You know, YouTube pays what's called a performance royalty, which I've talked about in various different episodes. Now, money from YouTube is going to go to ASCAP or BMI or CSAC or one of the performance rights organizations because when your music is used, whether it's in an audio audio visual way on YouTube, how, if it's being played through YouTube music, if it's being played through a video, anywhere your music is being played or performed on the platform. So, you know, and that doesn't mean live performance always. It just means if your music is being, if the sound of your music is being played, that's essentially what it is, then a performance royalty has to be paid. And that's why it's so important to make sure you're affiliated with a performance rights organization so you can get any royalties from YouTube on the performance side. And that filters right through and gets paid to those PROs. So definitely make sure on that side, on the publishing, that you're collecting royalties there as well. So a few different streams to think about this and how YouTube can be a viable way to generate income, engage with your fan base, and really build something to enhance, you know, yourself as an artist. Now, just know, like I said, it does take a lot of time. It takes resources. It takes energy. It takes thought, all those things. Definitely a big investment if you want to do it. But..."}, "podcast_summary": "In this episode, host Joe Rausch discusses the importance of YouTube for artists and how to monetize their content on the platform. He highlights the requirements for monetization, such as reaching 1,000 subscribers and 4,000 hours of watch time in a year. Rausch also emphasizes the need for artists to create consistent and high-quality content on YouTube to attract viewers and generate revenue from ad placements. He explains how distributors and labels can help artists claim ad revenue from other users' videos that feature their music. Additionally, Rausch mentions the possibility of earning revenue through YouTube premium subscriptions and YouTube Music. He advises artists to consider creating various video content beyond music to engage fans and increase their chances of monetization. Finally, he mentions the importance of having a publishing administration service to collect royalties from YouTube's performance royalties. Overall, Rausch highlights the potential of YouTube for artists, while also acknowledging the time, effort, and commitment required to succeed on the platform.", "podcast_guest": "Joe Rausch", "podcast_highlights": "Here are three quotes from the podcast transcript that stand out:\n\n1. \"It's going to take time and energy and really look at it like a big time investment. It's really one of those things. The more you really put into it, the more you're going to get out of it.\" - Joe Rausch\n\nThis quote emphasizes the importance of being committed and putting in the effort to succeed on YouTube. It highlights the idea that success on the platform does not come easily, but with hard work and dedication.\n\n2. \"Don't think like, oh, I'm seeing all these YouTubers make a ton of money from ad revenue and getting millions of views and millions of subscribers. It takes a lot of work. It's definitely, definitely a grind, and it takes a long time.\" - Joe Rausch\n\nThis quote challenges the misconception that becoming successful on YouTube is easy and quick. It emphasizes the need for patience and perseverance in building a YouTube channel.\n\n3. \"So definitely think about what are you doing to connect with your fan base through this platform? It's, you know, as an artist, it doesn't always have to be just your music.\" - Joe Rausch\n\nThis quote highlights the importance of diversifying content on YouTube and utilizing the platform to connect with fans in different ways. It encourages artists to think outside the box and create content beyond just music videos."}