[
    {
        "@context": "http://schema.org",
        "@type": "CreativeWork",
        "name": "Latent Space: The AI Engineer Podcast — CodeGen, Agents, Computer Vision, Data Science, AI UX and all things Software 3.0",
        "author": "Alessio + swyx",
        "description": "The podcast by and for AI Engineers! We are the first place over 50k developers hear news and interviews about Software 3.0 - Foundation Models changing every domain in Code Generation, Computer Vision, AI Agents, and more, directly from the founders, builders, and thinkers involved in pushing the c…",
        "datePublished": "Sep 20, 2023",
        "offers": [
            {
                "@type": "Offer",
                "price": "Free"
            }
        ],
        "review": [
            {
                "@type": "Review",
                "author": "sydescroll",
                "datePublished": "Jul 30, 2023",
                "name": "An AI Fire Hose for my Thirsty Brain",
                "reviewRating": {
                    "@type": "Rating",
                    "ratingValue": 5
                }
            },
            {
                "@type": "Review",
                "author": "AustinHale",
                "datePublished": "Jul 18, 2023",
                "name": "Fantastic Must-Listen",
                "reviewRating": {
                    "@type": "Rating",
                    "ratingValue": 5
                }
            },
            {
                "@type": "Review",
                "author": "michaelvvv",
                "datePublished": "Jun 23, 2023",
                "name": "Wonderful way to keep up with AI developments",
                "reviewRating": {
                    "@type": "Rating",
                    "ratingValue": 5
                }
            }
        ],
        "workExample": [
            {
                "@type": "AudioObject",
                "name": "Heralds of the AI Content Flippening — with Youssef Rizk of Wondercraft.ai",
                "datePublished": "Sep 20, 2023",
                "description": "Want to help define the AI Engineer stack? Have opinions on the top tools, communities and builders? We’re collaborating with friends at Amplify to launch the first State of AI Engineering survey! Please fill it out (and tell your friends)!\nIn March, we started off our GPT4 coverage framing one of this year’s key forks in the road as the “Year of Multimodal vs Multimodel AI”. 6 months in, neither has panned out yet. The vast majority of LLM usage still defaults to chatbots built atop OpenAI (per our LangSmith discussion), and rumored GPU shortages have prevented the broader rollout of GPT-4 Vision. Most \"AI media” demos like AI Drake and AI South Park turned out heavily human engineered, to the point where the AI label is more marketing than honest reflection of value contributed.\nHowever, the biggest impact of multimodal AI in our lives this year has been a relatively simple product - the daily HN Recap podcast produced by Wondercraft.ai, a 5 month old AI podcasting startup. As swyx observed, the “content flippening” — an event horizon when the majority of content you choose to consume is primarily AI generated/augmented rather than primarily human/manually produced — has now gone from unthinkable to possible.\nFor full show notes, go to: https://latent.space/p/wondercraft\nTimestamps\n* [00:03:15] What is Wondercraft?\n* [00:08:22] Features of Wondercraft\n* [00:10:42] Types of Podcasts\n* [00:11:44] The Importance of Consistency\n* [00:14:01] Wondercraft House Podcasts\n* [00:19:27] Video Translation and Dubbing\n* [00:21:49] Building Wondercraft in 1 Day\n* [00:24:25] What is your moat?\n* [00:30:37] Audio Generation stack\n* [00:32:12] How Important is it to Sound Human? and AI Uncanny Valley\n* [00:36:02] AI Watermarking\n* [00:36:32] The Text to Speech Industry\n* [00:41:19] Voice Synthesis Research\n* [00:45:53] AI Podcaster interviews Human Podcaster\n* [00:50:38] Takeaway\n \n\nGet full access to Latent Space at www.latent.space/subscribe",
                "duration": "PT876H56M40S",
                "requiresSubscription": "no"
            },
            {
                "@type": "AudioObject",
                "name": "Doing it the Hard Way: Making the AI engine and language 🔥 of the future — with Chris Lattner of Modular",
                "datePublished": "Sep 14, 2023",
                "description": "Want to help define the AI Engineer stack? Have opinions on the top tools, communities and builders? We’re collaborating with friends at Amplify to launch the first State of AI Engineering survey! Please fill it out (and tell your friends)!\nIf AI is so important, why is its software so bad?\nThis was the motivating question for Chris Lattner as he reconnected with his product counterpart on Tensorflow, Tim Davis, and started working on a modular solution to the problem of sprawling, monolithic, fragmented platforms in AI development. They announced a $30m seed in 2022 and, following their successful double launch of Modular/Mojo🔥 in May, have just announced their $100m Series A.\nWhile the performance claims of Mojo🔥 and its promise as a fully multithreaded compiled Python superset stole the show, we were amazed to learn that it is a side project - and the vision for Modular’s Python inference engine is at least as big.\nListeners will recall that we last talked with George Hotz about his work on tinygrad and how he wants to replace PyTorch with something faster and lighter, handwriting a “reduced instruction set” of operators himself. But what if the problem could be solved at even lower level - with the Python engine/runtime itself?\n\nChris on Compilers\nChris’ history with compilers is well known - creating LLVM during his PhD (for which he won the 2012 ACM Software System Award), hired straight into Apple where he also made Clang and Swift (the iPhone programming language that replaced Objective-C), then leading the Tensorflow Infrastructure team at Google where he built XLA, a just-in-time compiler for optimizing a lot of the algebra behind TF’s workloads, and MLIR, a modular compiler framework that sat above LLVM to optimize ML graphs and kernels that were hard to represent in the LLVM IR.  \nSo as pretty much the best compiler engineer in human history, you’d justifiably assume that Chris is simply choosing to take his compiler approach to Python. And yet that is not how he thinks about compilers at all. \nAs he says in our chat,\n“How do you enable invention? How do you get more kinds of people that understand different parts of this problem to actually collaborate? And so this is where I see our work on Mojo and on the engine…\n…I don't have a compiler hammer that I'm running around looking for compiler problems to hit.”\nToday a small number of people at companies like OpenAI spend a lot of time manually writing CUDA kernels. But an optimizing compiler for AI leads to compilers as a means to an end for increasing software collaboration, expanding the ability of people with different skillsets and knowledge.\n“…What is the fundamental purpose of a compiler? Well, it's to make it so that you don't have to know as much about the hardware. You could write everything in very low-level assembly code for every single problem that you have… But what a compiler really does is it allows you to express things at a higher level of abstraction.”\nFor Chris, compilers are also ways to properly automate generalized optimizations that might otherwise be manually coded and brittle abstractions, like operator fusion:\n“So NVIDIA goes and they build this really cool library called FasterTransformer. The performance point of using it is massive. So a lot of LLM companies and other folks use this thing because they want the performance.\n…Here's the problem. If you want to go innovate in transformers, now you're constrained by what FasterTransformer can do, right? \nAnd so, again, you come back to where are compilers useful?\nThey're useful for generalization. If you can get the same quality result or better than FasterTransformer, but with a generalized architecture, well now you can get the best of both worlds, where you have orthogonality and composability, you enable research, you also get better performance.”\nDone correctly, these operator optimizations being implemented at the compiler level amount",
                "duration": "PT1489H26M40S",
                "requiresSubscription": "no"
            },
            {
                "@type": "AudioObject",
                "name": "The Point of LangChain — with Harrison Chase of LangChain",
                "datePublished": "Sep 6, 2023",
                "description": "As alluded to on the pod, LangChain has just launched LangChain Hub: “the go-to place for developers to discover new use cases and polished prompts.” It’s available to everyone with a LangSmith account, no invite code necessary. Check it out!\nIn 2023, LangChain has speedrun the race from 2:00 to 4:00 to 7:00 Silicon Valley Time. From the back to back $10m Benchmark seed and (rumored) $20-25m Sequoia Series A in April, to back to back critiques of “LangChain is Pointless” and “The Problem with LangChain” in July, to teaching with Andrew Ng and keynoting at basically every AI conference this fall (including ours), it has been an extreme rollercoaster for Harrison and his growing team creating one of the most popular (&gt;60k stars at time of writing) building blocks for AI Engineers.\n\nLangChain’s Origins\nThe first commit to LangChain shows its humble origins as a light wrapper around Python’s formatter.format for prompt templating. But as Harrison tells the story, even his first experience with text-davinci-002 in early 2022 was focused on chatting with data from their internal company Notion and Slack, what is now known as Retrieval Augmented Generation (RAG). \nAs the Generative AI meetup scene came to life post Stable Diffusion, Harrison saw a need for common abstractions for what people were building with text LLMs at the time:\n* LLM Math, aka Riley Goodside’s “You Can’t Do Math” REPL-in-the-loop (PR #8)\n* Self-Ask With Search, Ofir Press’ agent pattern (PR #9) (later ReAct, PR #24)\n* NatBot, Nat Friedman’s browser controlling agent (PR #18)\n* Adapters for OpenAI, Cohere, and HuggingFaceHub\nAll this was built and launched in a few days from Oct 16-25, 2022. \nTurning research ideas/exciting usecases into software quickly and often has been in the LangChain DNA from Day 1 and likely a big driver of LangChain’s success, to date amassing the largest community of AI Engineers and being the default launch framework for every big name from Nvidia to OpenAI:\n\nDancing with Giants\nBut AI Engineering is built atop of constantly moving tectonic shifts: \n* ChatGPT launched in November (“The Day the AGI Was Born”) and the API released in March. Before the ChatGPT API, OpenAI did not have a chat endpoint. In order to build a chatbot with history, you had to make sure to chain all messages and prompt for completion. LangChain made it easy to do that out of the box, which was a huge driver of usage. \n* Today, OpenAI has gone all-in on the chat API and is deprecating the old completions models, essentially baking in the chat pattern as the default way most engineers should interact with LLMs… and reducing (but not eliminating) the value of ConversationChains.\n* And there have been more updates since: Plugins released in API form as Functions in June (one of our top pods ever… reducing but not eliminating the value of OutputParsers) and Finetuning in August (arguably reducing some need for Retrieval and Prompt tooling). \nWith each update, OpenAI and other frontier model labs realign the roadmaps of this nascent industry, and Harrison credits the modular design of LangChain in staying relevant. LangChain has not been merely responsive either: LangChain added Agents in November, well before they became the hottest topic of the AI Summer, and now Agents feature as one of LangChain’s top two usecases. \nLangChain’s problem for podcasters and newcomers alike is its sheer scope - it is the world’s most complete AI framework, but it also has a sprawling surface area that is difficult to fully grasp or document in one sitting. This means it’s time for the trademark Latent Space move (ChatGPT, GPT4, Auto-GPT, and Code Interpreter Advanced Data Analysis GPT4.5): the executive summary!\n\nWhat is LangChain?\nAs Harrison explains, LangChain is an open source framework for building context-aware reasoning applications, available in Python and JS/TS.\nIt launched in Oct 2022 with the central value proposition of “",
                "duration": "PT1013H53M20S",
                "requiresSubscription": "no"
            },
            {
                "@type": "AudioObject",
                "name": "RWKV: Reinventing RNNs for the Transformer Era — with Eugene Cheah of UIlicious",
                "datePublished": "Aug 30, 2023",
                "description": "The AI Engineer Summit Expo has been announced, presented by AutoGPT (and future guest Toran Bruce-Richards!) Stay tuned for more updates on the Summit livestream and Latent Space University.\nThis post was on HN for 10 hours.\nWhat comes after the Transformer? This is one of the Top 10 Open Challenges in LLM Research that has been the talk of the AI community this month. Jon Frankle (friend of the show!) has an ongoing bet with Sasha Rush on whether Attention is All You Need, and the most significant challenger to emerge this year has been RWKV - Receptance Weighted Key Value models, which revive the RNN for GPT-class LLMs, inspired by a 2021 paper on Attention Free Transformers from Apple (surprise!).\nWhat this means practically is that RWKV models tend to scale in all directions (both in training and inference) much better than Transformers-based open source models:\nWhile remaining competitive on standard reasoning benchmarks:\nswyx was recently in Singapore for meetings with AI government and industry folks, and grabbed 2 hours with RWKV committee member Eugene Cheah for a deep dive, the full recording of which is now up on Latent Space TV:\nToday we release both the 2hr video and an edited 1hr audio version, to cater to the different audiences and provide “ablation opportunities” on RWKV interest level.\n\nThe Eleuther Mafia?\nThe RWKV project is notable not merely because of the credible challenge to the Transformers dominance. It is also a distributed, international, mostly uncredentialed community reminiscent of early 2020s Eleuther AI:\n* Primarily Discord, pseudonymous, GPU-poor volunteer community somehow coordinating enough to train &gt;10B, OPT/BLOOM-competitive models\n* Being driven by the needs of its community, it is extremely polyglot (e.g. English, Chinese, Japanese, Arabic) not because it needs to beat some benchmarks, but because its users want it to be for their own needs.\n* “Open Source” in both the good and the bad way - properly Apache 2.0 licensed (not “open but restricted”), yet trained on data taken from commercially compromised sources like the Pile (where Shawn Presser’s Books3 dataset has been recently taken down) and Alpaca (taking from Steven Tey’s ShareGPT which is technically against OpenAI TOS)\nThe threadboi class has loved tracking the diffusion of Transformers paper authors out into the industry:\nBut perhaps the underdog version of this is tracking the emerging Eleuther AI mafia:\nIt will be fascinating to see how both Eleuther and Eleuther alums fare as they build out the future of both LLMs and open source AI.\n\nAudio Version Timestamps\nassisted by smol-podcaster. Different timestamps vs the 2hr YouTube\n* [00:05:35] Eugene's path into AI at UIlicious\n* [00:07:33] Tokenizer penalty and data efficiency of Transformers\n* [00:08:02] Using Salesforce CodeGen\n* [00:10:17] The limitations of Transformers for handling large context sizes\n* [00:13:17] RWKV compute costs compared to Transformers\n* [00:16:06] How Eugene found RWKV early\n* [00:18:52] RWKV's focus on supporting many languages, not just English\n* [00:21:24] Using the RWKV model for fine-tuning for specific languages\n* [00:24:45] What is RWKV?\n* [00:33:46] Overview of the different RWKV models like World, Raven, Novel\n* [00:41:34] Background of Blink, the creator of RWKV\n* [00:49:55] The linear vs quadratic scaling of RWKV vs Transformers\n* [00:53:29] RWKV matching Transformer performance on reasoning tasks\n* [00:54:31] The community's lack of marketing for RWKV\n* [00:57:00] The English-language bias in AI models\n* [01:00:33] Plans to improve RWKV's memory and context handling\n* [01:03:10] Advice for AI engineers wanting to get more technical knowledge\n\nShow Notes\nCompanies/Organizations:\n* RWKV - HF blog, paper, docs, GitHub, Huggingface\n* Raven 14B (finetuned on Alpaca+ShareGPT+...) Demo\n* World 7B (supports 100+ world languages) Demo\n* How RWKV works in 100 LOC, RWKV overview\n* EleutherAI - Decentralized open source AI research",
                "duration": "PT1203H3M20S",
                "requiresSubscription": "no"
            },
            {
                "@type": "AudioObject",
                "name": "Cursor.so: The AI-first Code Editor — with Aman Sanger of Anysphere",
                "datePublished": "Aug 22, 2023",
                "description": "Thanks to the almost 30k people who tuned in to the last episode!\nYour podcast cohosts have been busy shipping:\n* Alessio open sourced smol-podcaster, which makes the show notes here! \n* swyx launched GodMode. Maybe someday the Cursor of browsers?\n* We’re also helping organize a Llama Finetuning Hackameetup this Saturday in anticipation of the CodeLlama release. \nLastly, more speakers were announced at AI Engineer Summit! 👀\n~46% of code typed through VS Code is written by Copilot. How do we get closer to 90+%? Aman Sanger says we need a brand new AI-powered IDE to get there; and we’re excited to be the first podcast ever to tell the Cursor story.\nIf you haven’t heard of Cursor, you may have been living under a rock. Here are just some of the rave reviews going around in the past week alone:\n* “Cursor is the best product I've used in a while” - Alex MacCaw\n* “Someone finally put GPT into a code editor in a seamless way. It's so elegant and easy. No more copying and pasting.” - Andrew McCalip\n* “Coding with AI is getting insane.” - Mckay Wrigley\n* “This is mind blowing 🤯” - Linus Ekenstam\n* “Cursor + gpt4-32k = illegal levels of productivity” - Sully Omarr\n* “EL MEJOR EDITOR DE CÓDIGO con IA” - Carlos Santana\nA decade ago, “platform risk” meant building apps on social media platforms was risky as you could get cut off from the social network. \nToday, the AI version of “platform risk” is building AI products within an existing product (like an AI extension for VS Code, or a Figma plugin). Since Copilot, a generation of VSCode plugins have launched (including Cody, Cosine, and previous guests Codeium and Codium), only to be challenged by Copilot X itself.\nA core AI Engineering thesis is that new capabilities in AI demands new innovation in AI UX (and that AI UX can actually be a viable moat). Take VS Code for example; when Github was first working on Copilot, there was actually no way to support the “ghost autocomplete” feature we all use today. They eventually convinced the team to build it, and Copilot’s success speaks for itself.\nIf you’re a startup building on top of VSC today, you do not have the same access and influence on the roadmap. Your UX is limited to what they allow you to do, and often that caps your ability to successfully compete against them. \nSince Cursor owns the whole IDE, they can do things you can’t (yet) do in VSCode:\n\nCursor’s Gameplan\nCursor is competing head to head against VS Code by forking Microsoft’s IDE and building their own AI-powered version. A few of Cursor’s unique features:\n* Native chat: Chat is a core piece of Cursor. Users can choose between GPT-3.5 and GPT-4 to ask questions and receive answers based on their code.\n* “Mentioning” files: you can easily add files into your request context by using “@”; this works both for code as well as documentation. If you want to do a change that includes multiple files, you can include them in your question to make sure the change is reflected in all of them.\n* Custom prompting engine: Cursor built Priompt, their custom prompting engine. As your chats go over the context window size, Priompt figures out which messages to keep in the history, which files to drop from the prompt, etc. \n* Moving beyond typing: while IDEs are familiar to folks as today’s interfaces, in the future Cursor hopes to have agents you can delegate tasks to. Instead of a back and forth on a new feature or bug fix, you can ask it to do the whole thing for you end to end.\nAfter diving deep into Cursor we nerded out on model usage, training, quantization, and evaluation. There’s a ton of great content in this episode, we hope you’ll enjoy it!\nAs always, feedback welcome in the comments, and tag us on socials for future guest suggestions!\n\nShow Notes\n* Cursor\n* Gary Marcus’ cubes prompt\n* Priompt\n* “Humans should focus on bigger problems.”\n* Codium AI on Latent Space\n* Rift from Morph\n* Sourcegraph",
                "duration": "PT990H16M40S",
                "requiresSubscription": "no"
            },
            {
                "@type": "AudioObject",
                "name": "The Mathematics of Training LLMs — with Quentin Anthony of Eleuther AI",
                "datePublished": "Aug 16, 2023",
                "description": "Invites are going out for AI Engineer Summit! In the meantime, we have just announced our first Actually Open AI event with Brev.dev and Langchain, Aug 26 in our SF HQ (we’ll record talks for those remote). See you soon (and join the Discord)!\nSpecial thanks to @nearcyan for helping us arrange this with the Eleuther team.\nThis post was on the HN frontpage for 15 hours.\nAs startups and even VCs hoard GPUs to attract talent, the one thing more valuable than GPUs is knowing how to use them (aka, make GPUs go brrrr).\nThere is an incredible amount of tacit knowledge in the NLP community around training, and until Eleuther.ai came along you pretty much had to work at Google or Meta to gain that knowledge. This makes it hard for non-insiders to even do simple estimations around costing out projects - it is well known how to trade $ for GPU hours, but trading “$ for size of model” or “$ for quality of model” is less known and more valuable and full of opaque “it depends”. This is why rules of thumb for training are incredibly useful, because they cut through the noise and give you the simple 20% of knowledge that determines 80% of the outcome derived from hard earned experience.\nToday’s guest, Quentin Anthony from EleutherAI, is one of the top researchers in high-performance deep learning. He’s one of the co-authors of Transformers Math 101, which was one of the clearest articulations of training rules of thumb. We can think of no better way to dive into training math than to have Quentin run us through a masterclass on model weights, optimizer states, gradients, activations, and how they all impact memory requirements.\nThe core equation you will need to know is the following:\nWhere C is the compute requirements to train a model, P is the number of parameters, and D is the size of the training dataset in tokens. This is also equal to τ, the throughput of your machine measured in FLOPs (Actual FLOPs/GPU * # of GPUs), multiplied by T, the amount of time spent training the model.\nTaking Chinchilla scaling at face value, you can simplify this equation to be `C = 120(P^2)`.These laws are only true when 1000 GPUs for 1 hour costs the same as 1 GPU for 1000 hours, so it’s not always that easy to make these assumptions especially when it comes to communication overhead.  \nThere’s a lot more math to dive into here between training and inference, which you can listen to in the episode or read in the articles. \nThe other interesting concept we covered is distributed training and strategies such as ZeRO and 3D parallelism. As these models have scaled, it’s become impossible to fit everything in a single GPU for training and inference. We leave these advanced concepts to the end, but there’s a lot of innovation happening around sharding of params, gradients, and optimizer states that you must know is happening in modern LLM training. \nIf you have questions, you can join the Eleuther AI Discord or follow Quentin on Twitter. \nShow Notes\n* Transformers Math 101 Article\n* Eleuther.ai\n* GPT-NeoX 20B\n* BLOOM\n* Turing NLG\n* Mosaic\n* Oak Ridge &amp; Frontier Supercomputer\n* Summit Supercomputer \n* Lawrence Livermore Lab\n* RWKV\n* Flash Attention \n* Stas Bekman\nTimestamps\n* [00:00:00] Quentin's background and work at Eleuther.ai\n* [00:03:14] Motivation behind writing the Transformers Math 101 article\n* [00:05:58] Key equation for calculating compute requirements (tau x T = 6 x P x D)\n* [00:10:00] Difference between theoretical and actual FLOPs\n* [00:12:42] Applying the equation to estimate compute for GPT-3 training\n* [00:14:08] Expecting 115+ teraflops/sec per A100 GPU as a baseline\n* [00:15:10] Tradeoffs between Nvidia and AMD GPUs for training\n* [00:18:50] Model precision (FP32, FP16, BF16 etc.) and impact on memory\n* [00:22:00] Benefits of model quantization even with unlimited memory\n* [00:23:44] KV cache memory overhead during inference\n* [00:26:08] How optimizer memory usage is calculated\n* [00:32:03] Components of total tra",
                "duration": "PT843H53M20S",
                "requiresSubscription": "no"
            }
        ],
        "aggregateRating": {
            "@type": "AggregateRating",
            "ratingValue": 4.8,
            "reviewCount": 19
        }
    },
    {
        "props": {
            "globalNavData": {
                "locale": "en_US",
                "ariaLabel": "Global",
                "analyticsAttributes": [
                    {
                        "name": "data-analytics-activitymap-region-id",
                        "value": "global nav"
                    },
                    {
                        "name": "data-analytics-region",
                        "value": "global nav"
                    }
                ],
                "links": [
                    {
                        "id": "59b4351546141487025bfcb9d7b90294",
                        "name": "apple",
                        "text": "Apple",
                        "url": "/",
                        "ariaLabel": "Apple",
                        "submenuAriaLabel": "Apple menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 14 44\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m13.0729 17.6825a3.61 3.61 0 0 0 -1.7248 3.0365 3.5132 3.5132 0 0 0 2.1379 3.2223 8.394 8.394 0 0 1 -1.0948 2.2618c-.6816.9812-1.3943 1.9623-2.4787 1.9623s-1.3633-.63-2.613-.63c-1.2187 0-1.6525.6507-2.644.6507s-1.6834-.9089-2.4787-2.0243a9.7842 9.7842 0 0 1 -1.6628-5.2776c0-3.0984 2.014-4.7405 3.9969-4.7405 1.0535 0 1.9314.6919 2.5924.6919.63 0 1.6112-.7333 2.8092-.7333a3.7579 3.7579 0 0 1 3.1604 1.5802zm-3.7284-2.8918a3.5615 3.5615 0 0 0 .8469-2.22 1.5353 1.5353 0 0 0 -.031-.32 3.5686 3.5686 0 0 0 -2.3445 1.2084 3.4629 3.4629 0 0 0 -.8779 2.1585 1.419 1.419 0 0 0 .031.2892 1.19 1.19 0 0 0 .2169.0207 3.0935 3.0935 0 0 0 2.1586-1.1368z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"48\" viewBox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m15.5752 19.0792a4.2055 4.2055 0 0 0 -2.01 3.5376 4.0931 4.0931 0 0 0 2.4908 3.7542 9.7779 9.7779 0 0 1 -1.2755 2.6351c-.7941 1.1431-1.6244 2.2862-2.8878 2.2862s-1.5883-.734-3.0443-.734c-1.42 0-1.9252.7581-3.08.7581s-1.9611-1.0589-2.8876-2.3584a11.3987 11.3987 0 0 1 -1.9373-6.1487c0-3.61 2.3464-5.523 4.6566-5.523 1.2274 0 2.25.8062 3.02.8062.734 0 1.8771-.8543 3.2729-.8543a4.3778 4.3778 0 0 1 3.6822 1.841zm-6.8586-2.0456a1.3865 1.3865 0 0 1 -.2527-.024 1.6557 1.6557 0 0 1 -.0361-.337 4.0341 4.0341 0 0 1 1.0228-2.5148 4.1571 4.1571 0 0 1 2.7314-1.4078 1.7815 1.7815 0 0 1 .0361.373 4.1487 4.1487 0 0 1 -.9867 2.587 3.6039 3.6039 0 0 1 -2.5148 1.3236z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "apple home"
                            }
                        ]
                    },
                    {
                        "id": "874ad6917126f66fc38696e33990e6c1",
                        "name": "store",
                        "text": "Store",
                        "url": "/us/shop/goto/store",
                        "ariaLabel": "Store",
                        "submenuAriaLabel": "Store menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 30 44\" width=\"30\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m26.5679 20.4629c1.002 0 1.67.738 1.693 1.857h-3.48c.076-1.119.779-1.857 1.787-1.857zm2.754 2.672v-.387c0-1.963-1.037-3.176-2.742-3.176-1.735 0-2.848 1.289-2.848 3.276 0 1.998 1.096 3.263 2.848 3.263 1.383 0 2.367-.668 2.66-1.746h-1.008c-.264.557-.814.856-1.629.856-1.072 0-1.769-.791-1.822-2.039v-.047zm-9.547-3.451h.96v.937h.094c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.007c-.082-.023-.445-.058-.644-.058-.961 0-1.659 1.098-1.659 1.535v3.914h-1.007zm-4.27 5.519c-1.195 0-1.869-.867-1.869-2.361 0-1.5.674-2.361 1.869-2.361 1.196 0 1.87.861 1.87 2.361 0 1.494-.674 2.361-1.87 2.361zm0-5.631c-1.798 0-2.912 1.237-2.912 3.27 0 2.027 1.114 3.269 2.912 3.269 1.799 0 2.913-1.242 2.913-3.269 0-2.033-1.114-3.27-2.913-3.27zm-5.478-1.475v1.635h1.407v.843h-1.407v3.575c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.849c-.199.035-.393.059-.592.059-1.301 0-1.822-.481-1.822-1.688v-3.832h-1.02v-.843h1.02v-1.635zm-8.103 5.694c.129.885.973 1.447 2.174 1.447 1.137 0 1.975-.615 1.975-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.53-.386-2.192-1.078-2.192-2.279 0-1.436 1.201-2.408 2.988-2.408 1.635 0 2.854.972 2.942 2.338h-1.061c-.146-.867-.861-1.383-1.916-1.383-1.125 0-1.869.562-1.869 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.439 2.455 1.119 2.455 2.361 0 1.553-1.225 2.543-3.158 2.543-1.793 0-3.03-.949-3.141-2.408z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "store"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - store"
                            }
                        ]
                    },
                    {
                        "id": "b2d6a1c799a7b49f9f5fe230ac699a8f",
                        "name": "mac",
                        "text": "Mac",
                        "url": "/mac/",
                        "ariaLabel": "Mac",
                        "submenuAriaLabel": "Mac menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 23 44\" width=\"23\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m8.1558 25.9987v-6.457h-.0703l-2.666 6.457h-.8907l-2.666-6.457h-.0703v6.457h-.9844v-8.4551h1.2246l2.8945 7.0547h.0938l2.8945-7.0547h1.2246v8.4551zm2.5166-1.7696c0-1.1309.832-1.7812 2.3027-1.8691l1.8223-.1113v-.5742c0-.7793-.4863-1.207-1.4297-1.207-.7559 0-1.2832.2871-1.4238.7852h-1.0195c.1348-1.0137 1.1309-1.6816 2.4785-1.6816 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-.9609v-.9318h-.0938c-.4102.6738-1.1016 1.043-1.9453 1.043-1.2246 0-2.1328-.7266-2.1328-1.8809zm4.125-.5859v-.5801l-1.6992.1113c-.9609.0645-1.3828.3984-1.3828 1.0312 0 .6445.5449 1.0195 1.2773 1.0195 1.0371.0001 1.8047-.6796 1.8047-1.5819zm6.958-2.0273c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "mac"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - mac"
                            }
                        ]
                    },
                    {
                        "id": "6957d8f93e9c0a58b009ef38e424799f",
                        "name": "ipad",
                        "text": "iPad",
                        "url": "/ipad/",
                        "ariaLabel": "iPad",
                        "submenuAriaLabel": "iPad menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 24 44\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m14.9575 23.7002c0 .902-.768 1.582-1.805 1.582-.732 0-1.277-.375-1.277-1.02 0-.632.422-.966 1.383-1.031l1.699-.111zm-1.395-4.072c-1.347 0-2.343.668-2.478 1.681h1.019c.141-.498.668-.785 1.424-.785.944 0 1.43.428 1.43 1.207v.574l-1.822.112c-1.471.088-2.303.738-2.303 1.869 0 1.154.908 1.881 2.133 1.881.844 0 1.535-.369 1.945-1.043h.094v.931h.961v-4.324c0-1.312-.862-2.103-2.403-2.103zm6.769 5.575c-1.155 0-1.846-.885-1.846-2.361 0-1.471.697-2.362 1.846-2.362 1.142 0 1.857.914 1.857 2.362 0 1.459-.709 2.361-1.857 2.361zm1.834-8.027v3.503h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.27 0 1.986 1.037 3.269 2.654 3.269.873 0 1.623-.416 2.022-1.119h.093v1.008h.961v-8.824zm-15.394 4.869h-1.863v-3.563h1.863c1.225 0 1.899.639 1.899 1.799 0 1.119-.697 1.764-1.899 1.764zm.276-4.5h-3.194v8.455h1.055v-3.018h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.611-1.108-2.736-2.707-2.736zm-6.064 8.454h1.008v-6.316h-1.008zm-.199-8.237c0-.387.316-.704.703-.704s.703.317.703.704c0 .386-.316.703-.703.703s-.703-.317-.703-.703z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "ipad"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - ipad"
                            }
                        ]
                    },
                    {
                        "id": "a60c590d864697640299a82eeee56ee8",
                        "name": "iphone",
                        "text": "iPhone",
                        "url": "/iphone/",
                        "ariaLabel": "iPhone",
                        "submenuAriaLabel": "iPhone menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 38 44\" width=\"38\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m32.7129 22.3203h3.48c-.023-1.119-.691-1.857-1.693-1.857-1.008 0-1.711.738-1.787 1.857zm4.459 2.045c-.293 1.078-1.277 1.746-2.66 1.746-1.752 0-2.848-1.266-2.848-3.264 0-1.986 1.113-3.275 2.848-3.275 1.705 0 2.742 1.213 2.742 3.176v.386h-4.541v.047c.053 1.248.75 2.039 1.822 2.039.815 0 1.366-.298 1.629-.855zm-12.282-4.682h.961v.996h.094c.316-.697.932-1.107 1.898-1.107 1.418 0 2.209.838 2.209 2.338v4.09h-1.007v-3.844c0-1.137-.481-1.676-1.489-1.676s-1.658.674-1.658 1.781v3.739h-1.008zm-2.499 3.158c0-1.5-.674-2.361-1.869-2.361-1.196 0-1.87.861-1.87 2.361 0 1.495.674 2.362 1.87 2.362 1.195 0 1.869-.867 1.869-2.362zm-4.782 0c0-2.033 1.114-3.269 2.913-3.269 1.798 0 2.912 1.236 2.912 3.269 0 2.028-1.114 3.27-2.912 3.27-1.799 0-2.913-1.242-2.913-3.27zm-6.636-5.666h1.008v3.504h.093c.317-.697.979-1.107 1.946-1.107 1.336 0 2.179.855 2.179 2.338v4.09h-1.007v-3.844c0-1.119-.504-1.676-1.459-1.676-1.131 0-1.752.715-1.752 1.781v3.739h-1.008zm-6.015 4.87h1.863c1.202 0 1.899-.645 1.899-1.764 0-1.16-.674-1.799-1.899-1.799h-1.863zm2.139-4.5c1.599 0 2.707 1.125 2.707 2.736 0 1.582-1.131 2.701-2.719 2.701h-2.127v3.018h-1.055v-8.455zm-6.114 8.454h1.008v-6.316h-1.008zm-.2-8.238c0-.386.317-.703.703-.703.387 0 .704.317.704.703 0 .387-.317.704-.704.704-.386 0-.703-.317-.703-.704z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "iphone"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - iphone"
                            }
                        ]
                    },
                    {
                        "id": "b1aa21cc187dd822b4d144a89ef6684b",
                        "name": "watch",
                        "text": "Watch",
                        "url": "/watch/",
                        "ariaLabel": "Watch",
                        "submenuAriaLabel": "Watch menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 35 44\" width=\"35\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m28.9819 17.1758h1.008v3.504h.094c.316-.697.978-1.108 1.945-1.108 1.336 0 2.18.856 2.18 2.338v4.09h-1.008v-3.844c0-1.119-.504-1.675-1.459-1.675-1.131 0-1.752.715-1.752 1.781v3.738h-1.008zm-2.42 4.441c-.164-.627-.721-1.136-1.629-1.136-1.137 0-1.852.908-1.852 2.338 0 1.459.727 2.384 1.852 2.384.849 0 1.441-.392 1.629-1.107h1.019c-.182 1.16-1.125 2.016-2.642 2.016-1.77 0-2.901-1.284-2.901-3.293 0-1.969 1.125-3.247 2.895-3.247 1.535 0 2.472.92 2.648 2.045zm-6.533-3.568v1.635h1.407v.844h-1.407v3.574c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.85c-.2.035-.393.058-.592.058-1.301 0-1.822-.48-1.822-1.687v-3.832h-1.02v-.844h1.02v-1.635zm-4.2 5.596v-.58l-1.699.111c-.961.064-1.383.398-1.383 1.031 0 .645.545 1.02 1.277 1.02 1.038 0 1.805-.68 1.805-1.582zm-4.125.586c0-1.131.832-1.782 2.303-1.869l1.822-.112v-.574c0-.779-.486-1.207-1.43-1.207-.755 0-1.283.287-1.423.785h-1.02c.135-1.014 1.131-1.682 2.479-1.682 1.541 0 2.402.792 2.402 2.104v4.324h-.961v-.931h-.094c-.41.673-1.101 1.043-1.945 1.043-1.225 0-2.133-.727-2.133-1.881zm-7.684 1.769h-.996l-2.303-8.455h1.101l1.682 6.873h.07l1.893-6.873h1.066l1.893 6.873h.07l1.682-6.873h1.101l-2.302 8.455h-.996l-1.946-6.674h-.07z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "watch"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - watch"
                            }
                        ]
                    },
                    {
                        "id": "f116d56d9c2e85d7505aef40e343ad39",
                        "name": "airpods",
                        "text": "AirPods",
                        "url": "/airpods/",
                        "ariaLabel": "AirPods",
                        "submenuAriaLabel": "AirPods menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 43 44\" width=\"43\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m11.7153 19.6836h.961v.937h.094c.187-.615.914-1.048 1.752-1.048.164 0 .375.011.504.029v1.008c-.082-.024-.446-.059-.645-.059-.961 0-1.658.645-1.658 1.535v3.914h-1.008zm28.135-.111c1.324 0 2.244.656 2.379 1.693h-.996c-.135-.504-.627-.838-1.389-.838-.75 0-1.336.381-1.336.943 0 .434.352.704 1.096.885l.973.235c1.189.287 1.763.802 1.763 1.711 0 1.13-1.095 1.91-2.531 1.91-1.406 0-2.373-.674-2.484-1.723h1.037c.17.533.674.873 1.482.873.85 0 1.459-.404 1.459-.984 0-.434-.328-.727-1.002-.891l-1.084-.264c-1.183-.287-1.722-.796-1.722-1.71 0-1.049 1.013-1.84 2.355-1.84zm-6.665 5.631c-1.155 0-1.846-.885-1.846-2.362 0-1.471.697-2.361 1.846-2.361 1.142 0 1.857.914 1.857 2.361 0 1.459-.709 2.362-1.857 2.362zm1.834-8.028v3.504h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.269 0 1.987 1.037 3.27 2.654 3.27.873 0 1.623-.416 2.022-1.119h.094v1.007h.961v-8.824zm-9.001 8.028c-1.195 0-1.869-.868-1.869-2.362 0-1.5.674-2.361 1.869-2.361 1.196 0 1.869.861 1.869 2.361 0 1.494-.673 2.362-1.869 2.362zm0-5.631c-1.799 0-2.912 1.236-2.912 3.269 0 2.028 1.113 3.27 2.912 3.27s2.912-1.242 2.912-3.27c0-2.033-1.113-3.269-2.912-3.269zm-17.071 6.427h1.008v-6.316h-1.008zm-.199-8.238c0-.387.317-.703.703-.703.387 0 .703.316.703.703s-.316.703-.703.703c-.386 0-.703-.316-.703-.703zm-6.137 4.922 1.324-3.773h.093l1.325 3.773zm1.892-5.139h-1.043l-3.117 8.455h1.107l.85-2.42h3.363l.85 2.42h1.107zm14.868 4.5h-1.864v-3.562h1.864c1.224 0 1.898.639 1.898 1.799 0 1.119-.697 1.763-1.898 1.763zm.275-4.5h-3.193v8.455h1.054v-3.017h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.612-1.107-2.737-2.707-2.737z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "airpods"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - airpods"
                            }
                        ]
                    },
                    {
                        "id": "09e006337331ac3de699392a70ac2d9d",
                        "name": "tv-home",
                        "text": "TV & Home",
                        "url": "/tv-home/",
                        "ariaLabel": "TV and Home",
                        "submenuAriaLabel": "TV and Home menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 65 44\" width=\"65\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m4.3755 26v-7.5059h-2.7246v-.9492h6.5039v.9492h-2.7246v7.5059zm7.7314 0-3.1172-8.4551h1.1074l2.4844 7.0898h.0938l2.4844-7.0898h1.1074l-3.1172 8.4551zm13.981-.8438c-.7207.6328-1.7109 1.002-2.7363 1.002-1.6816 0-2.8594-.9961-2.8594-2.4141 0-1.002.5449-1.7637 1.6758-2.3613.0762-.0352.2344-.1172.3281-.1641-.7793-.8203-1.0605-1.3652-1.0605-1.9805 0-1.084.9199-1.8926 2.1562-1.8926 1.248 0 2.1562.7969 2.1562 1.9043 0 .8672-.5215 1.5-1.8281 2.1855l2.1152 2.2734c.2637-.5273.3984-1.2188.3984-2.2734v-.1465h.9844v.1523c0 1.3125-.2344 2.2676-.6973 2.9824l1.4708 1.5764h-1.3242zm-4.541-1.4824c0 .9492.7676 1.5938 1.8984 1.5938.7676 0 1.5586-.3047 2.0215-.791l-2.3906-2.6133c-.0645.0234-.2168.0996-.2988.1406-.8145.4219-1.2305 1.0078-1.2305 1.6699zm3.2109-4.3886c0-.6562-.4746-1.1016-1.1602-1.1016-.6738 0-1.1543.457-1.1543 1.1133 0 .4688.2402.8789.9082 1.541 1.0313-.5274 1.4063-.9492 1.4063-1.5527zm13.5176 6.7148v-3.8496h-4.6406v3.8496h-1.0547v-8.4551h1.0547v3.6562h4.6406v-3.6562h1.0547v8.4551zm2.6455-3.1582c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7812 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9961h.0938c.2871-.7031.9199-1.1074 1.7637-1.1074.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0078v-4.1309c0-.9316-.4395-1.3887-1.3301-1.3887-.8789 0-1.4648.6562-1.4648 1.459v4.0606h-1.0078v-4.2891c0-.75-.5215-1.2305-1.3184-1.2305-.8262 0-1.4648.7148-1.4648 1.6055v3.9141h-1.0078v-6.3164zm15.5127 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "tv & home"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - tv & home"
                            }
                        ]
                    },
                    {
                        "id": "0360e437e2a94e504829fb4fb384af83",
                        "name": "entertainment",
                        "text": "Entertainment",
                        "url": "/entertainment/",
                        "ariaLabel": "Entertainment",
                        "submenuAriaLabel": "Entertainment menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 77 44\" width=\"77\" height=\"44\"><path d=\"m0 17.4863h5.2383v.9492h-4.1836v2.7129h3.9668v.9375h-3.9668v2.9062h4.1836v.9492h-5.2383zm6.8994 2.1387h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2803 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4365-1.4942v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0117.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8046 0-2.8945-1.2656-2.8945-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9375h.0938c.2402-.6621.832-1.0488 1.6875-1.0488.1934 0 .4102.0234.5098.041v.9902c-.2109-.0352-.4043-.0586-.627-.0586-.9727 0-1.6641.6152-1.6641 1.541v3.9141h-1.0195zm4.9658 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4658-.1231v-.0117c0-1.125.832-1.7754 2.3027-1.8633l1.8105-.1113v-.5742c0-.7793-.4746-1.2012-1.418-1.2012-.7559 0-1.2539.2812-1.418.7734l-.0059.0176h-1.0195l.0059-.0352c.1641-.9902 1.125-1.6582 2.4727-1.6582 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-1.0195v-.9316h-.0938c-.3984.6738-1.0605 1.043-1.9102 1.043-1.201 0-2.1092-.7265-2.1092-1.875zm2.3203.9903c1.0371 0 1.793-.6797 1.793-1.582v-.5742l-1.6875.1055c-.9609.0586-1.3828.3984-1.3828 1.0254v.0117c0 .6386.5449 1.0136 1.2773 1.0136zm4.3926-7.4649c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1875 1.9219h1.0195v6.3164h-1.0195zm2.8213 0h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm6.8818 0h1.0195v.9609h.0938c.2812-.6797.8789-1.0723 1.7051-1.0723.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0195v-4.1309c0-.9316-.4277-1.3945-1.3184-1.3945-.8789 0-1.459.6621-1.459 1.4648v4.0605h-1.0195v-4.2891c0-.75-.5156-1.2363-1.3125-1.2363-.8262 0-1.4531.7207-1.4531 1.6113v3.9141h-1.0195v-6.3162zm10.0049 3.1816v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0116.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8047 0-2.8946-1.2656-2.8946-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2802 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3008-.0001-1.8458-.4806-1.8458-1.6876z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "entertainment"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - entertainment"
                            }
                        ]
                    },
                    {
                        "id": "a76587c5f8c2e279d64ee231b7186002",
                        "name": "accessories",
                        "text": "Accessories",
                        "url": "/us/shop/goto/buy_accessories",
                        "ariaLabel": "Accessories",
                        "submenuAriaLabel": "Accessories menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 67 44\" width=\"67\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m5.6603 23.5715h-3.3633l-.8496 2.4199h-1.1074l3.1172-8.4551h1.043l3.1172 8.4551h-1.1075zm-3.0527-.8965h2.7422l-1.3242-3.7734h-.0938zm10.0986-1.0664c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm6.5947 0c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm7.5796 2.748c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.212-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm6.0439 0c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm3.6357 3.2695c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7813 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9375h.0938c.1875-.6152.9141-1.0488 1.752-1.0488.1641 0 .375.0117.5039.0293v1.0078c-.082-.0234-.4453-.0586-.6445-.0586-.9609 0-1.6582.6445-1.6582 1.5352v3.9141h-1.0078v-6.3165zm4.2744-1.9219c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1992 1.9219h1.0078v6.3164h-1.0078zm8.001 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.2119-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "accessories"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - accessories"
                            }
                        ]
                    },
                    {
                        "id": "5bb7cbb2a4732f7b30dfbb3b38f204a2",
                        "name": "support",
                        "text": "Support",
                        "url": "https://support.apple.com",
                        "ariaLabel": "Support",
                        "submenuAriaLabel": "Support menu",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 44 44\" width=\"44\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m42.1206 18.0337v1.635h1.406v.844h-1.406v3.574c0 .744.281 1.06.937 1.06.182 0 .282-.006.469-.023v.849c-.199.036-.392.059-.592.059-1.3 0-1.822-.48-1.822-1.687v-3.832h-1.019v-.844h1.019v-1.635zm-6.131 1.635h.961v.937h.093c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.008c-.082-.024-.445-.059-.644-.059-.961 0-1.659.644-1.659 1.535v3.914h-1.007zm-2.463 3.158c0-1.5-.674-2.361-1.869-2.361s-1.869.861-1.869 2.361c0 1.494.674 2.361 1.869 2.361s1.869-.867 1.869-2.361zm-4.781 0c0-2.033 1.113-3.27 2.912-3.27s2.912 1.237 2.912 3.27c0 2.027-1.113 3.27-2.912 3.27s-2.912-1.243-2.912-3.27zm-2.108 0c0-1.477-.692-2.361-1.846-2.361-1.143 0-1.863.908-1.863 2.361 0 1.447.72 2.361 1.857 2.361 1.16 0 1.852-.884 1.852-2.361zm1.043 0c0 1.975-1.049 3.27-2.655 3.27-.902 0-1.629-.393-1.974-1.061h-.094v3.059h-1.008v-8.426h.961v1.054h.094c.404-.726 1.16-1.166 2.021-1.166 1.612 0 2.655 1.284 2.655 3.27zm-8.048 0c0-1.477-.691-2.361-1.845-2.361-1.143 0-1.864.908-1.864 2.361 0 1.447.721 2.361 1.858 2.361 1.16 0 1.851-.884 1.851-2.361zm1.043 0c0 1.975-1.049 3.27-2.654 3.27-.902 0-1.629-.393-1.975-1.061h-.093v3.059h-1.008v-8.426h.961v1.054h.093c.405-.726 1.161-1.166 2.022-1.166 1.611 0 2.654 1.284 2.654 3.27zm-7.645 3.158h-.961v-.99h-.094c-.316.703-.99 1.102-1.957 1.102-1.418 0-2.156-.844-2.156-2.338v-4.09h1.008v3.844c0 1.136.422 1.664 1.43 1.664 1.113 0 1.722-.663 1.722-1.77v-3.738h1.008zm-11.69-2.209c.129.885.972 1.447 2.174 1.447 1.136 0 1.974-.615 1.974-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.529-.386-2.192-1.078-2.192-2.279 0-1.435 1.202-2.408 2.989-2.408 1.634 0 2.853.973 2.941 2.338h-1.06c-.147-.867-.862-1.383-1.916-1.383-1.125 0-1.87.562-1.87 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.44 2.455 1.119 2.455 2.361 0 1.553-1.224 2.543-3.158 2.543-1.793 0-3.029-.949-3.141-2.408z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "support"
                            },
                            {
                                "name": "data-analytics-element-engagement",
                                "value": "hover - support"
                            }
                        ]
                    }
                ],
                "bag": {
                    "analyticsAttributes": [
                        {
                            "name": "data-analytics-region",
                            "value": "bag"
                        }
                    ],
                    "open": {
                        "url": "/us/shop/goto/bag",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"44\" viewBox=\"0 0 14 44\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m11.3535 16.0283h-1.0205a3.4229 3.4229 0 0 0 -3.333-2.9648 3.4229 3.4229 0 0 0 -3.333 2.9648h-1.02a2.1184 2.1184 0 0 0 -2.117 2.1162v7.7155a2.1186 2.1186 0 0 0 2.1162 2.1167h8.707a2.1186 2.1186 0 0 0 2.1168-2.1167v-7.7155a2.1184 2.1184 0 0 0 -2.1165-2.1162zm-4.3535-1.8652a2.3169 2.3169 0 0 1 2.2222 1.8652h-4.4444a2.3169 2.3169 0 0 1 2.2222-1.8652zm5.37 11.6969a1.0182 1.0182 0 0 1 -1.0166 1.0171h-8.7069a1.0182 1.0182 0 0 1 -1.0165-1.0171v-7.7155a1.0178 1.0178 0 0 1 1.0166-1.0166h8.707a1.0178 1.0178 0 0 1 1.0164 1.0166z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"48\" viewBox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m13.4575 16.9268h-1.1353a3.8394 3.8394 0 0 0 -7.6444 0h-1.1353a2.6032 2.6032 0 0 0 -2.6 2.6v8.9232a2.6032 2.6032 0 0 0 2.6 2.6h9.915a2.6032 2.6032 0 0 0 2.6-2.6v-8.9231a2.6032 2.6032 0 0 0 -2.6-2.6001zm-4.9575-2.2768a2.658 2.658 0 0 1 2.6221 2.2764h-5.2442a2.658 2.658 0 0 1 2.6221-2.2764zm6.3574 13.8a1.4014 1.4014 0 0 1 -1.4 1.4h-9.9149a1.4014 1.4014 0 0 1 -1.4-1.4v-8.9231a1.4014 1.4014 0 0 1 1.4-1.4h9.915a1.4014 1.4014 0 0 1 1.4 1.4z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-click",
                                "value": "prop3:open - bag"
                            },
                            {
                                "name": "data-analytics-title",
                                "value": "open - bag"
                            }
                        ],
                        "ariaLabel": "Shopping Bag"
                    },
                    "close": {
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-click",
                                "value": "prop3:close - bag"
                            },
                            {
                                "name": "data-analytics-title",
                                "value": "close - bag"
                            }
                        ],
                        "ariaLabel": "Close"
                    },
                    "badge": {
                        "ariaLabel": "Shopping Bag with item count : {%BAGITEMCOUNT%}"
                    },
                    "storeApiUrl": "/[storefront]/shop/bag/status"
                },
                "search": {
                    "analyticsAttributes": [
                        {
                            "name": "data-analytics-region",
                            "value": "search"
                        }
                    ],
                    "open": {
                        "url": "/us/search",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15px\" height=\"44px\" viewBox=\"0 0 15 44\">\n<path d=\"M14.298,27.202l-3.87-3.87c0.701-0.929,1.122-2.081,1.122-3.332c0-3.06-2.489-5.55-5.55-5.55c-3.06,0-5.55,2.49-5.55,5.55 c0,3.061,2.49,5.55,5.55,5.55c1.251,0,2.403-0.421,3.332-1.122l3.87,3.87c0.151,0.151,0.35,0.228,0.548,0.228 s0.396-0.076,0.548-0.228C14.601,27.995,14.601,27.505,14.298,27.202z M1.55,20c0-2.454,1.997-4.45,4.45-4.45 c2.454,0,4.45,1.997,4.45,4.45S8.454,24.45,6,24.45C3.546,24.45,1.55,22.454,1.55,20z\"/>\n</svg>\n"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"48\" viewBox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m16.2294 29.9556-4.1755-4.0821a6.4711 6.4711 0 1 0 -1.2839 1.2625l4.2005 4.1066a.9.9 0 1 0 1.2588-1.287zm-14.5294-8.0017a5.2455 5.2455 0 1 1 5.2455 5.2527 5.2549 5.2549 0 0 1 -5.2455-5.2527z\"/></svg>"
                            }
                        ],
                        "ariaLabel": "Search apple.com",
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-click",
                                "value": "prop3:open - search field"
                            },
                            {
                                "name": "data-analytics-title",
                                "value": "open - search field"
                            }
                        ]
                    },
                    "close": {
                        "ariaLabel": "Close"
                    },
                    "input": {
                        "placeholderTextRegular": "Search apple.com",
                        "placeholderTextCompact": "Search",
                        "ariaLabel": "Search apple.com"
                    },
                    "submit": {
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"32\" viewBox=\"0 0 30 32\" width=\"30\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m23.3291 23.3066-4.35-4.35c-.0105-.0105-.0247-.0136-.0355-.0235a6.8714 6.8714 0 1 0 -1.5736 1.4969c.0214.0256.03.0575.0542.0815l4.35 4.35a1.1 1.1 0 1 0 1.5557-1.5547zm-15.4507-8.582a5.6031 5.6031 0 1 1 5.603 5.61 5.613 5.613 0 0 1 -5.603-5.61z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg width=\"38\" height=\"40\" viewBox=\"0 0 38 40\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m28.6724 27.8633-5.07-5.07c-.0095-.0095-.0224-.0122-.032-.0213a7.9967 7.9967 0 1 0 -1.8711 1.7625c.0254.03.0357.0681.0642.0967l5.07 5.07a1.3 1.3 0 0 0 1.8389-1.8379zm-18.0035-10.0033a6.5447 6.5447 0 1 1 6.545 6.5449 6.5518 6.5518 0 0 1 -6.545-6.5449z\"/></svg>"
                            }
                        ],
                        "ariaLabel": "Submit search"
                    },
                    "reset": {
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"14\" viewBox=\"0 0 14 14\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m7 .0339a6.9661 6.9661 0 1 0 6.9661 6.9661 6.9661 6.9661 0 0 0 -6.9661-6.9661zm2.798 8.9867a.55.55 0 0 1 -.778.7774l-2.02-2.02-2.02 2.02a.55.55 0 0 1 -.7784-.7774l2.0206-2.0206-2.0204-2.02a.55.55 0 0 1 .7782-.7778l2.02 2.02 2.02-2.02a.55.55 0 0 1 .778.7778l-2.0203 2.02z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"16\" viewBox=\"0 0 16 16\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m0 8a8.0474 8.0474 0 0 1 7.9922-8 8.0609 8.0609 0 0 1 8.0078 8 8.0541 8.0541 0 0 1 -8 8 8.0541 8.0541 0 0 1 -8-8zm5.6549 3.2863 2.3373-2.353 2.3451 2.353a.6935.6935 0 0 0 .4627.1961.6662.6662 0 0 0 .6667-.6667.6777.6777 0 0 0 -.1961-.4706l-2.3451-2.3373 2.3529-2.3607a.5943.5943 0 0 0 .1961-.4549.66.66 0 0 0 -.6667-.6589.6142.6142 0 0 0 -.447.1961l-2.3686 2.3606-2.353-2.3527a.6152.6152 0 0 0 -.447-.1883.6529.6529 0 0 0 -.6667.651.6264.6264 0 0 0 .1961.4549l2.3451 2.3529-2.3451 2.353a.61.61 0 0 0 -.1961.4549.6661.6661 0 0 0 .6667.6667.6589.6589 0 0 0 .4627-.1961z\" /></svg>"
                            }
                        ],
                        "ariaLabel": "Clear search"
                    },
                    "results": {
                        "ariaLabel": "total results"
                    },
                    "defaultLinks": {
                        "title": "Quick Links",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"16\" viewBox=\"0 0 9 16\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m8.6124 8.1035-2.99 2.99a.5.5 0 0 1 -.7071-.7071l2.1366-2.1364h-6.316a.5.5 0 0 1 0-1h6.316l-2.1368-2.1367a.5.5 0 0 1 .7071-.7071l2.99 2.99a.5.5 0 0 1 .0002.7073z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"25\" viewBox=\"0 0 13 25\" width=\"13\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m12.3577 13.4238-4.4444 4.4444a.6.6 0 0 1 -.8486-.8477l3.37-3.37h-9.3231a.65.65 0 0 1 0-1.3008h9.3232l-3.37-3.37a.6.6 0 0 1 .8486-.8477l4.4444 4.4444a.5989.5989 0 0 1 -.0001.8474z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-region",
                                "value": "defaultlinks search"
                            }
                        ]
                    },
                    "defaultLinksApiUrl": "/search-services/suggestions/defaultlinks/",
                    "suggestedLinks": {
                        "title": "Suggested Links",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"16\" viewBox=\"0 0 9 16\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m8.6124 8.1035-2.99 2.99a.5.5 0 0 1 -.7071-.7071l2.1366-2.1364h-6.316a.5.5 0 0 1 0-1h6.316l-2.1368-2.1367a.5.5 0 0 1 .7071-.7071l2.99 2.99a.5.5 0 0 1 .0002.7073z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"25\" viewBox=\"0 0 13 25\" width=\"13\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m12.3577 13.4238-4.4444 4.4444a.6.6 0 0 1 -.8486-.8477l3.37-3.37h-9.3231a.65.65 0 0 1 0-1.3008h9.3232l-3.37-3.37a.6.6 0 0 1 .8486-.8477l4.4444 4.4444a.5989.5989 0 0 1 -.0001.8474z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-title",
                                "value": "suggestions links"
                            }
                        ]
                    },
                    "suggestedSearches": {
                        "title": "Suggested Searches",
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"16\" viewBox=\"0 0 9 16\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m8.6235 11.2266-2.2141-2.2142a3.43 3.43 0 0 0 .7381-2.1124 3.469 3.469 0 1 0 -1.5315 2.8737l2.23 2.23a.55.55 0 0 0 .7773-.7773zm-7.708-4.3266a2.7659 2.7659 0 1 1 2.7657 2.766 2.7694 2.7694 0 0 1 -2.7657-2.766z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"25\" viewBox=\"0 0 13 25\" width=\"13\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m12.3936 17.7969-3.1231-3.1231a4.83 4.83 0 0 0 1.023-2.9541 4.89 4.89 0 1 0 -2.1806 4.059v.0006l3.1484 3.1484a.8.8 0 0 0 1.1319-1.1308zm-10.9536-6.0769a3.9768 3.9768 0 1 1 3.976 3.9773 3.981 3.981 0 0 1 -3.976-3.9773z\"/></svg>"
                            }
                        ],
                        "analyticsAttributes": [
                            {
                                "name": "data-analytics-region",
                                "value": "suggestions search"
                            }
                        ]
                    },
                    "suggestionsApiUrl": "/search-services/suggestions/"
                },
                "segmentbar": {
                    "dataStrings": {
                        "view": "{%STOREFRONT%} Store Home",
                        "exit": "Exit",
                        "segments": {
                            "smb": "Business Store Home",
                            "eduInd": "Education Store Home",
                            "other": "Store Home"
                        }
                    }
                },
                "menu": {
                    "open": {
                        "ariaLabel": "Menu"
                    },
                    "close": {
                        "ariaLabel": "Close"
                    },
                    "back": {
                        "ariaLabel": "Main menu",
                        "images": [
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"48\" viewBox=\"0 0 9 48\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m1.5618 24.0621 6.5581-6.4238c.2368-.2319.2407-.6118.0088-.8486-.2324-.2373-.6123-.2407-.8486-.0088l-7 6.8569c-.1157.1138-.1807.2695-.1802.4316.001.1621.0674.3174.1846.4297l7 6.7241c.1162.1118.2661.1675.4155.1675.1577 0 .3149-.062.4326-.1846.2295-.2388.2222-.6187-.0171-.8481z\"/></svg>"
                            }
                        ]
                    }
                },
                "submenu": {
                    "open": {
                        "images": [
                            {
                                "name": "regular",
                                "assetInline": "<svg height=\"10\" viewBox=\"0 0 10 10\" width=\"10\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m4.6725 6.635-2.655-2.667a.445.445 0 0 1 -.123-.304.4331.4331 0 0 1 .427-.439h.006a.447.447 0 0 1 .316.135l2.357 2.365 2.356-2.365a.458.458 0 0 1 .316-.135.433.433 0 0 1 .433.433v.006a.4189.4189 0 0 1 -.123.3l-2.655 2.671a.4451.4451 0 0 1 -.327.14.464.464 0 0 1 -.328-.14z\"/></svg>"
                            },
                            {
                                "name": "compact",
                                "assetInline": "<svg height=\"48\" viewBox=\"0 0 9 48\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m7.4382 24.0621-6.5581-6.4238c-.2368-.2319-.2407-.6118-.0088-.8486.2324-.2373.6123-.2407.8486-.0088l7 6.8569c.1157.1138.1807.2695.1802.4316-.001.1621-.0674.3174-.1846.4297l-7 6.7242c-.1162.1118-.2661.1675-.4155.1675-.1577 0-.3149-.062-.4326-.1846-.2295-.2388-.2222-.6187.0171-.8481l6.5537-6.2959z\"/></svg>"
                            }
                        ]
                    }
                },
                "textDirection": "ltr",
                "wwwDomain": "www.apple.com",
                "searchUrlPath": "/us/search",
                "storeUrlPath": "/us",
                "hasAbsoluteUrls": true,
                "hasShopRedirectUrls": false,
                "analyticsType": "marcom",
                "storeApiKey": "",
                "submenuApiUrl": "https://www.apple.com/api-www/global-elements/global-header/v1/flyouts"
            }
        }
    },
    {
        "en-us": {
            "WEA.Common.Accessibility.LocalNavClose": "Local Nav Close Menu",
            "WEA.Common.Accessibility.LocalNavOpen": "Local Nav Open Menu",
            "WEA.Common.Authentication.Login": "Sign In",
            "WEA.Common.Authentication.Logout": "Sign Out",
            "WEA.Common.AverageRating": "@@rating@@ out of @@ratingTotal@@",
            "WEA.Common.Close": "Close",
            "WEA.Common.Comma": ", ",
            "WEA.Common.DotSeparator": "@@string1@@ · @@string2@@",
            "WEA.Common.Duration": "Duration",
            "WEA.Common.Ellipsis.Animated": "<span>.</span><span>.</span><span>.</span>",
            "WEA.Common.Errors.404": "The content you’ve requested isn’t currently available.",
            "WEA.Common.Errors.404.Title": "Content Not Available",
            "WEA.Common.FileSize.GB": "@@count@@ GB",
            "WEA.Common.FileSize.GB.AX.one": "1 gigabyte",
            "WEA.Common.FileSize.GB.AX.other": "@@count@@ gigabytes",
            "WEA.Common.FileSize.GB.Unit": "GB",
            "WEA.Common.FileSize.KB": "@@count@@ KB",
            "WEA.Common.FileSize.KB.AX.one": "1 kilobyte",
            "WEA.Common.FileSize.KB.AX.other": "@@count@@ kilobytes",
            "WEA.Common.FileSize.KB.Unit": "KB",
            "WEA.Common.FileSize.MB": "@@count@@ MB",
            "WEA.Common.FileSize.MB.AX.one": "1 megabyte",
            "WEA.Common.FileSize.MB.AX.other": "@@count@@ megabytes",
            "WEA.Common.FileSize.MB.Unit": "MB",
            "WEA.Common.FileSize.byte.Unit": "byte",
            "WEA.Common.FileSize.byte.one": "1 byte",
            "WEA.Common.FileSize.byte.other": "@@count@@ bytes",
            "WEA.Common.Free": "Free",
            "WEA.Common.Get": "GET",
            "WEA.Common.Hours.Unit.Short": "hr",
            "WEA.Common.Hours.abbr.one": "1 hr",
            "WEA.Common.Hours.abbr.other": "@@count@@ hr",
            "WEA.Common.Hours.one": "1 Hour",
            "WEA.Common.Hours.other": "@@count@@ Hours",
            "WEA.Common.Languages.AD": "AD",
            "WEA.Common.Languages.AudioTrack": "AudioTrack",
            "WEA.Common.Languages.CC": "CC",
            "WEA.Common.Languages.Dolby51": "Dolby Digital 5.1",
            "WEA.Common.Languages.Dolby51Plus": "Dolby Digital Plus 5.1",
            "WEA.Common.Languages.Dolby71Plus": "Dolby Digital Plus 7.1",
            "WEA.Common.Languages.DolbyAtmos": "Dolby Atmos",
            "WEA.Common.Languages.SDH": "SDH",
            "WEA.Common.Languages.Subtitled": "Subtitled",
            "WEA.Common.Languages.hasAudioDescription": "AD",
            "WEA.Common.Languages.hasClosedCaptioning": "CC",
            "WEA.Common.Languages.hasDolby": "Dolby 5.1",
            "WEA.Common.Languages.hasDolby71": "Dolby Digital Plus 7.1",
            "WEA.Common.Languages.hasDolbyAtmos": "Dolby Atmos",
            "WEA.Common.Languages.hasSDH": "SDH",
            "WEA.Common.Languages.hasStereo": "Stereo",
            "WEA.Common.Languages.hasSubtitles": "Subtitles",
            "WEA.Common.Languages.languageDescriptor": "@@languageName@@ (@@languageMeta@@)",
            "WEA.Common.LearnMore": "Learn More",
            "WEA.Common.Listen": "Listen",
            "WEA.Common.Loading": "Loading",
            "WEA.Common.Meta.FB.genericDescription.Books": "From mysteries to memoirs, enjoy books and audiobooks on your iPhone, iPad, iPod touch, or Apple Watch. Read free samples of ebooks and listen to free audiobook previews. Get recent bestsellers, all-time favorites, and more on Apple Books—all ready to instantly download.",
            "WEA.Common.Meta.FB.siteName.AM": "Apple Music",
            "WEA.Common.Meta.FB.siteName.AppleTV": "Apple TV",
            "WEA.Common.Meta.FB.siteName.Apps": "App Store",
            "WEA.Common.Meta.FB.siteName.Books": "Apple Books",
            "WEA.Common.Meta.FB.siteName.MacApps": "Mac App Store",
            "WEA.Common.Meta.FB.siteName.Podcasts": "Apple Podcasts",
            "WEA.Common.Meta.FB.siteName.iTunes": "iTunes",
            "WEA.Common.Meta.Twitter.genericDescription.Books": "From mysteries to memoirs, enjoy books and audiobooks on your iPhone, iPad, iPod touch, or Apple Watch. Read free samples of ebooks and listen to free audiobook previews. Get recent bestsellers, all-time favorites, and more on Apple Books—all ready to instantly download.",
            "WEA.Common.Meta.Twitter.site.AM": "@appleMusic",
            "WEA.Common.Meta.Twitter.site.Apps": "@AppStore",
            "WEA.Common.Meta.Twitter.site.Books": "@AppleBooks",
            "WEA.Common.Meta.Twitter.site.iTunes": "@iTunes",
            "WEA.Common.Minutes.Unit.Short": "min",
            "WEA.Common.Minutes.abbr.one": "1 min",
            "WEA.Common.Minutes.abbr.other": "@@count@@ min",
            "WEA.Common.Minutes.one": "1 Minute",
            "WEA.Common.Minutes.other": "@@count@@ Minutes",
            "WEA.Common.More": "more",
            "WEA.Common.NowPlaying": "NOW PLAYING",
            "WEA.Common.Number": "@@count@@",
            "WEA.Common.OG.SiteName.AppleBooks": "Apple Books",
            "WEA.Common.OG.SiteName.TV": "Apple TV",
            "WEA.Common.OG.SiteName.iTunes": "iTunes",
            "WEA.Common.OpensIn.AppleBooks": "Opens In Apple Books",
            "WEA.Common.Paid": "Paid",
            "WEA.Common.Pause": "PAUSE",
            "WEA.Common.Pause.Alternate": "PAUSE",
            "WEA.Common.Percentage": "@@percentage@@%",
            "WEA.Common.Platforms.AppleTv": "Apple TV",
            "WEA.Common.Platforms.Bundles": "Bundles",
            "WEA.Common.Platforms.Mac": "Mac",
            "WEA.Common.Platforms.Watch": "Apple Watch",
            "WEA.Common.Platforms.iMessage": "iMessage",
            "WEA.Common.Platforms.iPad": "iPad",
            "WEA.Common.Platforms.iPadiPhone": "iPad & iPhone",
            "WEA.Common.Platforms.iPhone": "iPhone",
            "WEA.Common.Play": "Play",
            "WEA.Common.Play.Alternate": "PLAY",
            "WEA.Common.Playback.Progress": "Playback Progress",
            "WEA.Common.Playback.Skip.Ahead": "Skip Ahead",
            "WEA.Common.Playback.Skip.Back": "Skip Back",
            "WEA.Common.Preview": "PREVIEW",
            "WEA.Common.Preview.VideoName": "Preview @@videoName@@",
            "WEA.Common.Ratings.one": "1 Rating",
            "WEA.Common.Ratings.other": "@@count@@ Ratings",
            "WEA.Common.Ratings.zero": "No Ratings",
            "WEA.Common.Related": "Related",
            "WEA.Common.Released": "Released: @@releaseDate@@",
            "WEA.Common.Roles.AsCharacter": "as @@characterName@@",
            "WEA.Common.Roles.Type.Actor": "Actor",
            "WEA.Common.Roles.Type.Advisor": "Advisor",
            "WEA.Common.Roles.Type.Cast": "Cast",
            "WEA.Common.Roles.Type.Creator": "Creator",
            "WEA.Common.Roles.Type.Director": "Director",
            "WEA.Common.Roles.Type.Guest": "Guest",
            "WEA.Common.Roles.Type.GuestStar": "Guest Star",
            "WEA.Common.Roles.Type.Host": "Host",
            "WEA.Common.Roles.Type.Music": "Music",
            "WEA.Common.Roles.Type.Performer": "Performer",
            "WEA.Common.Roles.Type.Producer": "Producer",
            "WEA.Common.Roles.Type.Voice": "Voice",
            "WEA.Common.Roles.Type.Writer": "Writer",
            "WEA.Common.Seconds.abbr.one": "1 sec",
            "WEA.Common.Seconds.abbr.other": "@@count@@ sec",
            "WEA.Common.Seconds.one": "1 Second",
            "WEA.Common.Seconds.other": "@@count@@ Seconds",
            "WEA.Common.SeeAll.Button": "See All",
            "WEA.Common.SeeAll.Title.Generic": "@@parentName@@ - @@sectionTitle@@",
            "WEA.Common.SeeAll.Title.Item": "@@itemName@@ - @@productName@@ - @@sectionTitle@@",
            "WEA.Common.SeeAll.Title.Product": "@@artistName@@ — @@sectionTitle@@",
            "WEA.Common.SeeDetails.Button": "See Details",
            "WEA.Common.SentenceDelimiter": ".",
            "WEA.Common.SeparatorDuration": "@@hours@@ @@minutes@@",
            "WEA.Common.SeparatorDuration.Short": "@@string1@@:@@string2@@",
            "WEA.Common.SeparatorGeneric": "@@string1@@, @@string2@@",
            "WEA.Common.Share.CloseMenu.AX": "Close sharing menu",
            "WEA.Common.Share.Embed.AX": "Copy the embed code for the @@contentType@@ @@mediaTitle@@ by @@name@@",
            "WEA.Common.Share.EmbedCopied": "Embed Code Copied",
            "WEA.Common.Share.Link.AX": "Copy a link to the @@contentType@@ @@mediaTitle@@ by @@name@@",
            "WEA.Common.Share.LinkCopied": "Link Copied",
            "WEA.Common.Share.OpenMenu.AX": "Open sharing menu",
            "WEA.Common.Share.Social.AX": "Share the @@contentType@@ @@mediaTitle@@ by @@name@@ on @@network@@",
            "WEA.Common.Shuffle": "Shuffle",
            "WEA.Common.TV.CTA.AM": "Watch on Mac, PC, or Android with Apple Music",
            "WEA.Common.TV.CTA.AX": "Watch on Apple TV",
            "WEA.Common.Time.AvailableIn": "AVAILABLE IN @@minutes@@ MIN",
            "WEA.Common.Time.DayOfTheWeek.Friday": "FRI @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Monday": "MON @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Saturday": "SAT @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Sunday": "SUN @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Thursday": "THU @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Tuesday": "TUE @@time@@",
            "WEA.Common.Time.DayOfTheWeek.Wednesday": "WED @@time@@",
            "WEA.Common.Time.StartsIn": "STARTS IN @@minutes@@ MIN",
            "WEA.Common.Time.Today": "TODAY @@time@@",
            "WEA.Common.Time.Tomorrow": "TOMORROW @@time@@",
            "WEA.Common.Time.Tonight": "TONIGHT @@time@@",
            "WEA.Common.TogglePlay": "Play/Pause",
            "WEA.Common.TrackList.Album": "ALBUM",
            "WEA.Common.TrackList.Artist": "ARTIST",
            "WEA.Common.TrackList.Price": "PRICE",
            "WEA.Common.TrackList.Time": "TIME",
            "WEA.Common.TrackList.TimeRemaining": "Time remaining",
            "WEA.Common.TrackList.Track": "TITLE",
            "WEA.Common.VideoSubType.concert": "CONCERT",
            "WEA.Common.VideoSubType.episode": "EPISODE",
            "WEA.Common.VideoSubType.episodebonus": "EPISODE BONUS",
            "WEA.Common.VideoSubType.feature": "FEATURE",
            "WEA.Common.VideoSubType.seasonbonus": "SEASON BONUS",
            "WEA.Common.VideoSubType.short": "SHORT",
            "WEA.Common.VideoSubType.specialty": "SPECIALTY",
            "WEA.Common.VideoSubType.tvextra": "EXTRA",
            "WEA.Common.VideoSubType.tvinterview": "INTERVIEW",
            "WEA.Common.VideoSubType.tvtrailer": "TRAILER",
            "WEA.Common.View": "VIEW",
            "WEA.Common.Yes": "Yes",
            "WEA.DeepLinkPages.Social.Invite.Description.AM": "Discover music with friends",
            "WEA.DeepLinkPages.Social.Invite.Title.AM": "Start Sharing on Apple Music",
            "WEA.DeepLinkPages.Social.Subscribe.Description.AM": "Play and download all the music you want.",
            "WEA.DeepLinkPages.Social.Subscribe.Title.AM": "Try Apple Music",
            "WEA.Error.Carrier.Install.AM": "To Start listening, install Apple Music on your device",
            "WEA.Error.Carrier.Installed": "Already have the app?",
            "WEA.Error.Carrier.Open.Action": "Get it on @@appname@@",
            "WEA.Error.Generic.AppleMusicLogo.Text": "Apple Music",
            "WEA.Error.Generic.GooglePlay": "Google Play",
            "WEA.Error.Generic.Install.AM": "If this link does not work, you might need to @@installLink@@.",
            "WEA.Error.Generic.Install.AM.Link.Text": "install Apple Music",
            "WEA.Error.Generic.Meta.PageKeywords": "Apple Music",
            "WEA.Error.Generic.Meta.PageKeywords.AppleBooks": "Apple Books",
            "WEA.Error.Generic.Meta.PageKeywords.iTunes": "iTunes Store",
            "WEA.Error.Generic.Meta.PageTitle": "Connecting to Apple Music.",
            "WEA.Error.Generic.Open.AM": "Open in Apple Music",
            "WEA.Error.Generic.Open.Action.AM": "Open in",
            "WEA.Error.Generic.Subtitle": "If you don’t have iTunes, @@downloadLink@@. If you have iTunes and it doesn’t open automatically, try opening it from your dock or Windows task bar.",
            "WEA.Error.Generic.Subtitle.DownloadLink.Text": "download it for free",
            "WEA.Error.Generic.Subtitle.DownloadLink.URL": "http://www.apple.com/itunes/download/",
            "WEA.Error.Generic.Title": "Connecting to Apple Music",
            "WEA.Error.Generic.Title.AppleBooks": "Connecting to Apple Books",
            "WEA.Error.Generic.Title.Apps": "Connecting to App Store",
            "WEA.Error.Generic.Title.Connecting": "Connecting",
            "WEA.Error.Generic.Title.Podcasts": "Connecting to Apple Podcasts",
            "WEA.Error.Generic.Title.iTunes": "Connecting to the iTunes Store.",
            "WEA.Error.NativeMissing.AM.Subtitle": "You need iTunes to use Apple Music",
            "WEA.Error.NativeMissing.Other.AM": "Get Apple Music on iOS, Android, Mac, and Windows",
            "WEA.Error.NativeMissing.Other.LearnMore.link": "https://www.apple.com/itunes/download/",
            "WEA.Error.NativeMissing.Other.iTunes": "Get iTunes on iOS, Android, Mac, and Windows",
            "WEA.Error.NativeMissing.iTunes.Download.link": "https://www.apple.com/itunes/download/",
            "WEA.Error.NativeMissing.iTunes.Download.text": "Download iTunes",
            "WEA.Error.NativeMissing.iTunes.TV.Subtitle": "Download iTunes below to start watching.",
            "WEA.Error.NativeMissing.iTunes.Title": "We could not find iTunes on your computer.",
            "WEA.Error.NotFound.Meta.Title": "This content can’t be found.",
            "WEA.Error.NotFound.general": "The page you're looking for cannot be found.",
            "WEA.GroupingPages.CTA.GoToWebsite": "Go To",
            "WEA.LocalNav.CTA.AppName.TV": "Apple TV app",
            "WEA.LocalNav.CTA.DownloadiTunes": "Download iTunes",
            "WEA.LocalNav.CTA.DownloadiTunes.url": "https://www.apple.com/itunes/download/",
            "WEA.LocalNav.CTA.FreeTrial": "Try It Now",
            "WEA.LocalNav.CTA.FreeTrial.url": "https://itunes.apple.com/subscribe?app=music",
            "WEA.LocalNav.CTA.iTunesStore.TV": "Learn More",
            "WEA.LocalNav.Preview.AM": "Preview",
            "WEA.LocalNav.Preview.AppStore": "Preview",
            "WEA.LocalNav.Preview.Books": "Preview",
            "WEA.LocalNav.Preview.MAS": "Preview",
            "WEA.LocalNav.Preview.Podcasts": "Preview",
            "WEA.LocalNav.Preview.TV": "Preview",
            "WEA.LocalNav.Preview.iBooks": "Preview",
            "WEA.LocalNav.Preview.iTunes": "Preview",
            "WEA.LocalNav.Store.AM": "Apple Music",
            "WEA.LocalNav.Store.AppStore": "App Store",
            "WEA.LocalNav.Store.Books": "Apple Books",
            "WEA.LocalNav.Store.MAS": "Mac App Store",
            "WEA.LocalNav.Store.Podcasts": "Apple Podcasts",
            "WEA.LocalNav.Store.TV": "Apple TV",
            "WEA.LocalNav.Store.iBooks": "Apple Books",
            "WEA.LocalNav.Store.iTunes": "iTunes",
            "WEA.LocalNav.Title.Preview.AM": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.AppStore": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.Books": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.MAS": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.Podcasts": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.TV": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.iBooks": "@@product@@ @@qualifier@@",
            "WEA.LocalNav.Title.Preview.iTunes": "@@product@@ @@qualifier@@",
            "WEA.MusicPages.Riaa.Explicit.AX": "Parental Advisory: Explicit Lyrics.",
            "WEA.PaddleNav.Next.AX": "Next",
            "WEA.PaddleNav.Previous.AX": "Previous",
            "WEA.PodcastChannelPages.CTA.AX": "View on Apple Podcasts",
            "WEA.PodcastChannelPages.CTA.Action": "View on",
            "WEA.PodcastChannelPages.FB.siteName.podcast-channel": "Apple Podcasts",
            "WEA.PodcastChannelPages.Meta.Keywords": "Listen, @@podcastChannelName@@, apple podcasts",
            "WEA.PodcastChannelPages.Meta.Title": "@@podcastChannelName@@ on Apple Podcasts",
            "WEA.PodcastChannelPages.MinimumRequirement": "Requires macOS 11.1 or higher",
            "WEA.PodcastChannelPages.ReleaseFrequency": "@@frequency@@",
            "WEA.PodcastChannelPages.ShowCount.one": "@@count@@ Show",
            "WEA.PodcastChannelPages.ShowCount.other": "@@count@@ Shows",
            "WEA.PodcastChannelPages.SubHeader.Separator": "•",
            "WEA.PodcastChannelPages.SubTitle": "Podcasts Channel",
            "WEA.PodcastEpisodePages.EpisodeNotes": "Episode Notes",
            "WEA.PodcastEpisodePages.FB.siteName.podcast-episode": "Apple Podcasts",
            "WEA.PodcastEpisodePages.Meta.Description": "Show @@podcastShowName@@, Ep @@episodeName@@ - @@publishedDate@@",
            "WEA.PodcastEpisodePages.Meta.Title": "@@podcastShowName@@: @@episodeName@@ on Apple Podcasts",
            "WEA.PodcastEpisodePages.More": "More Episodes",
            "WEA.PodcastEpisodePages.PageKeywords": "Listen, @@episodeName@@, @@podcastShowName@@, download, apple podcasts",
            "WEA.PodcastEpisodePages.Website": "Episode Website",
            "WEA.PodcastPages.CTA.Podcasts.AX": "Listen on Apple Podcasts",
            "WEA.PodcastPages.CTA.Podcasts.Action": "Listen on",
            "WEA.PodcastPages.CTA.Podcasts.App": "Apple Podcasts",
            "WEA.PodcastPages.CTA.Podcasts.Free.MinRequirement": "Requires macOS 11.4 or higher",
            "WEA.PodcastPages.CTA.Podcasts.Subscribe.MinRequirement": "Requires subscription and macOS 11.4 or higher",
            "WEA.PodcastPages.CustomerReviews.Title": "Customer Reviews",
            "WEA.PodcastPages.Episodes.one": "1 episode",
            "WEA.PodcastPages.Episodes.other": "@@count@@ episodes",
            "WEA.PodcastPages.Explicit.AX": "Explicit",
            "WEA.PodcastPages.FB.siteName.show": "Apple Podcasts",
            "WEA.PodcastPages.ListenersAlsoSubscribed": "You Might Also Like",
            "WEA.PodcastPages.Meta.Title": "@@podcastShowName@@ on Apple Podcasts",
            "WEA.PodcastPages.MoreBy": "More by @@podcastArtist@@",
            "WEA.PodcastPages.PageKeywords": "@@podcastShowName@@, @@artistName@@, podcast show, listen, download, apple podcasts",
            "WEA.PodcastPages.Pause.Podcast.AX": "Pause current podcast",
            "WEA.PodcastPages.Play.Podcast.AX": "Play ‘@@podcastName@@’ by @@podcastArtist@@",
            "WEA.PodcastPages.ShowMoreEpisodes.one": "Show 1 More Episode",
            "WEA.PodcastPages.ShowMoreEpisodes.other": "Show @@count@@ More Episodes",
            "WEA.PodcastPages.TopInCategory.Title": "Top Podcasts In @@categoryName@@",
            "WEA.PodcastPages.Twitter.site.show": "@ApplePodcasts",
            "WEA.StarRating.Separator": " • ",
            "WFA.Common.Meta.Twitter.site": "@Apple"
        }
    },
    {
        ".v1.catalog.us.podcasts.1674008350.l.en-us.extend.userrating.2cavailableepisodecount.include.artists.2cchannel.2cepisodes.2cgenres.2clisteners-also-subscribed.2creviews.limit.5bepisodes.5d.6": "{\"x\":1695353274966,\"d\":[{\"id\":\"1674008350\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1674008350?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Latent.Space\",\"availableEpisodeCount\":33,\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The podcast by and for AI Engineers! We are the first place over 50k developers hear news and interviews about Software 3.0 - Foundation Models changing every domain in Code Generation, Computer Vision, AI Agents, and more, directly from the founders, builders, and thinkers involved in pushing the cutting edge. Striving to give you both the definitive take on the Current Thing down to the first introduction to the tech you'll be using in the next 3 months! We break news and exclusive interviews from tiny (George Hotz), Databricks, Glean, Replit, Roboflow, MosaicML, UC Berkeley, OpenAI, and more. \\n\\nwww.latent.space\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"languageTag\":\"en-US\",\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/latent-space-the-ai-engineer-podcast-codegen-agents/id1674008350\",\"userRating\":{\"value\":4.8,\"ratingCount\":19,\"ratingCountList\":[0,1,0,0,18],\"ariaLabelForRatings\":\"4.8 stars\"},\"releaseDateTime\":\"2023-09-20T17:10:00Z\",\"trackCount\":33,\"displayType\":\"free\",\"createdDate\":\"2023-02-23\",\"websiteUrl\":\"https://www.latent.space/podcast\",\"name\":\"Latent Space: The AI Engineer Podcast — CodeGen, Agents, Computer Vision, Data Science, AI UX and all things Software 3.0\",\"artistName\":\"Alessio + swyx\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1674008350\"},\"relationships\":{\"artists\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/artists?l=en-US\",\"data\":[]},\"reviews\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/reviews?l=en-US\",\"data\":[{\"id\":\"10199922253\",\"type\":\"user-reviews\",\"attributes\":{\"date\":\"2023-07-30T15:27:06Z\",\"review\":\"I made my way here via Swyx’s episode on the freeCodeCamp pod. Thank you both so much for putting together a well-researched, thoughtful show. The foundational info in the AI Fundamentals episodes is especially valuable. Keep up the fantastic work!\",\"rating\":5,\"title\":\"An AI Fire Hose for my Thirsty Brain\",\"userName\":\"sydescroll\"}},{\"id\":\"10156230155\",\"type\":\"user-reviews\",\"attributes\":{\"date\":\"2023-07-19T03:40:49Z\",\"review\":\"Incredible podcast for coming up the curve and staying abreast of all the changes happening in the tech world right now. Really impressive lineup of thought leaders in the space. Grateful this exists!\",\"rating\":5,\"userName\":\"AustinHale\",\"title\":\"Fantastic Must-Listen\"}},{\"id\":\"10064345743\",\"type\":\"user-reviews\",\"attributes\":{\"date\":\"2023-06-23T14:48:57Z\",\"review\":\"Insightful look at the latest developments in large language models and other deep learning areas.  Goldilocks level of depth and conciseness.\",\"rating\":5,\"title\":\"Wonderful way to keep up with AI developments\",\"userName\":\"michaelvvv\"}}]},\"listeners-also-subscribed\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/listeners-also-subscribed?l=en-US\",\"next\":\"/v1/catalog/us/podcasts/1674008350/listeners-also-subscribed?l=en-US&offset=15\",\"data\":[{\"id\":\"1669813431\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1669813431?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2023\",\"availableEpisodeCount\":63,\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[1,2],\"description\":{\"standard\":\"A biweekly podcast where hosts Nathan Labenz and Erik Torenberg interview the builders on the edge of AI and explore the dramatic shift it will unlock in the coming years.\\nThe Cognitive Revolution is part of the Turpentine podcast network. To learn more: turpentine.co\"},\"completed\":false,\"languageTag\":\"en-US\",\"artwork\":{\"width\":2000,\"height\":2000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/b3/f2/fd/b3f2fd63-f9fe-1900-1ca6-e0f0b2332537/mza_2904212368704773553.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"000000\",\"textColor1\":\"ffffff\",\"textColor2\":\"f7643b\",\"textColor3\":\"cbcbcb\",\"textColor4\":\"c6502f\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-cognitive-revolution-ai-builders-researchers-and/id1669813431\",\"userRating\":{\"value\":4.5,\"ratingCount\":34,\"ratingCountList\":[4,0,0,0,30],\"ariaLabelForRatings\":\"4.5 stars\"},\"releaseDateTime\":\"2023-09-14T22:56:00Z\",\"trackCount\":63,\"displayType\":\"free\",\"createdDate\":\"2023-02-03\",\"websiteUrl\":\"https://www.cognitiverevolution.ai/\",\"name\":\"\\\"The Cognitive Revolution\\\" | AI Builders, Researchers, and Live Player Analysis\",\"contentRating\":\"clean\",\"artistName\":\"Erik Torenberg, Nathan Labenz\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1669813431\"}},{\"id\":\"1406537385\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1406537385?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":241,\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Education\",\"How To\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Making artificial intelligence practical, productive, and accessible to everyone.  Practical AI is a show in which technology professionals, business people, students, enthusiasts, and expert guests engage in lively discussions about Artificial Intelligence and related topics (Machine Learning, Deep Learning, Neural Networks, GANs, MLOps, AIOps, and more). The focus is on productive implementations and real-world scenarios that are accessible to everyone. If you want to keep up with the latest advances in AI, while keeping one foot in the real world, then this is the show for you!\"},\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts123/v4/45/10/06/4510062f-d99e-abd5-7376-07a4656f19d1/mza_940882021610159734.png/{w}x{h}bb.{f}\",\"bgColor\":\"101820\",\"textColor1\":\"bbbaeb\",\"textColor2\":\"a2a6e5\",\"textColor3\":\"9999c2\",\"textColor4\":\"8589be\"},\"languageTag\":\"en-US\",\"url\":\"https://podcasts.apple.com/us/podcast/practical-ai-machine-learning-data-science/id1406537385\",\"userRating\":{\"value\":4.3,\"ratingCount\":121,\"ratingCountList\":[11,4,7,9,90],\"ariaLabelForRatings\":\"4.3 stars\"},\"releaseDateTime\":\"2023-09-20T16:00:00Z\",\"trackCount\":241,\"displayType\":\"free\",\"createdDate\":\"2018-07-02\",\"websiteUrl\":\"https://changelog.com/practicalai\",\"name\":\"Practical AI: Machine Learning, Data Science\",\"contentRating\":\"clean\",\"artistName\":\"Changelog Media\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1406537385\"}},{\"id\":\"1668002688\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1668002688?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":34,\"copyright\":\"© Copyright 2023 Conviction. All Rights Reserved.\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"At this moment of inflection in technology, co-hosts Elad Gil and Sarah Guo talk to the world's leading AI engineers, researchers and founders about the biggest questions: How far away is AGI? What markets are at risk for disruption? How will commerce, culture, and society change? What’s happening in state-of-the-art in research? “No Priors” is your guide to the AI revolution. Email feedback to show@no-priors.com.\\nSarah Guo is a startup investor and the founder of Conviction, an investment firm purpose-built to serve intelligent software, or \\\"Software 3.0\\\" companies. She spent nearly a decade incubating and investing at venture firm Greylock Partners.\\nElad Gil is a serial entrepreneur and a startup investor. He was co-founder of Color Health, Mixer Labs (which was acquired by Twitter). He has invested in over 40 companies now worth $1B or more each, and is also author of the High Growth Handbook.\"},\"languageTag\":\"en-US\",\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/88/3a/cd/883acd7d-640a-7543-ef6b-be6d27c6caab/mza_2437978473632781223.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"4d35a7\",\"textColor1\":\"f1f1f1\",\"textColor2\":\"a7bbff\",\"textColor3\":\"d1cce2\",\"textColor4\":\"95a1ed\"},\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/no-priors-artificial-intelligence-machine-learning/id1668002688\",\"userRating\":{\"value\":4.8,\"ratingCount\":56,\"ratingCountList\":[3,0,0,0,53],\"ariaLabelForRatings\":\"4.8 stars\"},\"releaseDateTime\":\"2023-09-15T11:34:00Z\",\"trackCount\":34,\"displayType\":\"free\",\"createdDate\":\"2023-01-26\",\"name\":\"No Priors: Artificial Intelligence | Machine Learning | Technology | Startups\",\"contentRating\":\"clean\",\"artistName\":\"Conviction | Pod People\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1668002688\"}},{\"id\":\"1116303051\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1116303051?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© All rights reserved\",\"availableEpisodeCount\":665,\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"Machine learning and artificial intelligence are dramatically changing the way businesses operate and people live. The TWIML AI Podcast brings the top minds and ideas from the world of ML and AI to a broad and influential community of ML/AI researchers, data scientists, engineers and tech-savvy business and IT leaders. Hosted by Sam Charrington, a sought after industry analyst, speaker, commentator and thought leader. Technologies covered include machine learning, artificial intelligence, deep learning, natural language processing, neural networks, analytics, computer science, data science and more.\"},\"completed\":false,\"languageTag\":\"en-US\",\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/0c/c1/26/0cc12665-42ab-fe43-5bf4-26707e3b2fcb/mza_11206870036036003114.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"4a4c5b\",\"textColor1\":\"fffffd\",\"textColor2\":\"d6d5d3\",\"textColor3\":\"dadbdc\",\"textColor4\":\"bababb\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-twiml-ai-podcast-formerly-this-week-in-machine/id1116303051\",\"userRating\":{\"value\":4.7,\"ratingCount\":383,\"ratingCountList\":[12,8,10,19,334],\"ariaLabelForRatings\":\"4.7 stars\"},\"releaseDateTime\":\"2023-09-18T18:17:00Z\",\"trackCount\":665,\"displayType\":\"free\",\"createdDate\":\"2016-05-21\",\"websiteUrl\":\"https://twimlai.com\",\"name\":\"The TWIML AI Podcast (formerly This Week in Machine Learning & Artificial Intelligence)\",\"artistName\":\"Sam Charrington\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1116303051\"}},{\"id\":\"1510472996\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1510472996?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Machine Learning Street Talk (MLST)\",\"availableEpisodeCount\":130,\"genreNames\":[\"Technology\",\"Podcasts\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Biweekly\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"Welcome! The team at MLST is inspired by academic research and each week we engage in dynamic discussion with pre-eminent figures in the AI field. Our flagship show covers current affairs in AI with in-depth analysis. Our approach is unrivalled in terms of scope and rigour – we believe in intellectual diversity in AI, and we touch on all of the main ideas in the field without succumbing to hype. MLST is run by Tim Scarfe, Ph.D (https://www.linkedin.com/in/ecsquizor/)\"},\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts114/v4/b6/e5/8d/b6e58d44-af12-8f37-f913-da24dc01d2e6/mza_11853073755435826963.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"345a78\",\"textColor1\":\"f4fef6\",\"textColor2\":\"f0dabf\",\"textColor3\":\"cedddd\",\"textColor4\":\"cac0b1\"},\"languageTag\":\"en-US\",\"url\":\"https://podcasts.apple.com/us/podcast/machine-learning-street-talk-mlst/id1510472996\",\"userRating\":{\"value\":4.7,\"ratingCount\":58,\"ratingCountList\":[2,2,0,1,53],\"ariaLabelForRatings\":\"4.7 stars\"},\"releaseDateTime\":\"2023-09-05T21:39:00Z\",\"trackCount\":130,\"displayType\":\"free\",\"createdDate\":\"2020-04-28\",\"websiteUrl\":\"https://podcasters.spotify.com/pod/show/machinelearningstreettalk\",\"name\":\"Machine Learning Street Talk (MLST)\",\"contentRating\":\"clean\",\"artistName\":\"Machine Learning Street Talk (MLST)\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1510472996\"}},{\"id\":\"1559275284\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1559275284?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© The Robot Brains Podcast\",\"availableEpisodeCount\":67,\"genreNames\":[\"Technology\",\"Podcasts\",\"Science\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[1,2,3],\"description\":{\"standard\":\"In each episode of The Robot Brains podcast, renowned artificial intelligence researcher, professor and entrepreneur Pieter Abbeel meets the brilliant minds attempting to build robots with brains. Pieter is joined by leading experts in AI Robotics from all over the world as he explores how far humanity has come in its mission to create conscious computers, mindful machines and rational robots. Host: Pieter Abbeel | Executive Producers: Alice Patel & Henry Tobias Jones | Audio Production: Kieron Matthew Banerji | Title Music: Alejandro Del Pozo\\n Hosted on Acast. See acast.com/privacy for more information.\"},\"languageTag\":\"en-US\",\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts114/v4/7a/69/10/7a6910b4-e716-4d7c-7cd1-820a71a9d95a/mza_14389524355238016360.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"e5e5f1\",\"textColor1\":\"2c274c\",\"textColor2\":\"2b2d30\",\"textColor3\":\"514d6d\",\"textColor4\":\"505257\"},\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/the-robot-brains-podcast/id1559275284\",\"userRating\":{\"value\":4.9,\"ratingCount\":152,\"ratingCountList\":[0,2,1,5,144],\"ariaLabelForRatings\":\"4.9 stars\"},\"releaseDateTime\":\"2023-08-11T03:22:00Z\",\"trackCount\":67,\"displayType\":\"free\",\"createdDate\":\"2021-03-19\",\"websiteUrl\":\"https://shows.acast.com/the-robot-brains\",\"name\":\"The Robot Brains Podcast\",\"contentRating\":\"clean\",\"artistName\":\"Pieter Abbeel\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1559275284\"}},{\"id\":\"1438378439\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1438378439?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":100,\"copyright\":\"© Eye On A.I.\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Biweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[1,2,125],\"description\":{\"standard\":\"Eye on A.I. is a biweekly podcast, hosted by longtime New York Times correspondent Craig S. Smith. In each episode, Craig will talk to people making a difference in artificial intelligence. The podcast aims to put incremental advances into a broader context and consider the global implications of the developing technology. AI is about to change your world, so pay attention.\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/e1/b0/89/e1b0891d-d710-9a32-e280-5922b92e08bf/mza_15552391604477952012.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"f5f6fa\",\"textColor1\":\"100e0d\",\"textColor2\":\"100f0e\",\"textColor3\":\"3d3c3c\",\"textColor4\":\"3d3d3d\"},\"languageTag\":\"en-US\",\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/eye-on-a-i/id1438378439\",\"userRating\":{\"value\":4.9,\"ratingCount\":67,\"ratingCountList\":[0,1,0,3,63],\"ariaLabelForRatings\":\"4.9 stars\"},\"releaseDateTime\":\"2023-09-13T13:59:00Z\",\"trackCount\":100,\"displayType\":\"free\",\"createdDate\":\"2018-10-08\",\"websiteUrl\":\"http://www.eye-on.ai\",\"name\":\"Eye On A.I.\",\"contentRating\":\"clean\",\"artistName\":\"Craig S. Smith\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1438378439\"}},{\"id\":\"1516093381\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1516093381?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":52,\"copyright\":\"© Dwarkesh Patel\",\"genreNames\":[\"Society & Culture\",\"Podcasts\",\"Technology\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"I interview the most interesting people and I ask the most interesting questions.\\n\\nYouTube: https://www.youtube.com/DwarkeshPatel\\nApple Podcasts: https://apple.co/3oBack9\\nSpotify: https://spoti.fi/3S5g2YK \\n\\nwww.dwarkeshpatel.com\"},\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/74/83/b9/7483b972-0110-d133-7b6a-782ce1fd64b9/mza_17285164792336460726.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"0a0410\",\"textColor1\":\"ffffff\",\"textColor2\":\"e4edd3\",\"textColor3\":\"cdcccf\",\"textColor4\":\"b8beac\"},\"languageTag\":\"en-US\",\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/dwarkesh-podcast-lunar-society-formerly/id1516093381\",\"userRating\":{\"value\":4.8,\"ratingCount\":69,\"ratingCountList\":[2,0,1,1,65],\"ariaLabelForRatings\":\"4.8 stars\"},\"releaseDateTime\":\"2023-08-08T13:40:00Z\",\"trackCount\":52,\"displayType\":\"free\",\"createdDate\":\"2020-05-30\",\"websiteUrl\":\"https://www.dwarkeshpatel.com/podcast\",\"name\":\"Dwarkesh Podcast (Lunar Society formerly)\",\"contentRating\":\"clean\",\"artistName\":\"Dwarkesh Patel\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1516093381\"}},{\"id\":\"1502782720\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1502782720?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Copyright 2023 All rights reserved.\",\"availableEpisodeCount\":175,\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Weekly summaries and discussion about the most interesting developments in AI, deep learning, robotics, and more!\"},\"completed\":false,\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts125/v4/fd/1e/1a/fd1e1aa2-04a5-6d38-5471-6eace0280034/mza_17718899928391029841.png/{w}x{h}bb.{f}\",\"bgColor\":\"ffffff\",\"textColor1\":\"121212\",\"textColor2\":\"303030\",\"textColor3\":\"424242\",\"textColor4\":\"595959\"},\"languageTag\":\"en-US\",\"url\":\"https://podcasts.apple.com/us/podcast/last-week-in-ai/id1502782720\",\"userRating\":{\"value\":4.6,\"ratingCount\":110,\"ratingCountList\":[6,2,5,2,95],\"ariaLabelForRatings\":\"4.6 stars\"},\"releaseDateTime\":\"2023-09-20T11:30:00Z\",\"trackCount\":175,\"displayType\":\"free\",\"createdDate\":\"2020-03-13\",\"websiteUrl\":\"https://www.lastweekinai.com/\",\"name\":\"Last Week in AI\",\"contentRating\":\"clean\",\"artistName\":\"Skynet Today\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1502782720\"}},{\"id\":\"1186480811\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1186480811?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":202,\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Biweekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"One person, one interview, one story. Join us as we explore the impact of AI on our world, one amazing person at a time -- from the wildlife biologist tracking endangered rhinos across the savannah here on Earth to astrophysicists analyzing 10 billion-year-old starlight in distant galaxies to the Walmart data scientist grappling with the hundreds of millions of parameters lurking in the retailer’s supply chain. Every two weeks, we’ll bring you another tale, another 25-minute interview, as we build a real-time oral history of AI that’s already garnered nearly 3.4 million listens and been acclaimed as one of the best AI and machine learning podcasts. Listen in and get inspired.\\n\\nhttps://blogs.nvidia.com/ai-podcast/\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts111/v4/6f/17/54/6f1754cc-1c4f-19f0-7e17-04691868f3cd/mza_443508407175626775.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"000000\",\"textColor1\":\"fffcfb\",\"textColor2\":\"c7cac9\",\"textColor3\":\"cbc9c8\",\"textColor4\":\"9fa2a1\"},\"completed\":false,\"languageTag\":\"en-US\",\"url\":\"https://podcasts.apple.com/us/podcast/the-ai-podcast/id1186480811\",\"userRating\":{\"value\":4.5,\"ratingCount\":235,\"ratingCountList\":[11,9,7,31,177],\"ariaLabelForRatings\":\"4.5 stars\"},\"releaseDateTime\":\"2023-09-11T00:00:00Z\",\"trackCount\":202,\"displayType\":\"free\",\"createdDate\":\"2016-12-14\",\"websiteUrl\":\"https://blogs.nvidia.com/ai-podcast/\",\"name\":\"The AI Podcast\",\"contentRating\":\"clean\",\"artistName\":\"NVIDIA\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1186480811\"}},{\"id\":\"1680633614\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1680633614?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2023\",\"availableEpisodeCount\":161,\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\"],\"releaseFrequency\":\"Updated Semiweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"A daily news analysis show on all things artificial intelligence. NLW looks at AI from multiple angles, from the explosion of creativity brought on by new tools like Midjourney, ChatGPT and AutoGPT to the potential disruptions to work and industries as we know them to the great philosophical, ethical and practical questions of advanced general intelligence, alignment and x-risk.\"},\"languageTag\":\"en-US\",\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/98/48/1b/98481b01-a65c-0acd-882c-8092b8fdc978/mza_4121882920174444772.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"250d13\",\"textColor1\":\"ffffff\",\"textColor2\":\"d6b185\",\"textColor3\":\"d3cecf\",\"textColor4\":\"b3906e\"},\"completed\":false,\"url\":\"https://podcasts.apple.com/us/podcast/the-ai-breakdown-daily-artificial-intelligence-news/id1680633614\",\"userRating\":{\"value\":4.9,\"ratingCount\":194,\"ratingCountList\":[1,1,1,3,188],\"ariaLabelForRatings\":\"4.9 stars\"},\"releaseDateTime\":\"2023-09-21T18:08:00Z\",\"trackCount\":161,\"displayType\":\"free\",\"createdDate\":\"2023-04-04\",\"websiteUrl\":\"https://sites.libsyn.com/468519\",\"name\":\"The AI Breakdown: Daily Artificial Intelligence News and Discussions\",\"contentRating\":\"clean\",\"artistName\":\"Nathaniel Whittemore\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1680633614\"}},{\"id\":\"1671087656\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1671087656?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":33,\"copyright\":\"© 2023 Michael Sharkey, Chris Sharkey\",\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"This Day in AI Podcast is a podcast all about AI. It's an hour-long conversation on the influence and rise of AI in technology and society. Hosted by Michael and Chris Sharkey.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/3d/9e/0f/3d9e0f65-7caf-1854-0bd3-0d91339adc34/mza_5603682287013027978.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"b00000\",\"textColor1\":\"ffffff\",\"textColor2\":\"ebfffd\",\"textColor3\":\"efcbcb\",\"textColor4\":\"dfcbca\"},\"url\":\"https://podcasts.apple.com/us/podcast/this-day-in-ai-podcast/id1671087656\",\"userRating\":{\"value\":4.8,\"ratingCount\":82,\"ratingCountList\":[3,1,1,2,75],\"ariaLabelForRatings\":\"4.8 stars\"},\"releaseDateTime\":\"2023-09-22T02:25:00Z\",\"trackCount\":33,\"displayType\":\"free\",\"createdDate\":\"2023-02-10\",\"websiteUrl\":\"https://www.thisdayinai.com\",\"name\":\"This Day in AI Podcast\",\"artistName\":\"Michael Sharkey, Chris Sharkey\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1671087656\"}},{\"id\":\"842818711\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/842818711?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":250,\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Biweekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The a16z Podcast discusses tech and culture trends, news, and the future – especially as ‘software eats the world’. It features industry experts, business leaders, and other interesting thinkers and voices from around the world. This podcast is produced by Andreessen Horowitz (aka “a16z”), a Silicon Valley-based venture capital firm. Multiple episodes are released every week; visit a16z.com for more details and to sign up for our newsletters and other content as well!\"},\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/4c/0b/f2/4c0bf2f6-8d27-767f-f7ec-c33202c1638c/mza_17705033532805449089.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"fc8600\",\"textColor1\":\"0a0400\",\"textColor2\":\"080605\",\"textColor3\":\"3a1e00\",\"textColor4\":\"392004\"},\"languageTag\":\"en-US\",\"url\":\"https://podcasts.apple.com/us/podcast/a16z-podcast/id842818711\",\"userRating\":{\"value\":4.4,\"ratingCount\":815,\"ratingCountList\":[45,31,57,115,567],\"ariaLabelForRatings\":\"4.4 stars\"},\"releaseDateTime\":\"2023-09-19T22:13:00Z\",\"trackCount\":250,\"displayType\":\"free\",\"createdDate\":\"2014-03-17\",\"websiteUrl\":\"https://a16z.simplecast.com\",\"name\":\"a16z Podcast\",\"contentRating\":\"clean\",\"artistName\":\"Andreessen Horowitz\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=842818711\"}},{\"id\":\"1163599059\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1163599059?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":500,\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Semiweekly\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The latest machine learning, A.I., and data career topics from across both academia and industry are brought to you by host Dr. Jon Krohn on the Super Data Science Podcast.\\n\\nAs the quantity of data on our planet doubles every couple of years and with this trend set to continue for decades to come, there's an unprecedented opportunity for you to make a meaningful impact in your lifetime. In conversation with the biggest names in the data science industry, Jon cuts through hype to fuel that professional impact.\\n\\nWhether you're curious about getting started in a data career or you're a deep technical expert, whether you'd like to understand what A.I. is or you'd like to integrate more data-driven processes into your business, we have inspiring guests and lighthearted conversation for you to enjoy.\\n\\nWe cover tools, techniques, and implementation tricks across data collection, databases, analytics, predictive modeling, visualization, software engineering, real-world applications, commercialization, and entrepreneurship − everything you need to crush it with data science.\"},\"completed\":false,\"languageTag\":\"en-US\",\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts124/v4/f2/82/cf/f282cf28-c818-c7a9-7be2-1548239ba1c5/mza_15166093520969783720.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"e3e1e2\",\"textColor1\":\"120f12\",\"textColor2\":\"132a42\",\"textColor3\":\"3c393c\",\"textColor4\":\"3c4e62\"},\"url\":\"https://podcasts.apple.com/us/podcast/super-data-science-ml-ai-podcast-with-jon-krohn/id1163599059\",\"userRating\":{\"value\":4.6,\"ratingCount\":242,\"ratingCountList\":[8,9,12,15,198],\"ariaLabelForRatings\":\"4.6 stars\"},\"releaseDateTime\":\"2023-09-19T11:00:00Z\",\"trackCount\":510,\"displayType\":\"free\",\"createdDate\":\"2016-10-09\",\"websiteUrl\":\"https://www.superdatascience.com/podcast\",\"name\":\"Super Data Science: ML & AI Podcast with Jon Krohn\",\"artistName\":\"Jon Krohn\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1163599059\"}},{\"id\":\"1678893467\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1678893467?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"availableEpisodeCount\":28,\"copyright\":\"© 399838\",\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"kind\":\"episodic\",\"releaseFrequency\":\"Updated Weekly\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"Upstream is where host Erik Torenberg goes deeper with the world's most interesting thinkers to map the constellation of ideas that matter across tech, culture, and politics. On this season of Upstream, you'll hear from Marc Andreessen, David Sacks, Balaji Srinivasan, Ezra Klein, Joe Lonsdale, Katherine Boyle, and more.\\nUpstream is part of the Turpentine podcast network. To learn more: turpentine.co\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":2000,\"height\":2000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/cd/d1/aa/cdd1aa05-591e-a09f-6a53-10c103628d9f/mza_3181010742270501911.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"625b4a\",\"textColor1\":\"ffffff\",\"textColor2\":\"fff751\",\"textColor3\":\"dfdeda\",\"textColor4\":\"dfd850\"},\"url\":\"https://podcasts.apple.com/us/podcast/upstream-with-erik-torenberg/id1678893467\",\"userRating\":{\"value\":4.6,\"ratingCount\":30,\"ratingCountList\":[3,0,0,0,27],\"ariaLabelForRatings\":\"4.6 stars\"},\"releaseDateTime\":\"2023-09-08T14:12:00Z\",\"trackCount\":28,\"displayType\":\"free\",\"createdDate\":\"2023-03-24\",\"websiteUrl\":\"https://www.podpage.com/upstream-with-erik-torenberg/about/\",\"name\":\"\\\"Upstream\\\" with Erik Torenberg\",\"artistName\":\"Erik Torenberg\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1678893467\"}}],\"meta\":{\"metrics\":{\"reco_shelfCategoryId\":\"mapi.category.podcasts_cab\",\"reco_displayType\":\"CAB\",\"reco_eligible\":\"1\",\"reco_algoId\":\"V1\"}}},\"episodes\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/episodes?l=en-US\",\"next\":\"/v1/catalog/us/podcasts/1674008350/episodes?l=en-US&offset=6\",\"data\":[{\"id\":\"1000628601852\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000628601852?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Latent.Space\",\"contentAdvisory\":\"\",\"genreNames\":[\"Technology\"],\"artworkOrigin\":\"podcast\",\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"Want to help define the AI Engineer stack? Have opinions on the top tools, communities and builders? We’re collaborating with friends at Amplify to launch the first State of AI Engineering survey! Please fill it out (and tell your friends)!\\nIn March, we started off our GPT4 coverage framing one of this year’s key forks in the road as the “Year of Multimodal vs Multimodel AI”. 6 months in, neither has panned out yet. The vast majority of LLM usage still defaults to chatbots built atop OpenAI (per our LangSmith discussion), and rumored GPU shortages have prevented the broader rollout of GPT-4 Vision. Most \\\"AI media” demos like AI Drake and AI South Park turned out heavily human engineered, to the point where the AI label is more marketing than honest reflection of value contributed.\\nHowever, the biggest impact of multimodal AI in our lives this year has been a relatively simple product - the daily HN Recap podcast produced by Wondercraft.ai, a 5 month old AI podcasting startup. As swyx observed, the “content flippening” — an event horizon when the majority of content you choose to consume is primarily AI generated/augmented rather than primarily human/manually produced — has now gone from unthinkable to possible.\\nFor full show notes, go to: https://latent.space/p/wondercraft\\nTimestamps\\n* [00:03:15] What is Wondercraft?\\n* [00:08:22] Features of Wondercraft\\n* [00:10:42] Types of Podcasts\\n* [00:11:44] The Importance of Consistency\\n* [00:14:01] Wondercraft House Podcasts\\n* [00:19:27] Video Translation and Dubbing\\n* [00:21:49] Building Wondercraft in 1 Day\\n* [00:24:25] What is your moat?\\n* [00:30:37] Audio Generation stack\\n* [00:32:12] How Important is it to Sound Human? and AI Uncanny Valley\\n* [00:36:02] AI Watermarking\\n* [00:36:32] The Text to Speech Industry\\n* [00:41:19] Voice Synthesis Research\\n* [00:45:53] AI Podcaster interviews Human Podcaster\\n* [00:50:38] Takeaway\\n \\n\\nGet full access to Latent Space at www.latent.space/subscribe\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/heralds-of-the-ai-content-flippening-with/id1674008350?i=1000628601852\",\"releaseDateTime\":\"2023-09-20T17:10:26Z\",\"websiteUrl\":\"https://www.latent.space/p/wondercraft\",\"durationInMilliseconds\":3157000,\"name\":\"Heralds of the AI Content Flippening — with Youssef Rizk of Wondercraft.ai\",\"guid\":\"substack:post:137135173\",\"contentRating\":\"clean\",\"artistName\":\"Youssef Rizk\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/137135173/7f2c9b8769129fe1d93715a9da9f73d2.mp3\"}},{\"id\":\"1000627892498\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000627892498?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Latent.Space\",\"contentAdvisory\":\"\",\"artworkOrigin\":\"podcast\",\"genreNames\":[\"Technology\"],\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"Want to help define the AI Engineer stack? Have opinions on the top tools, communities and builders? We’re collaborating with friends at Amplify to launch the first State of AI Engineering survey! Please fill it out (and tell your friends)!\\nIf AI is so important, why is its software so bad?\\nThis was the motivating question for Chris Lattner as he reconnected with his product counterpart on Tensorflow, Tim Davis, and started working on a modular solution to the problem of sprawling, monolithic, fragmented platforms in AI development. They announced a $30m seed in 2022 and, following their successful double launch of Modular/Mojo🔥 in May, have just announced their $100m Series A.\\nWhile the performance claims of Mojo🔥 and its promise as a fully multithreaded compiled Python superset stole the show, we were amazed to learn that it is a side project - and the vision for Modular’s Python inference engine is at least as big.\\nListeners will recall that we last talked with George Hotz about his work on tinygrad and how he wants to replace PyTorch with something faster and lighter, handwriting a “reduced instruction set” of operators himself. But what if the problem could be solved at even lower level - with the Python engine/runtime itself?\\n\\nChris on Compilers\\nChris’ history with compilers is well known - creating LLVM during his PhD (for which he won the 2012 ACM Software System Award), hired straight into Apple where he also made Clang and Swift (the iPhone programming language that replaced Objective-C), then leading the Tensorflow Infrastructure team at Google where he built XLA, a just-in-time compiler for optimizing a lot of the algebra behind TF’s workloads, and MLIR, a modular compiler framework that sat above LLVM to optimize ML graphs and kernels that were hard to represent in the LLVM IR.  \\nSo as pretty much the best compiler engineer in human history, you’d justifiably assume that Chris is simply choosing to take his compiler approach to Python. And yet that is not how he thinks about compilers at all. \\nAs he says in our chat,\\n“How do you enable invention? How do you get more kinds of people that understand different parts of this problem to actually collaborate? And so this is where I see our work on Mojo and on the engine…\\n…I don't have a compiler hammer that I'm running around looking for compiler problems to hit.”\\nToday a small number of people at companies like OpenAI spend a lot of time manually writing CUDA kernels. But an optimizing compiler for AI leads to compilers as a means to an end for increasing software collaboration, expanding the ability of people with different skillsets and knowledge.\\n“…What is the fundamental purpose of a compiler? Well, it's to make it so that you don't have to know as much about the hardware. You could write everything in very low-level assembly code for every single problem that you have… But what a compiler really does is it allows you to express things at a higher level of abstraction.”\\nFor Chris, compilers are also ways to properly automate generalized optimizations that might otherwise be manually coded and brittle abstractions, like operator fusion:\\n“So NVIDIA goes and they build this really cool library called FasterTransformer. The performance point of using it is massive. So a lot of LLM companies and other folks use this thing because they want the performance.\\n…Here's the problem. If you want to go innovate in transformers, now you're constrained by what FasterTransformer can do, right? \\nAnd so, again, you come back to where are compilers useful?\\nThey're useful for generalization. If you can get the same quality result or better than FasterTransformer, but with a generalized architecture, well now you can get the best of both worlds, where you have orthogonality and composability, you enable research, you also get better performance.”\\nDone correctly, these operator optimizations being implemented at the compiler level amount\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/doing-it-the-hard-way-making-the-ai-engine/id1674008350?i=1000627892498\",\"releaseDateTime\":\"2023-09-14T16:12:13Z\",\"websiteUrl\":\"https://www.latent.space/p/modular\",\"durationInMilliseconds\":5362000,\"name\":\"Doing it the Hard Way: Making the AI engine and language 🔥 of the future — with Chris Lattner of Modular\",\"guid\":\"substack:post:136992893\",\"contentRating\":\"clean\",\"artistName\":\"Alessio + swyx\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/136992893/0a9c32bc88c77dac5d97cd679b2e6b6e.mp3\"}},{\"id\":\"1000626970628\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000626970628?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Latent.Space\",\"contentAdvisory\":\"\",\"artworkOrigin\":\"podcast\",\"genreNames\":[\"Technology\"],\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"As alluded to on the pod, LangChain has just launched LangChain Hub: “the go-to place for developers to discover new use cases and polished prompts.” It’s available to everyone with a LangSmith account, no invite code necessary. Check it out!\\nIn 2023, LangChain has speedrun the race from 2:00 to 4:00 to 7:00 Silicon Valley Time. From the back to back $10m Benchmark seed and (rumored) $20-25m Sequoia Series A in April, to back to back critiques of “LangChain is Pointless” and “The Problem with LangChain” in July, to teaching with Andrew Ng and keynoting at basically every AI conference this fall (including ours), it has been an extreme rollercoaster for Harrison and his growing team creating one of the most popular (>60k stars at time of writing) building blocks for AI Engineers.\\n\\nLangChain’s Origins\\nThe first commit to LangChain shows its humble origins as a light wrapper around Python’s formatter.format for prompt templating. But as Harrison tells the story, even his first experience with text-davinci-002 in early 2022 was focused on chatting with data from their internal company Notion and Slack, what is now known as Retrieval Augmented Generation (RAG). \\nAs the Generative AI meetup scene came to life post Stable Diffusion, Harrison saw a need for common abstractions for what people were building with text LLMs at the time:\\n* LLM Math, aka Riley Goodside’s “You Can’t Do Math” REPL-in-the-loop (PR #8)\\n* Self-Ask With Search, Ofir Press’ agent pattern (PR #9) (later ReAct, PR #24)\\n* NatBot, Nat Friedman’s browser controlling agent (PR #18)\\n* Adapters for OpenAI, Cohere, and HuggingFaceHub\\nAll this was built and launched in a few days from Oct 16-25, 2022. \\nTurning research ideas/exciting usecases into software quickly and often has been in the LangChain DNA from Day 1 and likely a big driver of LangChain’s success, to date amassing the largest community of AI Engineers and being the default launch framework for every big name from Nvidia to OpenAI:\\n\\nDancing with Giants\\nBut AI Engineering is built atop of constantly moving tectonic shifts: \\n* ChatGPT launched in November (“The Day the AGI Was Born”) and the API released in March. Before the ChatGPT API, OpenAI did not have a chat endpoint. In order to build a chatbot with history, you had to make sure to chain all messages and prompt for completion. LangChain made it easy to do that out of the box, which was a huge driver of usage. \\n* Today, OpenAI has gone all-in on the chat API and is deprecating the old completions models, essentially baking in the chat pattern as the default way most engineers should interact with LLMs… and reducing (but not eliminating) the value of ConversationChains.\\n* And there have been more updates since: Plugins released in API form as Functions in June (one of our top pods ever… reducing but not eliminating the value of OutputParsers) and Finetuning in August (arguably reducing some need for Retrieval and Prompt tooling). \\nWith each update, OpenAI and other frontier model labs realign the roadmaps of this nascent industry, and Harrison credits the modular design of LangChain in staying relevant. LangChain has not been merely responsive either: LangChain added Agents in November, well before they became the hottest topic of the AI Summer, and now Agents feature as one of LangChain’s top two usecases. \\nLangChain’s problem for podcasters and newcomers alike is its sheer scope - it is the world’s most complete AI framework, but it also has a sprawling surface area that is difficult to fully grasp or document in one sitting. This means it’s time for the trademark Latent Space move (ChatGPT, GPT4, Auto-GPT, and Code Interpreter Advanced Data Analysis GPT4.5): the executive summary!\\n\\nWhat is LangChain?\\nAs Harrison explains, LangChain is an open source framework for building context-aware reasoning applications, available in Python and JS/TS.\\nIt launched in Oct 2022 with the central value proposition of “\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-point-of-langchain-with-harrison-chase-of-langchain/id1674008350?i=1000626970628\",\"releaseDateTime\":\"2023-09-06T14:59:00Z\",\"websiteUrl\":\"https://www.latent.space/p/langchain\",\"durationInMilliseconds\":3650000,\"name\":\"The Point of LangChain — with Harrison Chase of LangChain\",\"guid\":\"substack:post:136578557\",\"contentRating\":\"clean\",\"artistName\":\"Harrison Chase\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/136578557/50242c665a016dcc850f0f26b7cc1442.mp3\"}},{\"id\":\"1000626225028\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000626225028?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Latent.Space\",\"contentAdvisory\":\"\",\"artworkOrigin\":\"podcast\",\"genreNames\":[\"Technology\"],\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"The AI Engineer Summit Expo has been announced, presented by AutoGPT (and future guest Toran Bruce-Richards!) Stay tuned for more updates on the Summit livestream and Latent Space University.\\nThis post was on HN for 10 hours.\\nWhat comes after the Transformer? This is one of the Top 10 Open Challenges in LLM Research that has been the talk of the AI community this month. Jon Frankle (friend of the show!) has an ongoing bet with Sasha Rush on whether Attention is All You Need, and the most significant challenger to emerge this year has been RWKV - Receptance Weighted Key Value models, which revive the RNN for GPT-class LLMs, inspired by a 2021 paper on Attention Free Transformers from Apple (surprise!).\\nWhat this means practically is that RWKV models tend to scale in all directions (both in training and inference) much better than Transformers-based open source models:\\nWhile remaining competitive on standard reasoning benchmarks:\\nswyx was recently in Singapore for meetings with AI government and industry folks, and grabbed 2 hours with RWKV committee member Eugene Cheah for a deep dive, the full recording of which is now up on Latent Space TV:\\nToday we release both the 2hr video and an edited 1hr audio version, to cater to the different audiences and provide “ablation opportunities” on RWKV interest level.\\n\\nThe Eleuther Mafia?\\nThe RWKV project is notable not merely because of the credible challenge to the Transformers dominance. It is also a distributed, international, mostly uncredentialed community reminiscent of early 2020s Eleuther AI:\\n* Primarily Discord, pseudonymous, GPU-poor volunteer community somehow coordinating enough to train >10B, OPT/BLOOM-competitive models\\n* Being driven by the needs of its community, it is extremely polyglot (e.g. English, Chinese, Japanese, Arabic) not because it needs to beat some benchmarks, but because its users want it to be for their own needs.\\n* “Open Source” in both the good and the bad way - properly Apache 2.0 licensed (not “open but restricted”), yet trained on data taken from commercially compromised sources like the Pile (where Shawn Presser’s Books3 dataset has been recently taken down) and Alpaca (taking from Steven Tey’s ShareGPT which is technically against OpenAI TOS)\\nThe threadboi class has loved tracking the diffusion of Transformers paper authors out into the industry:\\nBut perhaps the underdog version of this is tracking the emerging Eleuther AI mafia:\\nIt will be fascinating to see how both Eleuther and Eleuther alums fare as they build out the future of both LLMs and open source AI.\\n\\nAudio Version Timestamps\\nassisted by smol-podcaster. Different timestamps vs the 2hr YouTube\\n* [00:05:35] Eugene's path into AI at UIlicious\\n* [00:07:33] Tokenizer penalty and data efficiency of Transformers\\n* [00:08:02] Using Salesforce CodeGen\\n* [00:10:17] The limitations of Transformers for handling large context sizes\\n* [00:13:17] RWKV compute costs compared to Transformers\\n* [00:16:06] How Eugene found RWKV early\\n* [00:18:52] RWKV's focus on supporting many languages, not just English\\n* [00:21:24] Using the RWKV model for fine-tuning for specific languages\\n* [00:24:45] What is RWKV?\\n* [00:33:46] Overview of the different RWKV models like World, Raven, Novel\\n* [00:41:34] Background of Blink, the creator of RWKV\\n* [00:49:55] The linear vs quadratic scaling of RWKV vs Transformers\\n* [00:53:29] RWKV matching Transformer performance on reasoning tasks\\n* [00:54:31] The community's lack of marketing for RWKV\\n* [00:57:00] The English-language bias in AI models\\n* [01:00:33] Plans to improve RWKV's memory and context handling\\n* [01:03:10] Advice for AI engineers wanting to get more technical knowledge\\n\\nShow Notes\\nCompanies/Organizations:\\n* RWKV - HF blog, paper, docs, GitHub, Huggingface\\n* Raven 14B (finetuned on Alpaca+ShareGPT+...) Demo\\n* World 7B (supports 100+ world languages) Demo\\n* How RWKV works in 100 LOC, RWKV overview\\n* EleutherAI - Decentralized open source AI research\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/rwkv-reinventing-rnns-for-the-transformer-era-with/id1674008350?i=1000626225028\",\"releaseDateTime\":\"2023-08-30T16:04:19Z\",\"websiteUrl\":\"https://www.latent.space/p/rwkv\",\"durationInMilliseconds\":4331000,\"name\":\"RWKV: Reinventing RNNs for the Transformer Era — with Eugene Cheah of UIlicious\",\"guid\":\"substack:post:136547662\",\"artistName\":\"Eugene Cheah\",\"contentRating\":\"clean\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/136547662/4b893a10da528ef7318f1037387882c7.mp3\"}},{\"id\":\"1000625279974\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000625279974?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Latent.Space\",\"contentAdvisory\":\"\",\"artworkOrigin\":\"podcast\",\"genreNames\":[\"Technology\"],\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"Thanks to the almost 30k people who tuned in to the last episode!\\nYour podcast cohosts have been busy shipping:\\n* Alessio open sourced smol-podcaster, which makes the show notes here! \\n* swyx launched GodMode. Maybe someday the Cursor of browsers?\\n* We’re also helping organize a Llama Finetuning Hackameetup this Saturday in anticipation of the CodeLlama release. \\nLastly, more speakers were announced at AI Engineer Summit! 👀\\n~46% of code typed through VS Code is written by Copilot. How do we get closer to 90+%? Aman Sanger says we need a brand new AI-powered IDE to get there; and we’re excited to be the first podcast ever to tell the Cursor story.\\nIf you haven’t heard of Cursor, you may have been living under a rock. Here are just some of the rave reviews going around in the past week alone:\\n* “Cursor is the best product I've used in a while” - Alex MacCaw\\n* “Someone finally put GPT into a code editor in a seamless way. It's so elegant and easy. No more copying and pasting.” - Andrew McCalip\\n* “Coding with AI is getting insane.” - Mckay Wrigley\\n* “This is mind blowing 🤯” - Linus Ekenstam\\n* “Cursor + gpt4-32k = illegal levels of productivity” - Sully Omarr\\n* “EL MEJOR EDITOR DE CÓDIGO con IA” - Carlos Santana\\nA decade ago, “platform risk” meant building apps on social media platforms was risky as you could get cut off from the social network. \\nToday, the AI version of “platform risk” is building AI products within an existing product (like an AI extension for VS Code, or a Figma plugin). Since Copilot, a generation of VSCode plugins have launched (including Cody, Cosine, and previous guests Codeium and Codium), only to be challenged by Copilot X itself.\\nA core AI Engineering thesis is that new capabilities in AI demands new innovation in AI UX (and that AI UX can actually be a viable moat). Take VS Code for example; when Github was first working on Copilot, there was actually no way to support the “ghost autocomplete” feature we all use today. They eventually convinced the team to build it, and Copilot’s success speaks for itself.\\nIf you’re a startup building on top of VSC today, you do not have the same access and influence on the roadmap. Your UX is limited to what they allow you to do, and often that caps your ability to successfully compete against them. \\nSince Cursor owns the whole IDE, they can do things you can’t (yet) do in VSCode:\\n\\nCursor’s Gameplan\\nCursor is competing head to head against VS Code by forking Microsoft’s IDE and building their own AI-powered version. A few of Cursor’s unique features:\\n* Native chat: Chat is a core piece of Cursor. Users can choose between GPT-3.5 and GPT-4 to ask questions and receive answers based on their code.\\n* “Mentioning” files: you can easily add files into your request context by using “@”; this works both for code as well as documentation. If you want to do a change that includes multiple files, you can include them in your question to make sure the change is reflected in all of them.\\n* Custom prompting engine: Cursor built Priompt, their custom prompting engine. As your chats go over the context window size, Priompt figures out which messages to keep in the history, which files to drop from the prompt, etc. \\n* Moving beyond typing: while IDEs are familiar to folks as today’s interfaces, in the future Cursor hopes to have agents you can delegate tasks to. Instead of a back and forth on a new feature or bug fix, you can ask it to do the whole thing for you end to end.\\nAfter diving deep into Cursor we nerded out on model usage, training, quantization, and evaluation. There’s a ton of great content in this episode, we hope you’ll enjoy it!\\nAs always, feedback welcome in the comments, and tag us on socials for future guest suggestions!\\n\\nShow Notes\\n* Cursor\\n* Gary Marcus’ cubes prompt\\n* Priompt\\n* “Humans should focus on bigger problems.”\\n* Codium AI on Latent Space\\n* Rift from Morph\\n* Sourcegraph\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/cursor-so-the-ai-first-code-editor-with-aman/id1674008350?i=1000625279974\",\"releaseDateTime\":\"2023-08-22T15:55:11Z\",\"websiteUrl\":\"https://www.latent.space/p/cursor\",\"durationInMilliseconds\":3565000,\"name\":\"Cursor.so: The AI-first Code Editor — with Aman Sanger of Anysphere\",\"guid\":\"substack:post:136284642\",\"contentRating\":\"clean\",\"artistName\":\"Aman Sanger\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/136284642/9d43e0e0ee1703ab27486797a8b1ffaa.mp3\"}},{\"id\":\"1000624670587\",\"type\":\"podcast-episodes\",\"href\":\"/v1/catalog/us/podcast-episodes/1000624670587?l=en-US\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"contentAdvisory\":\"\",\"copyright\":\"Latent.Space\",\"artworkOrigin\":\"podcast\",\"genreNames\":[\"Technology\"],\"kind\":\"full\",\"mediaKind\":\"audio\",\"description\":{\"standard\":\"Invites are going out for AI Engineer Summit! In the meantime, we have just announced our first Actually Open AI event with Brev.dev and Langchain, Aug 26 in our SF HQ (we’ll record talks for those remote). See you soon (and join the Discord)!\\nSpecial thanks to @nearcyan for helping us arrange this with the Eleuther team.\\nThis post was on the HN frontpage for 15 hours.\\nAs startups and even VCs hoard GPUs to attract talent, the one thing more valuable than GPUs is knowing how to use them (aka, make GPUs go brrrr).\\nThere is an incredible amount of tacit knowledge in the NLP community around training, and until Eleuther.ai came along you pretty much had to work at Google or Meta to gain that knowledge. This makes it hard for non-insiders to even do simple estimations around costing out projects - it is well known how to trade $ for GPU hours, but trading “$ for size of model” or “$ for quality of model” is less known and more valuable and full of opaque “it depends”. This is why rules of thumb for training are incredibly useful, because they cut through the noise and give you the simple 20% of knowledge that determines 80% of the outcome derived from hard earned experience.\\nToday’s guest, Quentin Anthony from EleutherAI, is one of the top researchers in high-performance deep learning. He’s one of the co-authors of Transformers Math 101, which was one of the clearest articulations of training rules of thumb. We can think of no better way to dive into training math than to have Quentin run us through a masterclass on model weights, optimizer states, gradients, activations, and how they all impact memory requirements.\\nThe core equation you will need to know is the following:\\nWhere C is the compute requirements to train a model, P is the number of parameters, and D is the size of the training dataset in tokens. This is also equal to τ, the throughput of your machine measured in FLOPs (Actual FLOPs/GPU * # of GPUs), multiplied by T, the amount of time spent training the model.\\nTaking Chinchilla scaling at face value, you can simplify this equation to be `C = 120(P^2)`.These laws are only true when 1000 GPUs for 1 hour costs the same as 1 GPU for 1000 hours, so it’s not always that easy to make these assumptions especially when it comes to communication overhead.  \\nThere’s a lot more math to dive into here between training and inference, which you can listen to in the episode or read in the articles. \\nThe other interesting concept we covered is distributed training and strategies such as ZeRO and 3D parallelism. As these models have scaled, it’s become impossible to fit everything in a single GPU for training and inference. We leave these advanced concepts to the end, but there’s a lot of innovation happening around sharding of params, gradients, and optimizer states that you must know is happening in modern LLM training. \\nIf you have questions, you can join the Eleuther AI Discord or follow Quentin on Twitter. \\nShow Notes\\n* Transformers Math 101 Article\\n* Eleuther.ai\\n* GPT-NeoX 20B\\n* BLOOM\\n* Turing NLG\\n* Mosaic\\n* Oak Ridge & Frontier Supercomputer\\n* Summit Supercomputer \\n* Lawrence Livermore Lab\\n* RWKV\\n* Flash Attention \\n* Stas Bekman\\nTimestamps\\n* [00:00:00] Quentin's background and work at Eleuther.ai\\n* [00:03:14] Motivation behind writing the Transformers Math 101 article\\n* [00:05:58] Key equation for calculating compute requirements (tau x T = 6 x P x D)\\n* [00:10:00] Difference between theoretical and actual FLOPs\\n* [00:12:42] Applying the equation to estimate compute for GPT-3 training\\n* [00:14:08] Expecting 115+ teraflops/sec per A100 GPU as a baseline\\n* [00:15:10] Tradeoffs between Nvidia and AMD GPUs for training\\n* [00:18:50] Model precision (FP32, FP16, BF16 etc.) and impact on memory\\n* [00:22:00] Benefits of model quantization even with unlimited memory\\n* [00:23:44] KV cache memory overhead during inference\\n* [00:26:08] How optimizer memory usage is calculated\\n* [00:32:03] Components of total tra\",\"short\":\"\"},\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/97/39/d6/9739d6fc-d55e-483b-c8fd-66764254ab1d/mza_11445832196745209483.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"291a28\",\"textColor1\":\"fffdfe\",\"textColor2\":\"f6baab\",\"textColor3\":\"d4cfd3\",\"textColor4\":\"cd9a91\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-mathematics-of-training-llms-with/id1674008350?i=1000624670587\",\"releaseDateTime\":\"2023-08-16T16:52:03Z\",\"websiteUrl\":\"https://www.latent.space/p/transformers-math\",\"durationInMilliseconds\":3038000,\"name\":\"The Mathematics of Training LLMs — with Quentin Anthony of Eleuther AI\",\"guid\":\"substack:post:136047711\",\"contentRating\":\"clean\",\"artistName\":\"Quentin Anthony\",\"subscribable\":true,\"assetUrl\":\"https://api.substack.com/feed/podcast/136047711/48d981d835799b970867b03c1ec3ff2a.mp3\"}}]},\"channel\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/channel?l=en-US\",\"data\":[]},\"genres\":{\"href\":\"/v1/catalog/us/podcasts/1674008350/genres?l=en-US\",\"data\":[{\"id\":\"1318\",\"type\":\"genres\",\"href\":\"/v1/catalog/us/genres/1318?l=en-US\",\"attributes\":{\"parentName\":\"Podcasts\",\"name\":\"Technology\",\"url\":\"https://itunes.apple.com/us/genre/id1318\",\"parentId\":\"26\"}},{\"id\":\"1321\",\"type\":\"genres\",\"href\":\"/v1/catalog/us/genres/1321?l=en-US\",\"attributes\":{\"parentName\":\"Podcasts\",\"name\":\"Business\",\"url\":\"https://itunes.apple.com/us/genre/id1321\",\"parentId\":\"26\"}}]}}}]}",
        ".v1.catalog.us.charts.types.podcasts.genre.1318": "{\"x\":1695353275016,\"d\":{\"podcasts\":[{\"chart\":\"top\",\"name\":\"Top Shows\",\"orderId\":\"top:podcasts\",\"next\":\"/v1/catalog/us/charts?chart=top&genre=1318&offset=20&types=podcasts\",\"data\":[{\"id\":\"1434243584\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1434243584\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"genreNames\":[\"Technology\",\"Podcasts\",\"Science\"],\"releaseFrequency\":\"Updated Biweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Conversations about science, technology, history, philosophy and the nature of intelligence, consciousness, love, and power. Lex is an AI researcher at MIT and beyond.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts115/v4/3e/e3/9c/3ee39c89-de08-47a6-7f3d-3849cef6d255/mza_16657851278549137484.png/{w}x{h}bb.{f}\",\"bgColor\":\"000000\",\"textColor1\":\"f0f8f8\",\"textColor2\":\"b0f4ff\",\"textColor3\":\"c0c6c6\",\"textColor4\":\"8cc3cb\"},\"url\":\"https://podcasts.apple.com/us/podcast/lex-fridman-podcast/id1434243584\",\"releaseDateTime\":\"2023-09-18T01:07:00Z\",\"trackCount\":397,\"displayType\":\"free\",\"createdDate\":\"2018-08-26\",\"websiteUrl\":\"https://lexfridman.com/\",\"name\":\"Lex Fridman Podcast\",\"artistName\":\"Lex Fridman\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1434243584\"}},{\"id\":\"1528594034\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1528594034\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2022 THE NEW YORK TIMES COMPANY; The New York Times encourages the use of RSS feeds for personal use in a news reader or as part of a non-commercial blog, subject to your agreement to our Terms of Service.\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"“Hard Fork” is a show about the future that’s already here. Each week, journalists Kevin Roose and Casey Newton explore and make sense of the latest in the rapidly changing world of tech. \\n\\nListen to this podcast in New York Times Audio, our new iOS app for news subscribers. Download now at nytimes.com/audioapp\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/90/c6/68/90c6680c-0ad0-ac08-b2c8-6bda5f057654/mza_11004870069464171643.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"e8ee1e\",\"textColor1\":\"000001\",\"textColor2\":\"670d09\",\"textColor3\":\"2e2f07\",\"textColor4\":\"813a0d\"},\"url\":\"https://podcasts.apple.com/us/podcast/hard-fork/id1528594034\",\"releaseDateTime\":\"2023-09-15T09:00:00Z\",\"trackCount\":49,\"displayType\":\"free\",\"createdDate\":\"2020-08-20\",\"websiteUrl\":\"https://www.nytimes.com/column/hard-fork\",\"name\":\"Hard Fork\",\"artistName\":\"The New York Times\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1528594034\"}},{\"id\":\"1502871393\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1502871393\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Industry veterans, degenerate gamblers & besties Chamath Palihapitiya, Jason Calacanis, David Sacks & David Friedberg cover all things economic, tech, political, social & poker.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":2000,\"height\":2000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts124/v4/c7/d2/92/c7d292ea-44b3-47ff-2f5e-74fa5b23db6c/mza_7005270671777648882.png/{w}x{h}bb.{f}\",\"bgColor\":\"030303\",\"textColor1\":\"ffffff\",\"textColor2\":\"d3d3d3\",\"textColor3\":\"cccccc\",\"textColor4\":\"a9a9a9\"},\"url\":\"https://podcasts.apple.com/us/podcast/all-in-with-chamath-jason-sacks-friedberg/id1502871393\",\"releaseDateTime\":\"2023-09-08T20:23:00Z\",\"trackCount\":159,\"displayType\":\"free\",\"createdDate\":\"2020-03-15\",\"websiteUrl\":\"http://allinchamathjason.libsyn.com/website\",\"name\":\"All-In with Chamath, Jason, Sacks & Friedberg\",\"artistName\":\"Jason Calacanis\",\"contentRating\":\"explicit\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1502871393\"}},{\"id\":\"1050462261\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1050462261\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Copyright 2023 ACQ, LLC\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Investing\"],\"releaseFrequency\":\"Updated Biweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[1,2,3,4,5,6,7,8,9,10,11,12,13],\"description\":{\"standard\":\"Every company has a story.\\n\\nLearn the playbooks that built the world’s greatest companies — and how you can apply them as a founder, operator, or investor.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/99/7c/b3/997cb3c7-ef79-aaeb-b70b-2ede5cad91c5/mza_1521810165626406287.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"021617\",\"textColor1\":\"fbffff\",\"textColor2\":\"32ffcc\",\"textColor3\":\"c9d0d0\",\"textColor4\":\"29d0a7\"},\"url\":\"https://podcasts.apple.com/us/podcast/acquired/id1050462261\",\"releaseDateTime\":\"2023-09-06T06:47:00Z\",\"trackCount\":183,\"displayType\":\"free\",\"createdDate\":\"2015-10-17\",\"websiteUrl\":\"https://acquired.fm\",\"name\":\"Acquired\",\"artistName\":\"Ben Gilbert and David Rosenthal\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1050462261\"}},{\"id\":\"523121474\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/523121474\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"},{\"kind\":\"subscribe\",\"type\":\"PSUB\"}],\"copyright\":\"© Copyright 2012-2021 NPR and Ted Conferences, LLC - For Personal Use Only\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Science\",\"Social Sciences\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Exploring the biggest questions of our time with the help of the world's greatest thinkers. Host Manoush Zomorodi inspires us to learn more about the world, our communities, and most importantly, ourselves.Get more brainy miscellany with TED Radio Hour+. Your subscription supports the show and unlocks a sponsor-free feed. Learn more at plus.npr.org/ted\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/e4/23/90/e4239057-ff9b-0ced-9d7b-5fd2727077e7/mza_249251147727353095.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"12072f\",\"textColor1\":\"ffffff\",\"textColor2\":\"2b94e0\",\"textColor3\":\"cfcdd5\",\"textColor4\":\"2678bd\"},\"url\":\"https://podcasts.apple.com/us/podcast/ted-radio-hour/id523121474\",\"releaseDateTime\":\"2023-09-20T04:00:00Z\",\"trackCount\":317,\"displayType\":\"hybrid\",\"createdDate\":\"2012-04-27\",\"websiteUrl\":\"https://www.npr.org/podcasts/510298/ted-radio-hour\",\"name\":\"TED Radio Hour\",\"artistName\":\"NPR\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=523121474\"}},{\"id\":\"1296350485\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1296350485\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"},{\"kind\":\"subscribe\",\"type\":\"PSUB\"}],\"copyright\":\"© Jack Rhysider\",\"genreNames\":[\"Technology\",\"Podcasts\",\"True Crime\"],\"releaseFrequency\":\"Updated Monthly\",\"kind\":\"episodic\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"Explore true stories of the dark side of the Internet with host Jack Rhysider as he takes you on a journey through the chilling world of hacking, data breaches, and cyber crime.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/d9/e6/9c/d9e69cfc-4b65-c879-75d6-6624246f0ded/mza_12966154832216548918.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"2f3032\",\"textColor1\":\"f8f9fb\",\"textColor2\":\"cbcccf\",\"textColor3\":\"d0d1d3\",\"textColor4\":\"acadb0\"},\"url\":\"https://podcasts.apple.com/us/podcast/darknet-diaries/id1296350485\",\"releaseDateTime\":\"2023-09-05T07:00:00Z\",\"trackCount\":149,\"displayType\":\"hybrid\",\"createdDate\":\"2017-10-13\",\"websiteUrl\":\"https://darknetdiaries.com/\",\"name\":\"Darknet Diaries\",\"artistName\":\"Jack Rhysider\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1296350485\"}},{\"id\":\"941907967\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/941907967\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Society & Culture\",\"Documentary\"],\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"\\\"'A podcast about the internet' that is actually an unfailingly original exploration of modern life and how to survive it.\\\" - The Guardian. Hosted by Alex Goldman and Emmanuel Dzotsi from Gimlet.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/c9/79/bf/c979bfd8-0366-effb-66ab-58e41c35e6c4/mza_10297816036296753741.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"ffffff\",\"textColor1\":\"450d2d\",\"textColor2\":\"540e33\",\"textColor3\":\"6a3d57\",\"textColor4\":\"763e5c\"},\"url\":\"https://podcasts.apple.com/us/podcast/reply-all/id941907967\",\"releaseDateTime\":\"2023-09-21T12:00:00Z\",\"trackCount\":213,\"displayType\":\"free\",\"createdDate\":\"2014-11-14\",\"websiteUrl\":\"http://gimletmedia.com/shows/reply-all\",\"name\":\"Reply All\",\"artistName\":\"Gimlet\",\"contentRating\":\"explicit\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=941907967\"}},{\"id\":\"430333725\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/430333725\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2022 Vox Media, Inc. All Rights Reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"releaseFrequency\":\"Updated Semiweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The Vergecast is the flagship podcast from The Verge about small gadgets, Big Tech, and everything in between. Every Friday, hosts Nilay Patel, David Pierce, and Alex Cranz hang out and make sense of the week’s most important technology news. And every Wednesday, David leads a selection of The Verge’s expert staffers in an exploration of how gadgets and software affect our lives – and which ones you should bring into yours. \"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/f7/dd/e6/f7dde670-0467-e2ab-1920-60de38ff2e23/mza_5728986817819732731.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"5100ff\",\"textColor1\":\"faf6f7\",\"textColor2\":\"f5e7d3\",\"textColor3\":\"d9c5f9\",\"textColor4\":\"d4b9dc\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-vergecast/id430333725\",\"releaseDateTime\":\"2023-09-20T13:00:00Z\",\"trackCount\":690,\"displayType\":\"free\",\"createdDate\":\"2011-04-04\",\"websiteUrl\":\"https://www.theverge.com/the-vergecast\",\"name\":\"The Vergecast\",\"artistName\":\"The Verge\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=430333725\"}},{\"id\":\"1474429475\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1474429475\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Marques Brownlee\",\"genreNames\":[\"Technology\",\"Podcasts\",\"News\",\"Tech News\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"A tech podcast for the gadget lovers and tech heads among us from the mind of Marques Brownlee, better known as MKBHD. MKBHD has made a name for himself on YouTube reviewing everything from the newest smartphones to cameras to electric cars. Pulling from over 10 years of experience covering the tech industry, MKBHD and co-hosts Andrew Manganelli and David Imel will keep you informed and entertained as they take a deep dive into the latest and greatest in tech and what deserves your hard earned cash. New episodes every week. Waveform is part of the Vox Media Podcast Network.\\nWe wanna make the podcast even better, help us learn how we can: https://bit.ly/2EcYbu4 \"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/9f/00/ff/9f00ff17-f5e9-6739-451b-3674ad515fc9/mza_4488412691697858948.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"ad1717\",\"textColor1\":\"fffbff\",\"textColor2\":\"ffd6d3\",\"textColor3\":\"eecdd0\",\"textColor4\":\"eeafad\"},\"url\":\"https://podcasts.apple.com/us/podcast/waveform-the-mkbhd-podcast/id1474429475\",\"releaseDateTime\":\"2023-09-15T08:00:00Z\",\"trackCount\":188,\"displayType\":\"free\",\"createdDate\":\"2019-07-27\",\"websiteUrl\":\"https://www.youtube.com/c/Waveform\",\"name\":\"Waveform: The MKBHD Podcast\",\"artistName\":\"Vox Media Podcast Network\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1474429475\"}},{\"id\":\"1473344545\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1473344545\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© (c) 2019-2023 Maris Consulting Group, All Rights Reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Society & Culture\"],\"kind\":\"episodic\",\"seasonNumbers\":[1,2,3,4,5,6,7,8],\"description\":{\"standard\":\"Underserved is the podcast for the rest of the technology industry. No startup or gadget worship, just real stories, lessons, and interesting topics from real people in the technology industry. Special emphasis on software development culture and history.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/a5/18/91/a5189172-d07c-7259-6397-f699139b1adc/mza_11363259871355227906.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"06202c\",\"textColor1\":\"fda71d\",\"textColor2\":\"f95f08\",\"textColor3\":\"cc8c20\",\"textColor4\":\"c8530f\"},\"url\":\"https://podcasts.apple.com/us/podcast/underserved/id1473344545\",\"releaseDateTime\":\"2023-06-26T16:01:00Z\",\"trackCount\":108,\"displayType\":\"free\",\"createdDate\":\"2019-07-17\",\"websiteUrl\":\"http://underserved.libsyn.com/website\",\"name\":\"Underserved\",\"artistName\":\"Andrew Gelina\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1473344545\"}},{\"id\":\"1465767420\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1465767420\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2019 Vox Media, Inc. All Rights Reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\"],\"releaseFrequency\":\"Weekly Series\",\"kind\":\"serial\",\"seasonNumbers\":[1,2,3,4,5,6,7,8],\"description\":{\"standard\":\"Big tech is transforming every aspect of our world. But how? And at what cost? Land of the Giants: The Tesla Shock Wave examines the past, present and future of the company that jumpstarted the shift to electric vehicles. Automotive journalists, Tamara Warren and Patrick George team up to explore how exactly Tesla snuck ahead of the competition, the unique role Elon Musk has played in the company’s success, and the twists and turns that lie ahead in its race for EV dominance.\\n\\nNew episodes drop every Wednesday. From The Verge and the Vox Media Podcast Network.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/16/51/17/165117ad-30d1-d3b2-6fb0-3f55c31d92a5/mza_8186822311181157021.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"bb0313\",\"textColor1\":\"fffeff\",\"textColor2\":\"ffbec5\",\"textColor3\":\"f1cbcf\",\"textColor4\":\"f198a1\"},\"url\":\"https://podcasts.apple.com/us/podcast/land-of-the-giants/id1465767420\",\"releaseDateTime\":\"2023-08-30T12:36:00Z\",\"trackCount\":59,\"displayType\":\"free\",\"createdDate\":\"2019-05-28\",\"websiteUrl\":\"podcasts.voxmedia.com/show/land-of-the-giants\",\"name\":\"Land of the Giants\",\"artistName\":\"The Verge\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1465767420\"}},{\"id\":\"1234320525\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1234320525\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"Copyright © Dow Jones & Company, Inc. All rights reserved.\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Monthly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"What will the future look like? The Future of Everything offers a kaleidoscope view of the nascent trends that will shape our world. In every episode, join our award-winning team on a new journey of discovery. We’ll take you beyond what’s already out there, and make you smarter about the scientific and technological breakthroughs on the horizon that could transform our lives for the better.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/7e/b4/74/7eb47450-a301-57b7-f4f7-0804c92a45c4/mza_16960699269854943154.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"232c2b\",\"textColor1\":\"eff6ee\",\"textColor2\":\"8bf3fe\",\"textColor3\":\"c6cec7\",\"textColor4\":\"76cbd4\"},\"url\":\"https://podcasts.apple.com/us/podcast/wsjs-the-future-of-everything/id1234320525\",\"releaseDateTime\":\"2023-09-15T10:00:00Z\",\"trackCount\":50,\"displayType\":\"free\",\"createdDate\":\"2017-05-08\",\"websiteUrl\":\"https://www.wsj.com/podcasts/wsj-the-future-of-everything\",\"name\":\"WSJ’s The Future of Everything\",\"artistName\":\"The Wall Street Journal\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1234320525\"}},{\"id\":\"1627920305\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1627920305\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Lenny Rachitsky\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Interviews with world-class product leaders and growth experts to uncover concrete, actionable, and tactical advice to help you build, launch, and grow your own product. \\n\\nwww.lennysnewsletter.com\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts122/v4/94/20/69/942069b5-0858-2de0-399d-d8b51ca114fd/mza_11196836996864322649.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"fecea8\",\"textColor1\":\"000001\",\"textColor2\":\"252525\",\"textColor3\":\"322923\",\"textColor4\":\"50473f\"},\"url\":\"https://podcasts.apple.com/us/podcast/lennys-podcast-product-growth-career/id1627920305\",\"releaseDateTime\":\"2023-09-21T12:01:00Z\",\"trackCount\":116,\"displayType\":\"free\",\"createdDate\":\"2022-06-04\",\"websiteUrl\":\"https://www.lennysnewsletter.com/podcast\",\"name\":\"Lenny's Podcast: Product | Growth | Career\",\"artistName\":\"Lenny Rachitsky\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1627920305\"}},{\"id\":\"842818711\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/842818711\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© All rights reserved\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\",\"Entrepreneurship\"],\"releaseFrequency\":\"Updated Biweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The a16z Podcast discusses tech and culture trends, news, and the future – especially as ‘software eats the world’. It features industry experts, business leaders, and other interesting thinkers and voices from around the world. This podcast is produced by Andreessen Horowitz (aka “a16z”), a Silicon Valley-based venture capital firm. Multiple episodes are released every week; visit a16z.com for more details and to sign up for our newsletters and other content as well!\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts112/v4/4c/0b/f2/4c0bf2f6-8d27-767f-f7ec-c33202c1638c/mza_17705033532805449089.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"fc8600\",\"textColor1\":\"0a0400\",\"textColor2\":\"080605\",\"textColor3\":\"3a1e00\",\"textColor4\":\"392004\"},\"url\":\"https://podcasts.apple.com/us/podcast/a16z-podcast/id842818711\",\"releaseDateTime\":\"2023-09-19T22:13:00Z\",\"trackCount\":250,\"displayType\":\"free\",\"createdDate\":\"2014-03-17\",\"websiteUrl\":\"https://a16z.simplecast.com\",\"name\":\"a16z Podcast\",\"artistName\":\"Andreessen Horowitz\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=842818711\"}},{\"id\":\"1515786216\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1515786216\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2023 Deep Questions with Cal Newport\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[1],\"description\":{\"standard\":\"Cal Newport is a computer science professor and a New York Times bestselling author who writes about the impact of technology on society, and the struggle to work and live deeply in a world increasingly mired in digital distractions. On this podcast, he answers questions from his readers and offers advice about cultivating focus, productivity, and meaning amidst the noise that pervades our lives.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/72/76/4f/72764fe5-ce0e-6af9-4f22-cf133dfd4348/mza_15248579015902949914.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"c21606\",\"textColor1\":\"fce9b6\",\"textColor2\":\"ffcdc9\",\"textColor3\":\"f0bf93\",\"textColor4\":\"f2a8a1\"},\"url\":\"https://podcasts.apple.com/us/podcast/deep-questions-with-cal-newport/id1515786216\",\"releaseDateTime\":\"2023-09-18T11:00:00Z\",\"trackCount\":267,\"displayType\":\"free\",\"createdDate\":\"2020-05-28\",\"websiteUrl\":\"https://www.buzzsprout.com/1121972\",\"name\":\"Deep Questions with Cal Newport\",\"artistName\":\"Cal Newport\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1515786216\"}},{\"id\":\"1516843565\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1516843565\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"genreNames\":[\"Technology\",\"Podcasts\",\"Society & Culture\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"The future. It’s exciting; it’s discomforting. We don’t know what’s happening next— in the next four minutes on Twitter or in the next four years of democracy.  \\nHave a Nice Future is a new podcast from WIRED, where each week, Wired’s Senior Writer Lauren Goode & Contributor Gideon Lichfield speak with the top technologists, thinkers, and creators who are shaping this future we’re racing into. Every episode, we’ll ask each guest—and ourselves—the same question: Is this the future we want? And if not, where do we go from here?\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":2200,\"height\":2200,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/eb/24/76/eb247683-7036-989c-7239-cc50dfee885c/mza_7476143364661773942.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"1a070d\",\"textColor1\":\"85b7ff\",\"textColor2\":\"78b8ed\",\"textColor3\":\"6f93ce\",\"textColor4\":\"6594c0\"},\"url\":\"https://podcasts.apple.com/us/podcast/have-a-nice-future-wired/id1516843565\",\"releaseDateTime\":\"2023-09-20T09:00:00Z\",\"trackCount\":55,\"displayType\":\"free\",\"createdDate\":\"2020-06-04\",\"websiteUrl\":\"https://www.wired.com\",\"name\":\"Have A Nice Future | WIRED\",\"artistName\":\"WIRED\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1516843565\"}},{\"id\":\"315114957\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/315114957\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© Jason Calacanis\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Daily\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Jason Calacanis covers startups, tech, markets, media, and all the hottest topics in business and technology. He also interviews the world’s greatest founders, operators, investors, and innovators.\\n\\nJoin our community on Twitter to discuss the show: https://twitter.com/i/communities/1496977694747209728\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/7b/7e/e8/7b7ee883-afc7-43a6-fe61-24e830ba037a/mza_14765038942256628792.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"000000\",\"textColor1\":\"f0f0f0\",\"textColor2\":\"fa9b39\",\"textColor3\":\"c0c0c0\",\"textColor4\":\"c87c2d\"},\"url\":\"https://podcasts.apple.com/us/podcast/this-week-in-startups/id315114957\",\"releaseDateTime\":\"2023-09-22T02:05:00Z\",\"trackCount\":919,\"displayType\":\"free\",\"createdDate\":\"2009-05-02\",\"websiteUrl\":\"https://thisweekinstartups.com\",\"name\":\"This Week in Startups\",\"artistName\":\"Jason Calacanis\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=315114957\"}},{\"id\":\"179237749\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/179237749\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"},{\"kind\":\"subscribe\",\"type\":\"PSUB\"}],\"copyright\":\"© This work is licensed under a Creative Commons License - Attribution-NonCommercial-NoDerivatives 4.0 International - http://creativecommons.org/licenses/by-nc-nd/4.0/\",\"genreNames\":[\"Technology\",\"Podcasts\"],\"releaseFrequency\":\"Updated Weekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Get the latest Apple news and views from the top experts in Mac, iPhone, and iPads.\\n\\nRecords live every Tuesday at 2:00pm Eastern / 11:00am Pacific / 18:00 UTC.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":2048,\"height\":2048,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/2a/32/88/2a3288dd-537b-975a-46fb-0abdb77c2e5d/mza_7642749812700456740.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"ffffff\",\"textColor1\":\"000000\",\"textColor2\":\"431b43\",\"textColor3\":\"333333\",\"textColor4\":\"694869\"},\"url\":\"https://podcasts.apple.com/us/podcast/macbreak-weekly-audio/id179237749\",\"releaseDateTime\":\"2023-09-19T23:00:00Z\",\"trackCount\":70,\"displayType\":\"hybrid\",\"createdDate\":\"2006-08-10\",\"websiteUrl\":\"https://twit.tv/shows/macbreak-weekly\",\"name\":\"MacBreak Weekly (Audio)\",\"artistName\":\"TWiT\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=179237749\"}},{\"id\":\"1680633614\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/1680633614\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"© 2023\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Business\"],\"releaseFrequency\":\"Updated Semiweekly\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"A daily news analysis show on all things artificial intelligence. NLW looks at AI from multiple angles, from the explosion of creativity brought on by new tools like Midjourney, ChatGPT and AutoGPT to the potential disruptions to work and industries as we know them to the great philosophical, ethical and practical questions of advanced general intelligence, alignment and x-risk.\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":3000,\"height\":3000,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts126/v4/98/48/1b/98481b01-a65c-0acd-882c-8092b8fdc978/mza_4121882920174444772.jpeg/{w}x{h}bb.{f}\",\"bgColor\":\"250d13\",\"textColor1\":\"ffffff\",\"textColor2\":\"d6b185\",\"textColor3\":\"d3cecf\",\"textColor4\":\"b3906e\"},\"url\":\"https://podcasts.apple.com/us/podcast/the-ai-breakdown-daily-artificial-intelligence-news/id1680633614\",\"releaseDateTime\":\"2023-09-21T18:08:00Z\",\"trackCount\":161,\"displayType\":\"free\",\"createdDate\":\"2023-04-04\",\"websiteUrl\":\"https://sites.libsyn.com/468519\",\"name\":\"The AI Breakdown: Daily Artificial Intelligence News and Discussions\",\"artistName\":\"Nathaniel Whittemore\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=1680633614\"}},{\"id\":\"660921339\",\"type\":\"podcasts\",\"href\":\"/v1/catalog/us/podcasts/660921339\",\"attributes\":{\"offers\":[{\"kind\":\"get\",\"type\":\"STDQ\"}],\"copyright\":\"The Kim Komando Show ® and all material pertaining thereto is a  Registered Trademark / Servicemark: No. 2281044.  Any and all other material herein is protected by Copyright © 1995 – 2023 WestStar Multimedia Entertainment. All Rights Reserved.\",\"genreNames\":[\"Technology\",\"Podcasts\",\"Society & Culture\"],\"releaseFrequency\":\"Updated Daily\",\"kind\":\"episodic\",\"seasonNumbers\":[],\"description\":{\"standard\":\"Sound like a tech pro, even if you’re not! Award-winning popular host Kim Komando is your secret weapon.\\n\\nKim is in a class all her own. Her widely successful radio show is heard on over 500 stations in the United States and internationally in 175 different countries. Kim has millions of fans who love her down-to-earth, deeply relatable, and easy-to-understand way of talking about consumer tech.\\n\\nEvery episode is loaded with the scoop about the latest gadgets, online security, social media trends, and digital privacy. Kim makes it all entertaining and fun. With a mix of important news, practical advice, and compelling conversations, you’ll be able to make informed decisions and stay up-to-date with the latest trends in the tech world. \\n\\nKim started her show and still owns it herself. She’s not part of a big broadcasting company. Her company has no debt or investors. That’s why many small business owners also turn to her for advice on growing their businesses using web-based tools. \\n\\nIn the Kim Komando Today Podcast, every episode is loaded with ways to better your tech life. New episodes of the Kim Komando Podcast drop every Monday through Friday.\\n\\nTo learn more about Kim, the things she mentions, or submit a topic or question, drop by www.Komando.com\"},\"languageTag\":\"en-US\",\"completed\":false,\"artwork\":{\"width\":1400,\"height\":1400,\"url\":\"https://is1-ssl.mzstatic.com/image/thumb/Podcasts116/v4/7a/04/e0/7a04e03d-ca43-8670-be41-1719e8c34c6f/mza_9100636890142962588.jpg/{w}x{h}bb.{f}\",\"bgColor\":\"02081e\",\"textColor1\":\"fff3f1\",\"textColor2\":\"ff6352\",\"textColor3\":\"ccc3c6\",\"textColor4\":\"cc5148\"},\"url\":\"https://podcasts.apple.com/us/podcast/kim-komando-today/id660921339\",\"releaseDateTime\":\"2023-09-20T10:00:00Z\",\"trackCount\":831,\"displayType\":\"free\",\"createdDate\":\"2013-06-11\",\"websiteUrl\":\"https://www.komando.com\",\"name\":\"Kim Komando Today\",\"artistName\":\"Kim Komando\",\"contentRating\":\"clean\",\"subscribable\":true,\"subscriptionUrl\":\"https://buy.itunes.apple.com/WebObjects/MZFinance.woa/wa/subscribePodcast?cc=us&id=660921339\"}}],\"href\":\"/v1/catalog/us/charts?chart=top&genre=1318&types=podcasts\"}]}}"
    },
    {
        "nav": "<div id=\"globalheader\"><aside id=\"globalmessage-segment\" lang=\"en-US\" dir=\"ltr\" class=\"globalmessage-segment\"><ul class=\"globalmessage-segment-content\" data-strings=\"{&quot;view&quot;:&quot;{%STOREFRONT%} Store Home&quot;,&quot;segments&quot;:{&quot;smb&quot;:&quot;Business Store Home&quot;,&quot;eduInd&quot;:&quot;Education Store Home&quot;,&quot;other&quot;:&quot;Store Home&quot;},&quot;exit&quot;:&quot;Exit&quot;}\"><li class=\"globalmessage-segment-item\"><a href=\"www.apple.com/us/shop/goto/home\" class=\"globalmessage-segment-link globalmessage-segment-view\"></a></li><li class=\"globalmessage-segment-item\"><a href=\"www.apple.com/us/shop/goto/exitstore\" class=\"globalmessage-segment-link globalmessage-segment-exit\">Exit</a></li></ul></aside><nav id=\"globalnav\" lang=\"en-US\" dir=\"ltr\" aria-label=\"Global\" data-analytics-element-engagement-start=\"globalnav:onFlyoutOpen\" data-analytics-element-engagement-end=\"globalnav:onFlyoutClose\" data-store-api=\"https://www.apple.com/[storefront]/shop/bag/status\" data-analytics-activitymap-region-id=\"global nav\" data-analytics-region=\"global nav\" class=\"globalnav no-js   \"><div class=\"globalnav-content\"><div class=\"globalnav-item globalnav-menuback\"><button class=\"globalnav-menuback-button\" aria-label=\"Main menu\"><span class=\"globalnav-chevron-icon\"><svg height=\"48\" viewbox=\"0 0 9 48\" width=\"9\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m1.5618 24.0621 6.5581-6.4238c.2368-.2319.2407-.6118.0088-.8486-.2324-.2373-.6123-.2407-.8486-.0088l-7 6.8569c-.1157.1138-.1807.2695-.1802.4316.001.1621.0674.3174.1846.4297l7 6.7241c.1162.1118.2661.1675.4155.1675.1577 0 .3149-.062.4326-.1846.2295-.2388.2222-.6187-.0171-.8481z\"/></svg></span></button></div><ul id=\"globalnav-list\" class=\"globalnav-list\" aria-labelledby=\"globalnav-menutrigger-button\"><li data-analytics-element-engagement=\"globalnav hover - apple\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-apple\n\t\t\t\t\n\t\t\t\t\n\t\t\t\"><a href=\"https://www.apple.com/\" data-globalnav-item-name=\"apple\" data-analytics-title=\"apple home\" aria-label=\"Apple\" class=\"globalnav-link globalnav-link-apple\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 14 44\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m13.0729 17.6825a3.61 3.61 0 0 0 -1.7248 3.0365 3.5132 3.5132 0 0 0 2.1379 3.2223 8.394 8.394 0 0 1 -1.0948 2.2618c-.6816.9812-1.3943 1.9623-2.4787 1.9623s-1.3633-.63-2.613-.63c-1.2187 0-1.6525.6507-2.644.6507s-1.6834-.9089-2.4787-2.0243a9.7842 9.7842 0 0 1 -1.6628-5.2776c0-3.0984 2.014-4.7405 3.9969-4.7405 1.0535 0 1.9314.6919 2.5924.6919.63 0 1.6112-.7333 2.8092-.7333a3.7579 3.7579 0 0 1 3.1604 1.5802zm-3.7284-2.8918a3.5615 3.5615 0 0 0 .8469-2.22 1.5353 1.5353 0 0 0 -.031-.32 3.5686 3.5686 0 0 0 -2.3445 1.2084 3.4629 3.4629 0 0 0 -.8779 2.1585 1.419 1.419 0 0 0 .031.2892 1.19 1.19 0 0 0 .2169.0207 3.0935 3.0935 0 0 0 2.1586-1.1368z\"/></svg></span><span class=\"globalnav-image-compact globalnav-link-image\"><svg height=\"48\" viewbox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m15.5752 19.0792a4.2055 4.2055 0 0 0 -2.01 3.5376 4.0931 4.0931 0 0 0 2.4908 3.7542 9.7779 9.7779 0 0 1 -1.2755 2.6351c-.7941 1.1431-1.6244 2.2862-2.8878 2.2862s-1.5883-.734-3.0443-.734c-1.42 0-1.9252.7581-3.08.7581s-1.9611-1.0589-2.8876-2.3584a11.3987 11.3987 0 0 1 -1.9373-6.1487c0-3.61 2.3464-5.523 4.6566-5.523 1.2274 0 2.25.8062 3.02.8062.734 0 1.8771-.8543 3.2729-.8543a4.3778 4.3778 0 0 1 3.6822 1.841zm-6.8586-2.0456a1.3865 1.3865 0 0 1 -.2527-.024 1.6557 1.6557 0 0 1 -.0361-.337 4.0341 4.0341 0 0 1 1.0228-2.5148 4.1571 4.1571 0 0 1 2.7314-1.4078 1.7815 1.7815 0 0 1 .0361.373 4.1487 4.1487 0 0 1 -.9867 2.587 3.6039 3.6039 0 0 1 -2.5148 1.3236z\"/></svg></span><span class=\"globalnav-link-text\">Apple</span></a></li><li class=\"globalnav-item globalnav-menu\" data-topnav-flyout-item=\"menu\" data-topnav-flyout-label=\"Menu\" role=\"none\"><div class=\"globalnav-flyout\" data-topnav-flyout=\"menu\"><div class=\"globalnav-menu-list\"><div data-analytics-element-engagement=\"globalnav hover - store\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-store\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/us/shop/goto/store\" data-globalnav-item-name=\"store\" data-topnav-flyout-trigger-compact data-analytics-title=\"store\" data-analytics-element-engagement=\"hover - store\" aria-label=\"Store\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-store\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 30 44\" width=\"30\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m26.5679 20.4629c1.002 0 1.67.738 1.693 1.857h-3.48c.076-1.119.779-1.857 1.787-1.857zm2.754 2.672v-.387c0-1.963-1.037-3.176-2.742-3.176-1.735 0-2.848 1.289-2.848 3.276 0 1.998 1.096 3.263 2.848 3.263 1.383 0 2.367-.668 2.66-1.746h-1.008c-.264.557-.814.856-1.629.856-1.072 0-1.769-.791-1.822-2.039v-.047zm-9.547-3.451h.96v.937h.094c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.007c-.082-.023-.445-.058-.644-.058-.961 0-1.659 1.098-1.659 1.535v3.914h-1.007zm-4.27 5.519c-1.195 0-1.869-.867-1.869-2.361 0-1.5.674-2.361 1.869-2.361 1.196 0 1.87.861 1.87 2.361 0 1.494-.674 2.361-1.87 2.361zm0-5.631c-1.798 0-2.912 1.237-2.912 3.27 0 2.027 1.114 3.269 2.912 3.269 1.799 0 2.913-1.242 2.913-3.269 0-2.033-1.114-3.27-2.913-3.27zm-5.478-1.475v1.635h1.407v.843h-1.407v3.575c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.849c-.199.035-.393.059-.592.059-1.301 0-1.822-.481-1.822-1.688v-3.832h-1.02v-.843h1.02v-1.635zm-8.103 5.694c.129.885.973 1.447 2.174 1.447 1.137 0 1.975-.615 1.975-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.53-.386-2.192-1.078-2.192-2.279 0-1.436 1.201-2.408 2.988-2.408 1.635 0 2.854.972 2.942 2.338h-1.061c-.146-.867-.861-1.383-1.916-1.383-1.125 0-1.869.562-1.869 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.439 2.455 1.119 2.455 2.361 0 1.553-1.225 2.543-3.158 2.543-1.793 0-3.03-.949-3.141-2.408z\"/></svg></span><span class=\"globalnav-link-text\">Store</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - mac\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-mac\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/mac/\" data-globalnav-item-name=\"mac\" data-topnav-flyout-trigger-compact data-analytics-title=\"mac\" data-analytics-element-engagement=\"hover - mac\" aria-label=\"Mac\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-mac\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 23 44\" width=\"23\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m8.1558 25.9987v-6.457h-.0703l-2.666 6.457h-.8907l-2.666-6.457h-.0703v6.457h-.9844v-8.4551h1.2246l2.8945 7.0547h.0938l2.8945-7.0547h1.2246v8.4551zm2.5166-1.7696c0-1.1309.832-1.7812 2.3027-1.8691l1.8223-.1113v-.5742c0-.7793-.4863-1.207-1.4297-1.207-.7559 0-1.2832.2871-1.4238.7852h-1.0195c.1348-1.0137 1.1309-1.6816 2.4785-1.6816 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-.9609v-.9318h-.0938c-.4102.6738-1.1016 1.043-1.9453 1.043-1.2246 0-2.1328-.7266-2.1328-1.8809zm4.125-.5859v-.5801l-1.6992.1113c-.9609.0645-1.3828.3984-1.3828 1.0312 0 .6445.5449 1.0195 1.2773 1.0195 1.0371.0001 1.8047-.6796 1.8047-1.5819zm6.958-2.0273c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449z\"/></svg></span><span class=\"globalnav-link-text\">Mac</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - ipad\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-ipad\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/ipad/\" data-globalnav-item-name=\"ipad\" data-topnav-flyout-trigger-compact data-analytics-title=\"ipad\" data-analytics-element-engagement=\"hover - ipad\" aria-label=\"iPad\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-ipad\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 24 44\" width=\"24\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m14.9575 23.7002c0 .902-.768 1.582-1.805 1.582-.732 0-1.277-.375-1.277-1.02 0-.632.422-.966 1.383-1.031l1.699-.111zm-1.395-4.072c-1.347 0-2.343.668-2.478 1.681h1.019c.141-.498.668-.785 1.424-.785.944 0 1.43.428 1.43 1.207v.574l-1.822.112c-1.471.088-2.303.738-2.303 1.869 0 1.154.908 1.881 2.133 1.881.844 0 1.535-.369 1.945-1.043h.094v.931h.961v-4.324c0-1.312-.862-2.103-2.403-2.103zm6.769 5.575c-1.155 0-1.846-.885-1.846-2.361 0-1.471.697-2.362 1.846-2.362 1.142 0 1.857.914 1.857 2.362 0 1.459-.709 2.361-1.857 2.361zm1.834-8.027v3.503h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.27 0 1.986 1.037 3.269 2.654 3.269.873 0 1.623-.416 2.022-1.119h.093v1.008h.961v-8.824zm-15.394 4.869h-1.863v-3.563h1.863c1.225 0 1.899.639 1.899 1.799 0 1.119-.697 1.764-1.899 1.764zm.276-4.5h-3.194v8.455h1.055v-3.018h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.611-1.108-2.736-2.707-2.736zm-6.064 8.454h1.008v-6.316h-1.008zm-.199-8.237c0-.387.316-.704.703-.704s.703.317.703.704c0 .386-.316.703-.703.703s-.703-.317-.703-.703z\"/></svg></span><span class=\"globalnav-link-text\">iPad</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - iphone\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-iphone\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/iphone/\" data-globalnav-item-name=\"iphone\" data-topnav-flyout-trigger-compact data-analytics-title=\"iphone\" data-analytics-element-engagement=\"hover - iphone\" aria-label=\"iPhone\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-iphone\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 38 44\" width=\"38\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m32.7129 22.3203h3.48c-.023-1.119-.691-1.857-1.693-1.857-1.008 0-1.711.738-1.787 1.857zm4.459 2.045c-.293 1.078-1.277 1.746-2.66 1.746-1.752 0-2.848-1.266-2.848-3.264 0-1.986 1.113-3.275 2.848-3.275 1.705 0 2.742 1.213 2.742 3.176v.386h-4.541v.047c.053 1.248.75 2.039 1.822 2.039.815 0 1.366-.298 1.629-.855zm-12.282-4.682h.961v.996h.094c.316-.697.932-1.107 1.898-1.107 1.418 0 2.209.838 2.209 2.338v4.09h-1.007v-3.844c0-1.137-.481-1.676-1.489-1.676s-1.658.674-1.658 1.781v3.739h-1.008zm-2.499 3.158c0-1.5-.674-2.361-1.869-2.361-1.196 0-1.87.861-1.87 2.361 0 1.495.674 2.362 1.87 2.362 1.195 0 1.869-.867 1.869-2.362zm-4.782 0c0-2.033 1.114-3.269 2.913-3.269 1.798 0 2.912 1.236 2.912 3.269 0 2.028-1.114 3.27-2.912 3.27-1.799 0-2.913-1.242-2.913-3.27zm-6.636-5.666h1.008v3.504h.093c.317-.697.979-1.107 1.946-1.107 1.336 0 2.179.855 2.179 2.338v4.09h-1.007v-3.844c0-1.119-.504-1.676-1.459-1.676-1.131 0-1.752.715-1.752 1.781v3.739h-1.008zm-6.015 4.87h1.863c1.202 0 1.899-.645 1.899-1.764 0-1.16-.674-1.799-1.899-1.799h-1.863zm2.139-4.5c1.599 0 2.707 1.125 2.707 2.736 0 1.582-1.131 2.701-2.719 2.701h-2.127v3.018h-1.055v-8.455zm-6.114 8.454h1.008v-6.316h-1.008zm-.2-8.238c0-.386.317-.703.703-.703.387 0 .704.317.704.703 0 .387-.317.704-.704.704-.386 0-.703-.317-.703-.704z\"/></svg></span><span class=\"globalnav-link-text\">iPhone</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - watch\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-watch\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/watch/\" data-globalnav-item-name=\"watch\" data-topnav-flyout-trigger-compact data-analytics-title=\"watch\" data-analytics-element-engagement=\"hover - watch\" aria-label=\"Watch\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-watch\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 35 44\" width=\"35\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m28.9819 17.1758h1.008v3.504h.094c.316-.697.978-1.108 1.945-1.108 1.336 0 2.18.856 2.18 2.338v4.09h-1.008v-3.844c0-1.119-.504-1.675-1.459-1.675-1.131 0-1.752.715-1.752 1.781v3.738h-1.008zm-2.42 4.441c-.164-.627-.721-1.136-1.629-1.136-1.137 0-1.852.908-1.852 2.338 0 1.459.727 2.384 1.852 2.384.849 0 1.441-.392 1.629-1.107h1.019c-.182 1.16-1.125 2.016-2.642 2.016-1.77 0-2.901-1.284-2.901-3.293 0-1.969 1.125-3.247 2.895-3.247 1.535 0 2.472.92 2.648 2.045zm-6.533-3.568v1.635h1.407v.844h-1.407v3.574c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.85c-.2.035-.393.058-.592.058-1.301 0-1.822-.48-1.822-1.687v-3.832h-1.02v-.844h1.02v-1.635zm-4.2 5.596v-.58l-1.699.111c-.961.064-1.383.398-1.383 1.031 0 .645.545 1.02 1.277 1.02 1.038 0 1.805-.68 1.805-1.582zm-4.125.586c0-1.131.832-1.782 2.303-1.869l1.822-.112v-.574c0-.779-.486-1.207-1.43-1.207-.755 0-1.283.287-1.423.785h-1.02c.135-1.014 1.131-1.682 2.479-1.682 1.541 0 2.402.792 2.402 2.104v4.324h-.961v-.931h-.094c-.41.673-1.101 1.043-1.945 1.043-1.225 0-2.133-.727-2.133-1.881zm-7.684 1.769h-.996l-2.303-8.455h1.101l1.682 6.873h.07l1.893-6.873h1.066l1.893 6.873h.07l1.682-6.873h1.101l-2.302 8.455h-.996l-1.946-6.674h-.07z\"/></svg></span><span class=\"globalnav-link-text\">Watch</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - airpods\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-airpods\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/airpods/\" data-globalnav-item-name=\"airpods\" data-topnav-flyout-trigger-compact data-analytics-title=\"airpods\" data-analytics-element-engagement=\"hover - airpods\" aria-label=\"AirPods\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-airpods\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 43 44\" width=\"43\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m11.7153 19.6836h.961v.937h.094c.187-.615.914-1.048 1.752-1.048.164 0 .375.011.504.029v1.008c-.082-.024-.446-.059-.645-.059-.961 0-1.658.645-1.658 1.535v3.914h-1.008zm28.135-.111c1.324 0 2.244.656 2.379 1.693h-.996c-.135-.504-.627-.838-1.389-.838-.75 0-1.336.381-1.336.943 0 .434.352.704 1.096.885l.973.235c1.189.287 1.763.802 1.763 1.711 0 1.13-1.095 1.91-2.531 1.91-1.406 0-2.373-.674-2.484-1.723h1.037c.17.533.674.873 1.482.873.85 0 1.459-.404 1.459-.984 0-.434-.328-.727-1.002-.891l-1.084-.264c-1.183-.287-1.722-.796-1.722-1.71 0-1.049 1.013-1.84 2.355-1.84zm-6.665 5.631c-1.155 0-1.846-.885-1.846-2.362 0-1.471.697-2.361 1.846-2.361 1.142 0 1.857.914 1.857 2.361 0 1.459-.709 2.362-1.857 2.362zm1.834-8.028v3.504h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.269 0 1.987 1.037 3.27 2.654 3.27.873 0 1.623-.416 2.022-1.119h.094v1.007h.961v-8.824zm-9.001 8.028c-1.195 0-1.869-.868-1.869-2.362 0-1.5.674-2.361 1.869-2.361 1.196 0 1.869.861 1.869 2.361 0 1.494-.673 2.362-1.869 2.362zm0-5.631c-1.799 0-2.912 1.236-2.912 3.269 0 2.028 1.113 3.27 2.912 3.27s2.912-1.242 2.912-3.27c0-2.033-1.113-3.269-2.912-3.269zm-17.071 6.427h1.008v-6.316h-1.008zm-.199-8.238c0-.387.317-.703.703-.703.387 0 .703.316.703.703s-.316.703-.703.703c-.386 0-.703-.316-.703-.703zm-6.137 4.922 1.324-3.773h.093l1.325 3.773zm1.892-5.139h-1.043l-3.117 8.455h1.107l.85-2.42h3.363l.85 2.42h1.107zm14.868 4.5h-1.864v-3.562h1.864c1.224 0 1.898.639 1.898 1.799 0 1.119-.697 1.763-1.898 1.763zm.275-4.5h-3.193v8.455h1.054v-3.017h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.612-1.107-2.737-2.707-2.737z\"/></svg></span><span class=\"globalnav-link-text\">AirPods</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - tv-home\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-tv-home\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/tv-home/\" data-globalnav-item-name=\"tv-home\" data-topnav-flyout-trigger-compact data-analytics-title=\"tv &amp; home\" data-analytics-element-engagement=\"hover - tv &amp; home\" aria-label=\"TV and Home\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-tv-home\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 65 44\" width=\"65\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m4.3755 26v-7.5059h-2.7246v-.9492h6.5039v.9492h-2.7246v7.5059zm7.7314 0-3.1172-8.4551h1.1074l2.4844 7.0898h.0938l2.4844-7.0898h1.1074l-3.1172 8.4551zm13.981-.8438c-.7207.6328-1.7109 1.002-2.7363 1.002-1.6816 0-2.8594-.9961-2.8594-2.4141 0-1.002.5449-1.7637 1.6758-2.3613.0762-.0352.2344-.1172.3281-.1641-.7793-.8203-1.0605-1.3652-1.0605-1.9805 0-1.084.9199-1.8926 2.1562-1.8926 1.248 0 2.1562.7969 2.1562 1.9043 0 .8672-.5215 1.5-1.8281 2.1855l2.1152 2.2734c.2637-.5273.3984-1.2188.3984-2.2734v-.1465h.9844v.1523c0 1.3125-.2344 2.2676-.6973 2.9824l1.4708 1.5764h-1.3242zm-4.541-1.4824c0 .9492.7676 1.5938 1.8984 1.5938.7676 0 1.5586-.3047 2.0215-.791l-2.3906-2.6133c-.0645.0234-.2168.0996-.2988.1406-.8145.4219-1.2305 1.0078-1.2305 1.6699zm3.2109-4.3886c0-.6562-.4746-1.1016-1.1602-1.1016-.6738 0-1.1543.457-1.1543 1.1133 0 .4688.2402.8789.9082 1.541 1.0313-.5274 1.4063-.9492 1.4063-1.5527zm13.5176 6.7148v-3.8496h-4.6406v3.8496h-1.0547v-8.4551h1.0547v3.6562h4.6406v-3.6562h1.0547v8.4551zm2.6455-3.1582c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7812 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9961h.0938c.2871-.7031.9199-1.1074 1.7637-1.1074.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0078v-4.1309c0-.9316-.4395-1.3887-1.3301-1.3887-.8789 0-1.4648.6562-1.4648 1.459v4.0606h-1.0078v-4.2891c0-.75-.5215-1.2305-1.3184-1.2305-.8262 0-1.4648.7148-1.4648 1.6055v3.9141h-1.0078v-6.3164zm15.5127 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574z\"/></svg></span><span class=\"globalnav-link-text\">TV &amp; Home</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - entertainment\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-entertainment\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/entertainment/\" data-globalnav-item-name=\"entertainment\" data-topnav-flyout-trigger-compact data-analytics-title=\"entertainment\" data-analytics-element-engagement=\"hover - entertainment\" aria-label=\"Entertainment\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-entertainment\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 77 44\" width=\"77\" height=\"44\"><path d=\"m0 17.4863h5.2383v.9492h-4.1836v2.7129h3.9668v.9375h-3.9668v2.9062h4.1836v.9492h-5.2383zm6.8994 2.1387h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2803 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4365-1.4942v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0117.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8046 0-2.8945-1.2656-2.8945-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9375h.0938c.2402-.6621.832-1.0488 1.6875-1.0488.1934 0 .4102.0234.5098.041v.9902c-.2109-.0352-.4043-.0586-.627-.0586-.9727 0-1.6641.6152-1.6641 1.541v3.9141h-1.0195zm4.9658 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4658-.1231v-.0117c0-1.125.832-1.7754 2.3027-1.8633l1.8105-.1113v-.5742c0-.7793-.4746-1.2012-1.418-1.2012-.7559 0-1.2539.2812-1.418.7734l-.0059.0176h-1.0195l.0059-.0352c.1641-.9902 1.125-1.6582 2.4727-1.6582 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-1.0195v-.9316h-.0938c-.3984.6738-1.0605 1.043-1.9102 1.043-1.201 0-2.1092-.7265-2.1092-1.875zm2.3203.9903c1.0371 0 1.793-.6797 1.793-1.582v-.5742l-1.6875.1055c-.9609.0586-1.3828.3984-1.3828 1.0254v.0117c0 .6386.5449 1.0136 1.2773 1.0136zm4.3926-7.4649c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1875 1.9219h1.0195v6.3164h-1.0195zm2.8213 0h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm6.8818 0h1.0195v.9609h.0938c.2812-.6797.8789-1.0723 1.7051-1.0723.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0195v-4.1309c0-.9316-.4277-1.3945-1.3184-1.3945-.8789 0-1.459.6621-1.459 1.4648v4.0605h-1.0195v-4.2891c0-.75-.5156-1.2363-1.3125-1.2363-.8262 0-1.4531.7207-1.4531 1.6113v3.9141h-1.0195v-6.3162zm10.0049 3.1816v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0116.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8047 0-2.8946-1.2656-2.8946-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2802 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3008-.0001-1.8458-.4806-1.8458-1.6876z\"/></svg></span><span class=\"globalnav-link-text\">Entertainment</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - accessories\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-accessories\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://www.apple.com/us/shop/goto/buy_accessories\" data-globalnav-item-name=\"accessories\" data-topnav-flyout-trigger-compact data-analytics-title=\"accessories\" data-analytics-element-engagement=\"hover - accessories\" aria-label=\"Accessories\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-accessories\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 67 44\" width=\"67\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m5.6603 23.5715h-3.3633l-.8496 2.4199h-1.1074l3.1172-8.4551h1.043l3.1172 8.4551h-1.1075zm-3.0527-.8965h2.7422l-1.3242-3.7734h-.0938zm10.0986-1.0664c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm6.5947 0c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm7.5796 2.748c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.212-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm6.0439 0c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm3.6357 3.2695c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7813 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9375h.0938c.1875-.6152.9141-1.0488 1.752-1.0488.1641 0 .375.0117.5039.0293v1.0078c-.082-.0234-.4453-.0586-.6445-.0586-.9609 0-1.6582.6445-1.6582 1.5352v3.9141h-1.0078v-6.3165zm4.2744-1.9219c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1992 1.9219h1.0078v6.3164h-1.0078zm8.001 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.2119-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399z\"/></svg></span><span class=\"globalnav-link-text\">Accessories</span></span></a></li></ul></div><div data-analytics-element-engagement=\"globalnav hover - support\" class=\"\n\t\t\t\tglobalnav-item\n\t\t\t\tglobalnav-item-support\n\t\t\t\tglobalnav-item-menu\n\t\t\t\t\n\t\t\t\"><ul class=\"globalnav-submenu-trigger-group\" role=\"none\"><li class=\"globalnav-submenu-trigger-item\"><a href=\"https://support.apple.com\" data-globalnav-item-name=\"support\" data-topnav-flyout-trigger-compact data-analytics-title=\"support\" data-analytics-element-engagement=\"hover - support\" aria-label=\"Support\" class=\"globalnav-link globalnav-submenu-trigger-link globalnav-link-support\"><span class=\"globalnav-link-text-container\"><span class=\"globalnav-image-regular globalnav-link-image\"><svg height=\"44\" viewbox=\"0 0 44 44\" width=\"44\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m42.1206 18.0337v1.635h1.406v.844h-1.406v3.574c0 .744.281 1.06.937 1.06.182 0 .282-.006.469-.023v.849c-.199.036-.392.059-.592.059-1.3 0-1.822-.48-1.822-1.687v-3.832h-1.019v-.844h1.019v-1.635zm-6.131 1.635h.961v.937h.093c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.008c-.082-.024-.445-.059-.644-.059-.961 0-1.659.644-1.659 1.535v3.914h-1.007zm-2.463 3.158c0-1.5-.674-2.361-1.869-2.361s-1.869.861-1.869 2.361c0 1.494.674 2.361 1.869 2.361s1.869-.867 1.869-2.361zm-4.781 0c0-2.033 1.113-3.27 2.912-3.27s2.912 1.237 2.912 3.27c0 2.027-1.113 3.27-2.912 3.27s-2.912-1.243-2.912-3.27zm-2.108 0c0-1.477-.692-2.361-1.846-2.361-1.143 0-1.863.908-1.863 2.361 0 1.447.72 2.361 1.857 2.361 1.16 0 1.852-.884 1.852-2.361zm1.043 0c0 1.975-1.049 3.27-2.655 3.27-.902 0-1.629-.393-1.974-1.061h-.094v3.059h-1.008v-8.426h.961v1.054h.094c.404-.726 1.16-1.166 2.021-1.166 1.612 0 2.655 1.284 2.655 3.27zm-8.048 0c0-1.477-.691-2.361-1.845-2.361-1.143 0-1.864.908-1.864 2.361 0 1.447.721 2.361 1.858 2.361 1.16 0 1.851-.884 1.851-2.361zm1.043 0c0 1.975-1.049 3.27-2.654 3.27-.902 0-1.629-.393-1.975-1.061h-.093v3.059h-1.008v-8.426h.961v1.054h.093c.405-.726 1.161-1.166 2.022-1.166 1.611 0 2.654 1.284 2.654 3.27zm-7.645 3.158h-.961v-.99h-.094c-.316.703-.99 1.102-1.957 1.102-1.418 0-2.156-.844-2.156-2.338v-4.09h1.008v3.844c0 1.136.422 1.664 1.43 1.664 1.113 0 1.722-.663 1.722-1.77v-3.738h1.008zm-11.69-2.209c.129.885.972 1.447 2.174 1.447 1.136 0 1.974-.615 1.974-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.529-.386-2.192-1.078-2.192-2.279 0-1.435 1.202-2.408 2.989-2.408 1.634 0 2.853.973 2.941 2.338h-1.06c-.147-.867-.862-1.383-1.916-1.383-1.125 0-1.87.562-1.87 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.44 2.455 1.119 2.455 2.361 0 1.553-1.224 2.543-3.158 2.543-1.793 0-3.029-.949-3.141-2.408z\"/></svg></span><span class=\"globalnav-link-text\">Support</span></span></a></li></ul></div></div></div></li><li class=\"globalnav-item globalnav-search\" data-topnav-flyout-label=\"Search apple.com\" data-analytics-click=\"prop3:open - search field\" data-analytics-title=\"open - search field\"><a role=\"button\" id=\"globalnav-menubutton-link-search\" class=\"globalnav-link globalnav-link-search\" href=\"https://www.apple.com/us/search\" data-topnav-flyout-trigger-regular data-topnav-flyout-trigger-compact aria-label=\"Search apple.com\" data-analytics-click=\"prop3:open - search field\" data-analytics-title=\"open - search field\"><span class=\"globalnav-image-regular\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"15px\" height=\"44px\" viewbox=\"0 0 15 44\">\n<path d=\"M14.298,27.202l-3.87-3.87c0.701-0.929,1.122-2.081,1.122-3.332c0-3.06-2.489-5.55-5.55-5.55c-3.06,0-5.55,2.49-5.55,5.55 c0,3.061,2.49,5.55,5.55,5.55c1.251,0,2.403-0.421,3.332-1.122l3.87,3.87c0.151,0.151,0.35,0.228,0.548,0.228 s0.396-0.076,0.548-0.228C14.601,27.995,14.601,27.505,14.298,27.202z M1.55,20c0-2.454,1.997-4.45,4.45-4.45 c2.454,0,4.45,1.997,4.45,4.45S8.454,24.45,6,24.45C3.546,24.45,1.55,22.454,1.55,20z\"/>\n</svg>\n</span><span class=\"globalnav-image-compact\"><svg height=\"48\" viewbox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m16.2294 29.9556-4.1755-4.0821a6.4711 6.4711 0 1 0 -1.2839 1.2625l4.2005 4.1066a.9.9 0 1 0 1.2588-1.287zm-14.5294-8.0017a5.2455 5.2455 0 1 1 5.2455 5.2527 5.2549 5.2549 0 0 1 -5.2455-5.2527z\"/></svg></span></a><div id=\"globalnav-submenu-search\" class=\"globalnav-flyout globalnav-submenu\" aria-labelledby=\"globalnav-menubutton-link-search\"><div class=\"globalnav-flyout-scroll-container\"><div class=\"globalnav-flyout-content globalnav-submenu-content\"><form class=\"globalnav-searchfield\" action=\"https://www.apple.com/us/search\" method=\"get\"><div class=\"globalnav-searchfield-wrapper\"><input class=\"globalnav-searchfield-input\" placeholder=\"Search apple.com\" aria-label=\"Search apple.com\" autocorrect=\"off\" autocapitalize=\"off\" autocomplete=\"off\"><input id=\"globalnav-searchfield-src\" type=\"hidden\" name=\"src\" value><input type=\"hidden\" name=\"type\" value><input type=\"hidden\" name=\"page\" value><input type=\"hidden\" name=\"locale\" value><button class=\"globalnav-searchfield-reset\" aria-label=\"Clear search\" tabindex=\"-1\" type=\"button\"><span class=\"globalnav-image-regular\"><svg height=\"14\" viewbox=\"0 0 14 14\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m7 .0339a6.9661 6.9661 0 1 0 6.9661 6.9661 6.9661 6.9661 0 0 0 -6.9661-6.9661zm2.798 8.9867a.55.55 0 0 1 -.778.7774l-2.02-2.02-2.02 2.02a.55.55 0 0 1 -.7784-.7774l2.0206-2.0206-2.0204-2.02a.55.55 0 0 1 .7782-.7778l2.02 2.02 2.02-2.02a.55.55 0 0 1 .778.7778l-2.0203 2.02z\"/></svg></span><span class=\"globalnav-image-compact\"><svg height=\"16\" viewbox=\"0 0 16 16\" width=\"16\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m0 8a8.0474 8.0474 0 0 1 7.9922-8 8.0609 8.0609 0 0 1 8.0078 8 8.0541 8.0541 0 0 1 -8 8 8.0541 8.0541 0 0 1 -8-8zm5.6549 3.2863 2.3373-2.353 2.3451 2.353a.6935.6935 0 0 0 .4627.1961.6662.6662 0 0 0 .6667-.6667.6777.6777 0 0 0 -.1961-.4706l-2.3451-2.3373 2.3529-2.3607a.5943.5943 0 0 0 .1961-.4549.66.66 0 0 0 -.6667-.6589.6142.6142 0 0 0 -.447.1961l-2.3686 2.3606-2.353-2.3527a.6152.6152 0 0 0 -.447-.1883.6529.6529 0 0 0 -.6667.651.6264.6264 0 0 0 .1961.4549l2.3451 2.3529-2.3451 2.353a.61.61 0 0 0 -.1961.4549.6661.6661 0 0 0 .6667.6667.6589.6589 0 0 0 .4627-.1961z\"/></svg></span></button><button class=\"globalnav-searchfield-submit\" aria-label=\"Submit search\" tabindex=\"-1\" aria-hidden=\"true\" type=\"submit\"><span class=\"globalnav-image-regular\"><svg height=\"32\" viewbox=\"0 0 30 32\" width=\"30\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m23.3291 23.3066-4.35-4.35c-.0105-.0105-.0247-.0136-.0355-.0235a6.8714 6.8714 0 1 0 -1.5736 1.4969c.0214.0256.03.0575.0542.0815l4.35 4.35a1.1 1.1 0 1 0 1.5557-1.5547zm-15.4507-8.582a5.6031 5.6031 0 1 1 5.603 5.61 5.613 5.613 0 0 1 -5.603-5.61z\"/></svg></span><span class=\"globalnav-image-compact\"><svg width=\"38\" height=\"40\" viewbox=\"0 0 38 40\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m28.6724 27.8633-5.07-5.07c-.0095-.0095-.0224-.0122-.032-.0213a7.9967 7.9967 0 1 0 -1.8711 1.7625c.0254.03.0357.0681.0642.0967l5.07 5.07a1.3 1.3 0 0 0 1.8389-1.8379zm-18.0035-10.0033a6.5447 6.5447 0 1 1 6.545 6.5449 6.5518 6.5518 0 0 1 -6.545-6.5449z\"/></svg></span></button></div><div class=\"globalnav-searchresults-count\" role=\"status\" aria-live=\"polite\" data-topnav-searchresults-label=\"total results\"></div></form><div class=\"globalnav-searchresults\"></div></div></div></div></li><li class=\"globalnav-item globalnav-bag\" id=\"globalnav-bag\" data-analytics-region=\"bag\"><div class=\"globalnav-bag-wrapper\"><a id=\"globalnav-menubutton-link-bag\" href=\"https://www.apple.com/us/shop/goto/us/shop/goto/bag\" aria-label=\"Shopping Bag\" data-globalnav-item-name=\"bag\" data-topnav-flyout-trigger-regular data-topnav-flyout-trigger-compact class=\"globalnav-link globalnav-link-bag\"><span class=\"globalnav-image-regular\"><svg height=\"44\" viewbox=\"0 0 14 44\" width=\"14\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m11.3535 16.0283h-1.0205a3.4229 3.4229 0 0 0 -3.333-2.9648 3.4229 3.4229 0 0 0 -3.333 2.9648h-1.02a2.1184 2.1184 0 0 0 -2.117 2.1162v7.7155a2.1186 2.1186 0 0 0 2.1162 2.1167h8.707a2.1186 2.1186 0 0 0 2.1168-2.1167v-7.7155a2.1184 2.1184 0 0 0 -2.1165-2.1162zm-4.3535-1.8652a2.3169 2.3169 0 0 1 2.2222 1.8652h-4.4444a2.3169 2.3169 0 0 1 2.2222-1.8652zm5.37 11.6969a1.0182 1.0182 0 0 1 -1.0166 1.0171h-8.7069a1.0182 1.0182 0 0 1 -1.0165-1.0171v-7.7155a1.0178 1.0178 0 0 1 1.0166-1.0166h8.707a1.0178 1.0178 0 0 1 1.0164 1.0166z\"/></svg></span><span class=\"globalnav-image-compact\"><svg height=\"48\" viewbox=\"0 0 17 48\" width=\"17\" xmlns=\"http://www.w3.org/2000/svg\"><path d=\"m13.4575 16.9268h-1.1353a3.8394 3.8394 0 0 0 -7.6444 0h-1.1353a2.6032 2.6032 0 0 0 -2.6 2.6v8.9232a2.6032 2.6032 0 0 0 2.6 2.6h9.915a2.6032 2.6032 0 0 0 2.6-2.6v-8.9231a2.6032 2.6032 0 0 0 -2.6-2.6001zm-4.9575-2.2768a2.658 2.658 0 0 1 2.6221 2.2764h-5.2442a2.658 2.658 0 0 1 2.6221-2.2764zm6.3574 13.8a1.4014 1.4014 0 0 1 -1.4 1.4h-9.9149a1.4014 1.4014 0 0 1 -1.4-1.4v-8.9231a1.4014 1.4014 0 0 1 1.4-1.4h9.915a1.4014 1.4014 0 0 1 1.4 1.4z\"/></svg></span></a><span class=\"globalnav-bag-badge\" aria-hidden=\"true\" data-analytics-click=\"prop3:open - bag\" data-analytics-title=\"open - bag\"><span class=\"globalnav-bag-badge-separator\"></span><span class=\"globalnav-bag-badge-number\">0</span><span class=\"globalnav-bag-badge-unit\">+</span></span></div><div id=\"globalnav-submenu-bag\" class=\"globalnav-flyout globalnav-submenu\" aria-labelledby=\"globalnav-menubutton-link-bag\"><div class=\"globalnav-flyout-scroll-container\"><div class=\"globalnav-flyout-content globalnav-submenu-content\"></div></div></div></li></ul><div class=\"globalnav-menutrigger\"><button id=\"globalnav-menutrigger-button\" class=\"globalnav-menutrigger-button\" aria-controls=\"globalnav-list\" aria-label=\"Menu\" data-topnav-menu-label-open=\"Menu\" data-topnav-menu-label-close=\"Close\" data-topnav-flyout-trigger-compact=\"menu\"><svg width=\"18\" height=\"18\" viewbox=\"0 0 18 18\"><polyline id=\"globalnav-menutrigger-bread-bottom\" class=\"globalnav-menutrigger-bread globalnav-menutrigger-bread-bottom\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" points=\"2 12, 16 12\"><animate id=\"globalnav-anim-menutrigger-bread-bottom-open\" attributename=\"points\" keytimes=\"0;0.5;1\" dur=\"0.24s\" begin=\"indefinite\" fill=\"freeze\" calcmode=\"spline\" keysplines=\"0.42, 0, 1, 1;0, 0, 0.58, 1\" values=\" 2 12, 16 12; 2 9, 16 9; 3.5 15, 15 3.5\"/><animate id=\"globalnav-anim-menutrigger-bread-bottom-close\" attributename=\"points\" keytimes=\"0;0.5;1\" dur=\"0.24s\" begin=\"indefinite\" fill=\"freeze\" calcmode=\"spline\" keysplines=\"0.42, 0, 1, 1;0, 0, 0.58, 1\" values=\" 3.5 15, 15 3.5; 2 9, 16 9; 2 12, 16 12\"/></polyline><polyline id=\"globalnav-menutrigger-bread-top\" class=\"globalnav-menutrigger-bread globalnav-menutrigger-bread-top\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"1.2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" points=\"2 5, 16 5\"><animate id=\"globalnav-anim-menutrigger-bread-top-open\" attributename=\"points\" keytimes=\"0;0.5;1\" dur=\"0.24s\" begin=\"indefinite\" fill=\"freeze\" calcmode=\"spline\" keysplines=\"0.42, 0, 1, 1;0, 0, 0.58, 1\" values=\" 2 5, 16 5; 2 9, 16 9; 3.5 3.5, 15 15\"/><animate id=\"globalnav-anim-menutrigger-bread-top-close\" attributename=\"points\" keytimes=\"0;0.5;1\" dur=\"0.24s\" begin=\"indefinite\" fill=\"freeze\" calcmode=\"spline\" keysplines=\"0.42, 0, 1, 1;0, 0, 0.58, 1\" values=\" 3.5 3.5, 15 15; 2 9, 16 9; 2 5, 16 5\"/></polyline></svg></button></div></div></nav><div id=\"globalnav-curtain\" class=\"globalnav-curtain\"></div><div id=\"globalnav-placeholder\" class=\"globalnav-placeholder\"></div></div><script id=\"__ACGH_DATA__\" type=\"application/json\">{\"props\":{\"globalNavData\":{\"locale\":\"en_US\",\"ariaLabel\":\"Global\",\"analyticsAttributes\":[{\"name\":\"data-analytics-activitymap-region-id\",\"value\":\"global nav\"},{\"name\":\"data-analytics-region\",\"value\":\"global nav\"}],\"links\":[{\"id\":\"59b4351546141487025bfcb9d7b90294\",\"name\":\"apple\",\"text\":\"Apple\",\"url\":\"/\",\"ariaLabel\":\"Apple\",\"submenuAriaLabel\":\"Apple menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 14 44\\\" width=\\\"14\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m13.0729 17.6825a3.61 3.61 0 0 0 -1.7248 3.0365 3.5132 3.5132 0 0 0 2.1379 3.2223 8.394 8.394 0 0 1 -1.0948 2.2618c-.6816.9812-1.3943 1.9623-2.4787 1.9623s-1.3633-.63-2.613-.63c-1.2187 0-1.6525.6507-2.644.6507s-1.6834-.9089-2.4787-2.0243a9.7842 9.7842 0 0 1 -1.6628-5.2776c0-3.0984 2.014-4.7405 3.9969-4.7405 1.0535 0 1.9314.6919 2.5924.6919.63 0 1.6112-.7333 2.8092-.7333a3.7579 3.7579 0 0 1 3.1604 1.5802zm-3.7284-2.8918a3.5615 3.5615 0 0 0 .8469-2.22 1.5353 1.5353 0 0 0 -.031-.32 3.5686 3.5686 0 0 0 -2.3445 1.2084 3.4629 3.4629 0 0 0 -.8779 2.1585 1.419 1.419 0 0 0 .031.2892 1.19 1.19 0 0 0 .2169.0207 3.0935 3.0935 0 0 0 2.1586-1.1368z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"48\\\" viewBox=\\\"0 0 17 48\\\" width=\\\"17\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m15.5752 19.0792a4.2055 4.2055 0 0 0 -2.01 3.5376 4.0931 4.0931 0 0 0 2.4908 3.7542 9.7779 9.7779 0 0 1 -1.2755 2.6351c-.7941 1.1431-1.6244 2.2862-2.8878 2.2862s-1.5883-.734-3.0443-.734c-1.42 0-1.9252.7581-3.08.7581s-1.9611-1.0589-2.8876-2.3584a11.3987 11.3987 0 0 1 -1.9373-6.1487c0-3.61 2.3464-5.523 4.6566-5.523 1.2274 0 2.25.8062 3.02.8062.734 0 1.8771-.8543 3.2729-.8543a4.3778 4.3778 0 0 1 3.6822 1.841zm-6.8586-2.0456a1.3865 1.3865 0 0 1 -.2527-.024 1.6557 1.6557 0 0 1 -.0361-.337 4.0341 4.0341 0 0 1 1.0228-2.5148 4.1571 4.1571 0 0 1 2.7314-1.4078 1.7815 1.7815 0 0 1 .0361.373 4.1487 4.1487 0 0 1 -.9867 2.587 3.6039 3.6039 0 0 1 -2.5148 1.3236z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"apple home\"}]},{\"id\":\"874ad6917126f66fc38696e33990e6c1\",\"name\":\"store\",\"text\":\"Store\",\"url\":\"/us/shop/goto/store\",\"ariaLabel\":\"Store\",\"submenuAriaLabel\":\"Store menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 30 44\\\" width=\\\"30\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m26.5679 20.4629c1.002 0 1.67.738 1.693 1.857h-3.48c.076-1.119.779-1.857 1.787-1.857zm2.754 2.672v-.387c0-1.963-1.037-3.176-2.742-3.176-1.735 0-2.848 1.289-2.848 3.276 0 1.998 1.096 3.263 2.848 3.263 1.383 0 2.367-.668 2.66-1.746h-1.008c-.264.557-.814.856-1.629.856-1.072 0-1.769-.791-1.822-2.039v-.047zm-9.547-3.451h.96v.937h.094c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.007c-.082-.023-.445-.058-.644-.058-.961 0-1.659 1.098-1.659 1.535v3.914h-1.007zm-4.27 5.519c-1.195 0-1.869-.867-1.869-2.361 0-1.5.674-2.361 1.869-2.361 1.196 0 1.87.861 1.87 2.361 0 1.494-.674 2.361-1.87 2.361zm0-5.631c-1.798 0-2.912 1.237-2.912 3.27 0 2.027 1.114 3.269 2.912 3.269 1.799 0 2.913-1.242 2.913-3.269 0-2.033-1.114-3.27-2.913-3.27zm-5.478-1.475v1.635h1.407v.843h-1.407v3.575c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.849c-.199.035-.393.059-.592.059-1.301 0-1.822-.481-1.822-1.688v-3.832h-1.02v-.843h1.02v-1.635zm-8.103 5.694c.129.885.973 1.447 2.174 1.447 1.137 0 1.975-.615 1.975-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.53-.386-2.192-1.078-2.192-2.279 0-1.436 1.201-2.408 2.988-2.408 1.635 0 2.854.972 2.942 2.338h-1.061c-.146-.867-.861-1.383-1.916-1.383-1.125 0-1.869.562-1.869 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.439 2.455 1.119 2.455 2.361 0 1.553-1.225 2.543-3.158 2.543-1.793 0-3.03-.949-3.141-2.408z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"store\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - store\"}]},{\"id\":\"b2d6a1c799a7b49f9f5fe230ac699a8f\",\"name\":\"mac\",\"text\":\"Mac\",\"url\":\"/mac/\",\"ariaLabel\":\"Mac\",\"submenuAriaLabel\":\"Mac menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 23 44\\\" width=\\\"23\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m8.1558 25.9987v-6.457h-.0703l-2.666 6.457h-.8907l-2.666-6.457h-.0703v6.457h-.9844v-8.4551h1.2246l2.8945 7.0547h.0938l2.8945-7.0547h1.2246v8.4551zm2.5166-1.7696c0-1.1309.832-1.7812 2.3027-1.8691l1.8223-.1113v-.5742c0-.7793-.4863-1.207-1.4297-1.207-.7559 0-1.2832.2871-1.4238.7852h-1.0195c.1348-1.0137 1.1309-1.6816 2.4785-1.6816 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-.9609v-.9318h-.0938c-.4102.6738-1.1016 1.043-1.9453 1.043-1.2246 0-2.1328-.7266-2.1328-1.8809zm4.125-.5859v-.5801l-1.6992.1113c-.9609.0645-1.3828.3984-1.3828 1.0312 0 .6445.5449 1.0195 1.2773 1.0195 1.0371.0001 1.8047-.6796 1.8047-1.5819zm6.958-2.0273c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"mac\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - mac\"}]},{\"id\":\"6957d8f93e9c0a58b009ef38e424799f\",\"name\":\"ipad\",\"text\":\"iPad\",\"url\":\"/ipad/\",\"ariaLabel\":\"iPad\",\"submenuAriaLabel\":\"iPad menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 24 44\\\" width=\\\"24\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m14.9575 23.7002c0 .902-.768 1.582-1.805 1.582-.732 0-1.277-.375-1.277-1.02 0-.632.422-.966 1.383-1.031l1.699-.111zm-1.395-4.072c-1.347 0-2.343.668-2.478 1.681h1.019c.141-.498.668-.785 1.424-.785.944 0 1.43.428 1.43 1.207v.574l-1.822.112c-1.471.088-2.303.738-2.303 1.869 0 1.154.908 1.881 2.133 1.881.844 0 1.535-.369 1.945-1.043h.094v.931h.961v-4.324c0-1.312-.862-2.103-2.403-2.103zm6.769 5.575c-1.155 0-1.846-.885-1.846-2.361 0-1.471.697-2.362 1.846-2.362 1.142 0 1.857.914 1.857 2.362 0 1.459-.709 2.361-1.857 2.361zm1.834-8.027v3.503h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.27 0 1.986 1.037 3.269 2.654 3.269.873 0 1.623-.416 2.022-1.119h.093v1.008h.961v-8.824zm-15.394 4.869h-1.863v-3.563h1.863c1.225 0 1.899.639 1.899 1.799 0 1.119-.697 1.764-1.899 1.764zm.276-4.5h-3.194v8.455h1.055v-3.018h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.611-1.108-2.736-2.707-2.736zm-6.064 8.454h1.008v-6.316h-1.008zm-.199-8.237c0-.387.316-.704.703-.704s.703.317.703.704c0 .386-.316.703-.703.703s-.703-.317-.703-.703z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"ipad\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - ipad\"}]},{\"id\":\"a60c590d864697640299a82eeee56ee8\",\"name\":\"iphone\",\"text\":\"iPhone\",\"url\":\"/iphone/\",\"ariaLabel\":\"iPhone\",\"submenuAriaLabel\":\"iPhone menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 38 44\\\" width=\\\"38\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m32.7129 22.3203h3.48c-.023-1.119-.691-1.857-1.693-1.857-1.008 0-1.711.738-1.787 1.857zm4.459 2.045c-.293 1.078-1.277 1.746-2.66 1.746-1.752 0-2.848-1.266-2.848-3.264 0-1.986 1.113-3.275 2.848-3.275 1.705 0 2.742 1.213 2.742 3.176v.386h-4.541v.047c.053 1.248.75 2.039 1.822 2.039.815 0 1.366-.298 1.629-.855zm-12.282-4.682h.961v.996h.094c.316-.697.932-1.107 1.898-1.107 1.418 0 2.209.838 2.209 2.338v4.09h-1.007v-3.844c0-1.137-.481-1.676-1.489-1.676s-1.658.674-1.658 1.781v3.739h-1.008zm-2.499 3.158c0-1.5-.674-2.361-1.869-2.361-1.196 0-1.87.861-1.87 2.361 0 1.495.674 2.362 1.87 2.362 1.195 0 1.869-.867 1.869-2.362zm-4.782 0c0-2.033 1.114-3.269 2.913-3.269 1.798 0 2.912 1.236 2.912 3.269 0 2.028-1.114 3.27-2.912 3.27-1.799 0-2.913-1.242-2.913-3.27zm-6.636-5.666h1.008v3.504h.093c.317-.697.979-1.107 1.946-1.107 1.336 0 2.179.855 2.179 2.338v4.09h-1.007v-3.844c0-1.119-.504-1.676-1.459-1.676-1.131 0-1.752.715-1.752 1.781v3.739h-1.008zm-6.015 4.87h1.863c1.202 0 1.899-.645 1.899-1.764 0-1.16-.674-1.799-1.899-1.799h-1.863zm2.139-4.5c1.599 0 2.707 1.125 2.707 2.736 0 1.582-1.131 2.701-2.719 2.701h-2.127v3.018h-1.055v-8.455zm-6.114 8.454h1.008v-6.316h-1.008zm-.2-8.238c0-.386.317-.703.703-.703.387 0 .704.317.704.703 0 .387-.317.704-.704.704-.386 0-.703-.317-.703-.704z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"iphone\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - iphone\"}]},{\"id\":\"b1aa21cc187dd822b4d144a89ef6684b\",\"name\":\"watch\",\"text\":\"Watch\",\"url\":\"/watch/\",\"ariaLabel\":\"Watch\",\"submenuAriaLabel\":\"Watch menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 35 44\\\" width=\\\"35\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m28.9819 17.1758h1.008v3.504h.094c.316-.697.978-1.108 1.945-1.108 1.336 0 2.18.856 2.18 2.338v4.09h-1.008v-3.844c0-1.119-.504-1.675-1.459-1.675-1.131 0-1.752.715-1.752 1.781v3.738h-1.008zm-2.42 4.441c-.164-.627-.721-1.136-1.629-1.136-1.137 0-1.852.908-1.852 2.338 0 1.459.727 2.384 1.852 2.384.849 0 1.441-.392 1.629-1.107h1.019c-.182 1.16-1.125 2.016-2.642 2.016-1.77 0-2.901-1.284-2.901-3.293 0-1.969 1.125-3.247 2.895-3.247 1.535 0 2.472.92 2.648 2.045zm-6.533-3.568v1.635h1.407v.844h-1.407v3.574c0 .744.282 1.06.938 1.06.182 0 .281-.006.469-.023v.85c-.2.035-.393.058-.592.058-1.301 0-1.822-.48-1.822-1.687v-3.832h-1.02v-.844h1.02v-1.635zm-4.2 5.596v-.58l-1.699.111c-.961.064-1.383.398-1.383 1.031 0 .645.545 1.02 1.277 1.02 1.038 0 1.805-.68 1.805-1.582zm-4.125.586c0-1.131.832-1.782 2.303-1.869l1.822-.112v-.574c0-.779-.486-1.207-1.43-1.207-.755 0-1.283.287-1.423.785h-1.02c.135-1.014 1.131-1.682 2.479-1.682 1.541 0 2.402.792 2.402 2.104v4.324h-.961v-.931h-.094c-.41.673-1.101 1.043-1.945 1.043-1.225 0-2.133-.727-2.133-1.881zm-7.684 1.769h-.996l-2.303-8.455h1.101l1.682 6.873h.07l1.893-6.873h1.066l1.893 6.873h.07l1.682-6.873h1.101l-2.302 8.455h-.996l-1.946-6.674h-.07z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"watch\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - watch\"}]},{\"id\":\"f116d56d9c2e85d7505aef40e343ad39\",\"name\":\"airpods\",\"text\":\"AirPods\",\"url\":\"/airpods/\",\"ariaLabel\":\"AirPods\",\"submenuAriaLabel\":\"AirPods menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 43 44\\\" width=\\\"43\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m11.7153 19.6836h.961v.937h.094c.187-.615.914-1.048 1.752-1.048.164 0 .375.011.504.029v1.008c-.082-.024-.446-.059-.645-.059-.961 0-1.658.645-1.658 1.535v3.914h-1.008zm28.135-.111c1.324 0 2.244.656 2.379 1.693h-.996c-.135-.504-.627-.838-1.389-.838-.75 0-1.336.381-1.336.943 0 .434.352.704 1.096.885l.973.235c1.189.287 1.763.802 1.763 1.711 0 1.13-1.095 1.91-2.531 1.91-1.406 0-2.373-.674-2.484-1.723h1.037c.17.533.674.873 1.482.873.85 0 1.459-.404 1.459-.984 0-.434-.328-.727-1.002-.891l-1.084-.264c-1.183-.287-1.722-.796-1.722-1.71 0-1.049 1.013-1.84 2.355-1.84zm-6.665 5.631c-1.155 0-1.846-.885-1.846-2.362 0-1.471.697-2.361 1.846-2.361 1.142 0 1.857.914 1.857 2.361 0 1.459-.709 2.362-1.857 2.362zm1.834-8.028v3.504h-.088c-.358-.691-1.102-1.107-1.981-1.107-1.605 0-2.654 1.289-2.654 3.269 0 1.987 1.037 3.27 2.654 3.27.873 0 1.623-.416 2.022-1.119h.094v1.007h.961v-8.824zm-9.001 8.028c-1.195 0-1.869-.868-1.869-2.362 0-1.5.674-2.361 1.869-2.361 1.196 0 1.869.861 1.869 2.361 0 1.494-.673 2.362-1.869 2.362zm0-5.631c-1.799 0-2.912 1.236-2.912 3.269 0 2.028 1.113 3.27 2.912 3.27s2.912-1.242 2.912-3.27c0-2.033-1.113-3.269-2.912-3.269zm-17.071 6.427h1.008v-6.316h-1.008zm-.199-8.238c0-.387.317-.703.703-.703.387 0 .703.316.703.703s-.316.703-.703.703c-.386 0-.703-.316-.703-.703zm-6.137 4.922 1.324-3.773h.093l1.325 3.773zm1.892-5.139h-1.043l-3.117 8.455h1.107l.85-2.42h3.363l.85 2.42h1.107zm14.868 4.5h-1.864v-3.562h1.864c1.224 0 1.898.639 1.898 1.799 0 1.119-.697 1.763-1.898 1.763zm.275-4.5h-3.193v8.455h1.054v-3.017h2.127c1.588 0 2.719-1.119 2.719-2.701 0-1.612-1.107-2.737-2.707-2.737z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"airpods\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - airpods\"}]},{\"id\":\"09e006337331ac3de699392a70ac2d9d\",\"name\":\"tv-home\",\"text\":\"TV & Home\",\"url\":\"/tv-home/\",\"ariaLabel\":\"TV and Home\",\"submenuAriaLabel\":\"TV and Home menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 65 44\\\" width=\\\"65\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m4.3755 26v-7.5059h-2.7246v-.9492h6.5039v.9492h-2.7246v7.5059zm7.7314 0-3.1172-8.4551h1.1074l2.4844 7.0898h.0938l2.4844-7.0898h1.1074l-3.1172 8.4551zm13.981-.8438c-.7207.6328-1.7109 1.002-2.7363 1.002-1.6816 0-2.8594-.9961-2.8594-2.4141 0-1.002.5449-1.7637 1.6758-2.3613.0762-.0352.2344-.1172.3281-.1641-.7793-.8203-1.0605-1.3652-1.0605-1.9805 0-1.084.9199-1.8926 2.1562-1.8926 1.248 0 2.1562.7969 2.1562 1.9043 0 .8672-.5215 1.5-1.8281 2.1855l2.1152 2.2734c.2637-.5273.3984-1.2188.3984-2.2734v-.1465h.9844v.1523c0 1.3125-.2344 2.2676-.6973 2.9824l1.4708 1.5764h-1.3242zm-4.541-1.4824c0 .9492.7676 1.5938 1.8984 1.5938.7676 0 1.5586-.3047 2.0215-.791l-2.3906-2.6133c-.0645.0234-.2168.0996-.2988.1406-.8145.4219-1.2305 1.0078-1.2305 1.6699zm3.2109-4.3886c0-.6562-.4746-1.1016-1.1602-1.1016-.6738 0-1.1543.457-1.1543 1.1133 0 .4688.2402.8789.9082 1.541 1.0313-.5274 1.4063-.9492 1.4063-1.5527zm13.5176 6.7148v-3.8496h-4.6406v3.8496h-1.0547v-8.4551h1.0547v3.6562h4.6406v-3.6562h1.0547v8.4551zm2.6455-3.1582c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7812 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9961h.0938c.2871-.7031.9199-1.1074 1.7637-1.1074.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0078v-4.1309c0-.9316-.4395-1.3887-1.3301-1.3887-.8789 0-1.4648.6562-1.4648 1.459v4.0606h-1.0078v-4.2891c0-.75-.5215-1.2305-1.3184-1.2305-.8262 0-1.4648.7148-1.4648 1.6055v3.9141h-1.0078v-6.3164zm15.5127 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"tv & home\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - tv & home\"}]},{\"id\":\"0360e437e2a94e504829fb4fb384af83\",\"name\":\"entertainment\",\"text\":\"Entertainment\",\"url\":\"/entertainment/\",\"ariaLabel\":\"Entertainment\",\"submenuAriaLabel\":\"Entertainment menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg xmlns=\\\"http://www.w3.org/2000/svg\\\" viewBox=\\\"0 0 77 44\\\" width=\\\"77\\\" height=\\\"44\\\"><path d=\\\"m0 17.4863h5.2383v.9492h-4.1836v2.7129h3.9668v.9375h-3.9668v2.9062h4.1836v.9492h-5.2383zm6.8994 2.1387h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2803 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4365-1.4942v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0117.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8046 0-2.8945-1.2656-2.8945-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9375h.0938c.2402-.6621.832-1.0488 1.6875-1.0488.1934 0 .4102.0234.5098.041v.9902c-.2109-.0352-.4043-.0586-.627-.0586-.9727 0-1.6641.6152-1.6641 1.541v3.9141h-1.0195zm4.9658 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3009-.0001-1.8458-.4806-1.8458-1.6876zm3.4658-.1231v-.0117c0-1.125.832-1.7754 2.3027-1.8633l1.8105-.1113v-.5742c0-.7793-.4746-1.2012-1.418-1.2012-.7559 0-1.2539.2812-1.418.7734l-.0059.0176h-1.0195l.0059-.0352c.1641-.9902 1.125-1.6582 2.4727-1.6582 1.541 0 2.4023.791 2.4023 2.1035v4.3242h-1.0195v-.9316h-.0938c-.3984.6738-1.0605 1.043-1.9102 1.043-1.201 0-2.1092-.7265-2.1092-1.875zm2.3203.9903c1.0371 0 1.793-.6797 1.793-1.582v-.5742l-1.6875.1055c-.9609.0586-1.3828.3984-1.3828 1.0254v.0117c0 .6386.5449 1.0136 1.2773 1.0136zm4.3926-7.4649c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1875 1.9219h1.0195v6.3164h-1.0195zm2.8213 0h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm6.8818 0h1.0195v.9609h.0938c.2812-.6797.8789-1.0723 1.7051-1.0723.8555 0 1.4531.4512 1.7461 1.1074h.0938c.3398-.668 1.0605-1.1074 1.9336-1.1074 1.2891 0 2.0098.7383 2.0098 2.0625v4.3652h-1.0195v-4.1309c0-.9316-.4277-1.3945-1.3184-1.3945-.8789 0-1.459.6621-1.459 1.4648v4.0605h-1.0195v-4.2891c0-.75-.5156-1.2363-1.3125-1.2363-.8262 0-1.4531.7207-1.4531 1.6113v3.9141h-1.0195v-6.3162zm10.0049 3.1816v-.0059c0-1.9512 1.1133-3.2871 2.8301-3.2871s2.7598 1.2773 2.7598 3.1641v.3984h-4.5469c.0293 1.3066.75 2.0684 1.875 2.0684.8555 0 1.3828-.4043 1.5527-.7852l.0234-.0527h1.0195l-.0116.0469c-.2168.8555-1.1191 1.6992-2.6074 1.6992-1.8047 0-2.8946-1.2656-2.8946-3.2461zm1.0606-.5449h3.4922c-.1055-1.248-.7969-1.8398-1.7285-1.8398-.9376 0-1.6524.6386-1.7637 1.8398zm5.9912-2.6367h1.0195v.9492h.0938c.3164-.668.9082-1.0605 1.8398-1.0605 1.418 0 2.209.8379 2.209 2.3379v4.0898h-1.0195v-3.8438c0-1.1367-.4688-1.6816-1.4766-1.6816s-1.6465.6797-1.6465 1.7871v3.7383h-1.0195zm7.2802 4.6758v-3.832h-.9961v-.8438h.9961v-1.6348h1.0547v1.6348h1.3828v.8438h-1.3828v3.5742c0 .7441.2578 1.043.9141 1.043.1816 0 .2812-.0059.4688-.0234v.8672c-.1992.0352-.3926.0586-.5918.0586-1.3008-.0001-1.8458-.4806-1.8458-1.6876z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"entertainment\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - entertainment\"}]},{\"id\":\"a76587c5f8c2e279d64ee231b7186002\",\"name\":\"accessories\",\"text\":\"Accessories\",\"url\":\"/us/shop/goto/buy_accessories\",\"ariaLabel\":\"Accessories\",\"submenuAriaLabel\":\"Accessories menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 67 44\\\" width=\\\"67\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m5.6603 23.5715h-3.3633l-.8496 2.4199h-1.1074l3.1172-8.4551h1.043l3.1172 8.4551h-1.1075zm-3.0527-.8965h2.7422l-1.3242-3.7734h-.0938zm10.0986-1.0664c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm6.5947 0c-.1641-.627-.7207-1.1367-1.6289-1.1367-1.1367 0-1.8516.9082-1.8516 2.3379 0 1.459.7266 2.3848 1.8516 2.3848.8496 0 1.4414-.3926 1.6289-1.1074h1.0195c-.1816 1.1602-1.125 2.0156-2.6426 2.0156-1.7695 0-2.9004-1.2832-2.9004-3.293 0-1.9688 1.125-3.2461 2.8945-3.2461 1.5352 0 2.4727.9199 2.6484 2.0449zm7.5796 2.748c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.212-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm6.0439 0c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399zm3.6357 3.2695c0-2.0332 1.1133-3.2695 2.9121-3.2695s2.9121 1.2363 2.9121 3.2695c0 2.0273-1.1133 3.2695-2.9121 3.2695s-2.9121-1.2422-2.9121-3.2695zm4.7813 0c0-1.5-.6738-2.3613-1.8691-2.3613s-1.8691.8613-1.8691 2.3613c0 1.4941.6738 2.3613 1.8691 2.3613s1.8691-.8672 1.8691-2.3613zm2.5054-3.1582h.9609v.9375h.0938c.1875-.6152.9141-1.0488 1.752-1.0488.1641 0 .375.0117.5039.0293v1.0078c-.082-.0234-.4453-.0586-.6445-.0586-.9609 0-1.6582.6445-1.6582 1.5352v3.9141h-1.0078v-6.3165zm4.2744-1.9219c0-.3867.3164-.7031.7031-.7031s.7031.3164.7031.7031-.3164.7031-.7031.7031-.7031-.3164-.7031-.7031zm.1992 1.9219h1.0078v6.3164h-1.0078zm8.001 4.6816c-.293 1.0781-1.2773 1.7461-2.6602 1.7461-1.752 0-2.8477-1.2656-2.8477-3.2637 0-1.9863 1.1133-3.2754 2.8477-3.2754 1.7051 0 2.7422 1.2129 2.7422 3.1758v.3867h-4.541v.0469c.0527 1.248.75 2.0391 1.8223 2.0391.8145 0 1.3652-.2988 1.6289-.8555zm-4.459-2.0449h3.4805c-.0234-1.1191-.6914-1.8574-1.6934-1.8574-1.0078 0-1.7109.7383-1.7871 1.8574zm8.2119-2.748c1.3242 0 2.2441.6562 2.3789 1.6934h-.9961c-.1348-.5039-.627-.8379-1.3887-.8379-.75 0-1.3359.3809-1.3359.9434 0 .4336.3516.7031 1.0957.8848l.9727.2344c1.1895.2871 1.7637.8027 1.7637 1.7109 0 1.1309-1.0957 1.9102-2.5312 1.9102-1.4062 0-2.373-.6738-2.4844-1.7227h1.0371c.1699.5332.6738.873 1.4824.873.8496 0 1.459-.4043 1.459-.9844 0-.4336-.3281-.7266-1.002-.8906l-1.084-.2637c-1.1836-.2871-1.7227-.7969-1.7227-1.7109 0-1.0489 1.0137-1.8399 2.3555-1.8399z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"accessories\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - accessories\"}]},{\"id\":\"5bb7cbb2a4732f7b30dfbb3b38f204a2\",\"name\":\"support\",\"text\":\"Support\",\"url\":\"https://support.apple.com\",\"ariaLabel\":\"Support\",\"submenuAriaLabel\":\"Support menu\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 44 44\\\" width=\\\"44\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m42.1206 18.0337v1.635h1.406v.844h-1.406v3.574c0 .744.281 1.06.937 1.06.182 0 .282-.006.469-.023v.849c-.199.036-.392.059-.592.059-1.3 0-1.822-.48-1.822-1.687v-3.832h-1.019v-.844h1.019v-1.635zm-6.131 1.635h.961v.937h.093c.188-.615.914-1.049 1.752-1.049.164 0 .375.012.504.03v1.008c-.082-.024-.445-.059-.644-.059-.961 0-1.659.644-1.659 1.535v3.914h-1.007zm-2.463 3.158c0-1.5-.674-2.361-1.869-2.361s-1.869.861-1.869 2.361c0 1.494.674 2.361 1.869 2.361s1.869-.867 1.869-2.361zm-4.781 0c0-2.033 1.113-3.27 2.912-3.27s2.912 1.237 2.912 3.27c0 2.027-1.113 3.27-2.912 3.27s-2.912-1.243-2.912-3.27zm-2.108 0c0-1.477-.692-2.361-1.846-2.361-1.143 0-1.863.908-1.863 2.361 0 1.447.72 2.361 1.857 2.361 1.16 0 1.852-.884 1.852-2.361zm1.043 0c0 1.975-1.049 3.27-2.655 3.27-.902 0-1.629-.393-1.974-1.061h-.094v3.059h-1.008v-8.426h.961v1.054h.094c.404-.726 1.16-1.166 2.021-1.166 1.612 0 2.655 1.284 2.655 3.27zm-8.048 0c0-1.477-.691-2.361-1.845-2.361-1.143 0-1.864.908-1.864 2.361 0 1.447.721 2.361 1.858 2.361 1.16 0 1.851-.884 1.851-2.361zm1.043 0c0 1.975-1.049 3.27-2.654 3.27-.902 0-1.629-.393-1.975-1.061h-.093v3.059h-1.008v-8.426h.961v1.054h.093c.405-.726 1.161-1.166 2.022-1.166 1.611 0 2.654 1.284 2.654 3.27zm-7.645 3.158h-.961v-.99h-.094c-.316.703-.99 1.102-1.957 1.102-1.418 0-2.156-.844-2.156-2.338v-4.09h1.008v3.844c0 1.136.422 1.664 1.43 1.664 1.113 0 1.722-.663 1.722-1.77v-3.738h1.008zm-11.69-2.209c.129.885.972 1.447 2.174 1.447 1.136 0 1.974-.615 1.974-1.453 0-.72-.527-1.177-1.693-1.47l-1.084-.282c-1.529-.386-2.192-1.078-2.192-2.279 0-1.435 1.202-2.408 2.989-2.408 1.634 0 2.853.973 2.941 2.338h-1.06c-.147-.867-.862-1.383-1.916-1.383-1.125 0-1.87.562-1.87 1.418 0 .662.463 1.043 1.629 1.342l.885.234c1.752.44 2.455 1.119 2.455 2.361 0 1.553-1.224 2.543-3.158 2.543-1.793 0-3.029-.949-3.141-2.408z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"support\"},{\"name\":\"data-analytics-element-engagement\",\"value\":\"hover - support\"}]}],\"bag\":{\"analyticsAttributes\":[{\"name\":\"data-analytics-region\",\"value\":\"bag\"}],\"open\":{\"url\":\"/us/shop/goto/bag\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"44\\\" viewBox=\\\"0 0 14 44\\\" width=\\\"14\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m11.3535 16.0283h-1.0205a3.4229 3.4229 0 0 0 -3.333-2.9648 3.4229 3.4229 0 0 0 -3.333 2.9648h-1.02a2.1184 2.1184 0 0 0 -2.117 2.1162v7.7155a2.1186 2.1186 0 0 0 2.1162 2.1167h8.707a2.1186 2.1186 0 0 0 2.1168-2.1167v-7.7155a2.1184 2.1184 0 0 0 -2.1165-2.1162zm-4.3535-1.8652a2.3169 2.3169 0 0 1 2.2222 1.8652h-4.4444a2.3169 2.3169 0 0 1 2.2222-1.8652zm5.37 11.6969a1.0182 1.0182 0 0 1 -1.0166 1.0171h-8.7069a1.0182 1.0182 0 0 1 -1.0165-1.0171v-7.7155a1.0178 1.0178 0 0 1 1.0166-1.0166h8.707a1.0178 1.0178 0 0 1 1.0164 1.0166z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"48\\\" viewBox=\\\"0 0 17 48\\\" width=\\\"17\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m13.4575 16.9268h-1.1353a3.8394 3.8394 0 0 0 -7.6444 0h-1.1353a2.6032 2.6032 0 0 0 -2.6 2.6v8.9232a2.6032 2.6032 0 0 0 2.6 2.6h9.915a2.6032 2.6032 0 0 0 2.6-2.6v-8.9231a2.6032 2.6032 0 0 0 -2.6-2.6001zm-4.9575-2.2768a2.658 2.658 0 0 1 2.6221 2.2764h-5.2442a2.658 2.658 0 0 1 2.6221-2.2764zm6.3574 13.8a1.4014 1.4014 0 0 1 -1.4 1.4h-9.9149a1.4014 1.4014 0 0 1 -1.4-1.4v-8.9231a1.4014 1.4014 0 0 1 1.4-1.4h9.915a1.4014 1.4014 0 0 1 1.4 1.4z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-click\",\"value\":\"prop3:open - bag\"},{\"name\":\"data-analytics-title\",\"value\":\"open - bag\"}],\"ariaLabel\":\"Shopping Bag\"},\"close\":{\"analyticsAttributes\":[{\"name\":\"data-analytics-click\",\"value\":\"prop3:close - bag\"},{\"name\":\"data-analytics-title\",\"value\":\"close - bag\"}],\"ariaLabel\":\"Close\"},\"badge\":{\"ariaLabel\":\"Shopping Bag with item count : {%BAGITEMCOUNT%}\"},\"storeApiUrl\":\"/[storefront]/shop/bag/status\"},\"search\":{\"analyticsAttributes\":[{\"name\":\"data-analytics-region\",\"value\":\"search\"}],\"open\":{\"url\":\"/us/search\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg xmlns=\\\"http://www.w3.org/2000/svg\\\" width=\\\"15px\\\" height=\\\"44px\\\" viewBox=\\\"0 0 15 44\\\">\\n<path d=\\\"M14.298,27.202l-3.87-3.87c0.701-0.929,1.122-2.081,1.122-3.332c0-3.06-2.489-5.55-5.55-5.55c-3.06,0-5.55,2.49-5.55,5.55 c0,3.061,2.49,5.55,5.55,5.55c1.251,0,2.403-0.421,3.332-1.122l3.87,3.87c0.151,0.151,0.35,0.228,0.548,0.228 s0.396-0.076,0.548-0.228C14.601,27.995,14.601,27.505,14.298,27.202z M1.55,20c0-2.454,1.997-4.45,4.45-4.45 c2.454,0,4.45,1.997,4.45,4.45S8.454,24.45,6,24.45C3.546,24.45,1.55,22.454,1.55,20z\\\"/>\\n</svg>\\n\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"48\\\" viewBox=\\\"0 0 17 48\\\" width=\\\"17\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m16.2294 29.9556-4.1755-4.0821a6.4711 6.4711 0 1 0 -1.2839 1.2625l4.2005 4.1066a.9.9 0 1 0 1.2588-1.287zm-14.5294-8.0017a5.2455 5.2455 0 1 1 5.2455 5.2527 5.2549 5.2549 0 0 1 -5.2455-5.2527z\\\"/></svg>\"}],\"ariaLabel\":\"Search apple.com\",\"analyticsAttributes\":[{\"name\":\"data-analytics-click\",\"value\":\"prop3:open - search field\"},{\"name\":\"data-analytics-title\",\"value\":\"open - search field\"}]},\"close\":{\"ariaLabel\":\"Close\"},\"input\":{\"placeholderTextRegular\":\"Search apple.com\",\"placeholderTextCompact\":\"Search\",\"ariaLabel\":\"Search apple.com\"},\"submit\":{\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"32\\\" viewBox=\\\"0 0 30 32\\\" width=\\\"30\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m23.3291 23.3066-4.35-4.35c-.0105-.0105-.0247-.0136-.0355-.0235a6.8714 6.8714 0 1 0 -1.5736 1.4969c.0214.0256.03.0575.0542.0815l4.35 4.35a1.1 1.1 0 1 0 1.5557-1.5547zm-15.4507-8.582a5.6031 5.6031 0 1 1 5.603 5.61 5.613 5.613 0 0 1 -5.603-5.61z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg width=\\\"38\\\" height=\\\"40\\\" viewBox=\\\"0 0 38 40\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m28.6724 27.8633-5.07-5.07c-.0095-.0095-.0224-.0122-.032-.0213a7.9967 7.9967 0 1 0 -1.8711 1.7625c.0254.03.0357.0681.0642.0967l5.07 5.07a1.3 1.3 0 0 0 1.8389-1.8379zm-18.0035-10.0033a6.5447 6.5447 0 1 1 6.545 6.5449 6.5518 6.5518 0 0 1 -6.545-6.5449z\\\"/></svg>\"}],\"ariaLabel\":\"Submit search\"},\"reset\":{\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"14\\\" viewBox=\\\"0 0 14 14\\\" width=\\\"14\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m7 .0339a6.9661 6.9661 0 1 0 6.9661 6.9661 6.9661 6.9661 0 0 0 -6.9661-6.9661zm2.798 8.9867a.55.55 0 0 1 -.778.7774l-2.02-2.02-2.02 2.02a.55.55 0 0 1 -.7784-.7774l2.0206-2.0206-2.0204-2.02a.55.55 0 0 1 .7782-.7778l2.02 2.02 2.02-2.02a.55.55 0 0 1 .778.7778l-2.0203 2.02z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"16\\\" viewBox=\\\"0 0 16 16\\\" width=\\\"16\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m0 8a8.0474 8.0474 0 0 1 7.9922-8 8.0609 8.0609 0 0 1 8.0078 8 8.0541 8.0541 0 0 1 -8 8 8.0541 8.0541 0 0 1 -8-8zm5.6549 3.2863 2.3373-2.353 2.3451 2.353a.6935.6935 0 0 0 .4627.1961.6662.6662 0 0 0 .6667-.6667.6777.6777 0 0 0 -.1961-.4706l-2.3451-2.3373 2.3529-2.3607a.5943.5943 0 0 0 .1961-.4549.66.66 0 0 0 -.6667-.6589.6142.6142 0 0 0 -.447.1961l-2.3686 2.3606-2.353-2.3527a.6152.6152 0 0 0 -.447-.1883.6529.6529 0 0 0 -.6667.651.6264.6264 0 0 0 .1961.4549l2.3451 2.3529-2.3451 2.353a.61.61 0 0 0 -.1961.4549.6661.6661 0 0 0 .6667.6667.6589.6589 0 0 0 .4627-.1961z\\\" /></svg>\"}],\"ariaLabel\":\"Clear search\"},\"results\":{\"ariaLabel\":\"total results\"},\"defaultLinks\":{\"title\":\"Quick Links\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"16\\\" viewBox=\\\"0 0 9 16\\\" width=\\\"9\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m8.6124 8.1035-2.99 2.99a.5.5 0 0 1 -.7071-.7071l2.1366-2.1364h-6.316a.5.5 0 0 1 0-1h6.316l-2.1368-2.1367a.5.5 0 0 1 .7071-.7071l2.99 2.99a.5.5 0 0 1 .0002.7073z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"25\\\" viewBox=\\\"0 0 13 25\\\" width=\\\"13\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m12.3577 13.4238-4.4444 4.4444a.6.6 0 0 1 -.8486-.8477l3.37-3.37h-9.3231a.65.65 0 0 1 0-1.3008h9.3232l-3.37-3.37a.6.6 0 0 1 .8486-.8477l4.4444 4.4444a.5989.5989 0 0 1 -.0001.8474z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-region\",\"value\":\"defaultlinks search\"}]},\"defaultLinksApiUrl\":\"/search-services/suggestions/defaultlinks/\",\"suggestedLinks\":{\"title\":\"Suggested Links\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"16\\\" viewBox=\\\"0 0 9 16\\\" width=\\\"9\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m8.6124 8.1035-2.99 2.99a.5.5 0 0 1 -.7071-.7071l2.1366-2.1364h-6.316a.5.5 0 0 1 0-1h6.316l-2.1368-2.1367a.5.5 0 0 1 .7071-.7071l2.99 2.99a.5.5 0 0 1 .0002.7073z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"25\\\" viewBox=\\\"0 0 13 25\\\" width=\\\"13\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m12.3577 13.4238-4.4444 4.4444a.6.6 0 0 1 -.8486-.8477l3.37-3.37h-9.3231a.65.65 0 0 1 0-1.3008h9.3232l-3.37-3.37a.6.6 0 0 1 .8486-.8477l4.4444 4.4444a.5989.5989 0 0 1 -.0001.8474z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-title\",\"value\":\"suggestions links\"}]},\"suggestedSearches\":{\"title\":\"Suggested Searches\",\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"16\\\" viewBox=\\\"0 0 9 16\\\" width=\\\"9\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m8.6235 11.2266-2.2141-2.2142a3.43 3.43 0 0 0 .7381-2.1124 3.469 3.469 0 1 0 -1.5315 2.8737l2.23 2.23a.55.55 0 0 0 .7773-.7773zm-7.708-4.3266a2.7659 2.7659 0 1 1 2.7657 2.766 2.7694 2.7694 0 0 1 -2.7657-2.766z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"25\\\" viewBox=\\\"0 0 13 25\\\" width=\\\"13\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m12.3936 17.7969-3.1231-3.1231a4.83 4.83 0 0 0 1.023-2.9541 4.89 4.89 0 1 0 -2.1806 4.059v.0006l3.1484 3.1484a.8.8 0 0 0 1.1319-1.1308zm-10.9536-6.0769a3.9768 3.9768 0 1 1 3.976 3.9773 3.981 3.981 0 0 1 -3.976-3.9773z\\\"/></svg>\"}],\"analyticsAttributes\":[{\"name\":\"data-analytics-region\",\"value\":\"suggestions search\"}]},\"suggestionsApiUrl\":\"/search-services/suggestions/\"},\"segmentbar\":{\"dataStrings\":{\"view\":\"{%STOREFRONT%} Store Home\",\"exit\":\"Exit\",\"segments\":{\"smb\":\"Business Store Home\",\"eduInd\":\"Education Store Home\",\"other\":\"Store Home\"}}},\"menu\":{\"open\":{\"ariaLabel\":\"Menu\"},\"close\":{\"ariaLabel\":\"Close\"},\"back\":{\"ariaLabel\":\"Main menu\",\"images\":[{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"48\\\" viewBox=\\\"0 0 9 48\\\" width=\\\"9\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m1.5618 24.0621 6.5581-6.4238c.2368-.2319.2407-.6118.0088-.8486-.2324-.2373-.6123-.2407-.8486-.0088l-7 6.8569c-.1157.1138-.1807.2695-.1802.4316.001.1621.0674.3174.1846.4297l7 6.7241c.1162.1118.2661.1675.4155.1675.1577 0 .3149-.062.4326-.1846.2295-.2388.2222-.6187-.0171-.8481z\\\"/></svg>\"}]}},\"submenu\":{\"open\":{\"images\":[{\"name\":\"regular\",\"assetInline\":\"<svg height=\\\"10\\\" viewBox=\\\"0 0 10 10\\\" width=\\\"10\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m4.6725 6.635-2.655-2.667a.445.445 0 0 1 -.123-.304.4331.4331 0 0 1 .427-.439h.006a.447.447 0 0 1 .316.135l2.357 2.365 2.356-2.365a.458.458 0 0 1 .316-.135.433.433 0 0 1 .433.433v.006a.4189.4189 0 0 1 -.123.3l-2.655 2.671a.4451.4451 0 0 1 -.327.14.464.464 0 0 1 -.328-.14z\\\"/></svg>\"},{\"name\":\"compact\",\"assetInline\":\"<svg height=\\\"48\\\" viewBox=\\\"0 0 9 48\\\" width=\\\"9\\\" xmlns=\\\"http://www.w3.org/2000/svg\\\"><path d=\\\"m7.4382 24.0621-6.5581-6.4238c-.2368-.2319-.2407-.6118-.0088-.8486.2324-.2373.6123-.2407.8486-.0088l7 6.8569c.1157.1138.1807.2695.1802.4316-.001.1621-.0674.3174-.1846.4297l-7 6.7242c-.1162.1118-.2661.1675-.4155.1675-.1577 0-.3149-.062-.4326-.1846-.2295-.2388-.2222-.6187.0171-.8481l6.5537-6.2959z\\\"/></svg>\"}]}},\"textDirection\":\"ltr\",\"wwwDomain\":\"www.apple.com\",\"searchUrlPath\":\"/us/search\",\"storeUrlPath\":\"/us\",\"hasAbsoluteUrls\":true,\"hasShopRedirectUrls\":false,\"analyticsType\":\"marcom\",\"storeApiKey\":\"\",\"submenuApiUrl\":\"https://www.apple.com/api-www/global-elements/global-header/v1/flyouts\"}}}</script>",
        "footer": "<footer id=\"ac-globalfooter\" class=\"no-js\" role=\"contentinfo\" lang=\"en-US\" dir=\"ltr\"><div class=\"ac-gf-content\"><section class=\"ac-gf-footer\">\n\t<div class=\"ac-gf-footer-shop\" x-ms-format-detection=\"none\">\n\t\tMore ways to shop: <a href=\"https://www.apple.com/retail/\" data-analytics-title=\"find an apple store\">Find an Apple Store</a> or <a href=\"https://locate.apple.com/\" data-analytics-title=\"other retailers or resellers\" data-analytics-exit-link>other retailer</a> near you. <span class=\"nowrap\">Or call 1-800-MY-APPLE.</span>\n\t</div>\n\t<div class=\"ac-gf-footer-locale\">\n\t\t<a class=\"ac-gf-footer-locale-link\" href=\"https://www.apple.com/choose-country-region/\" title=\"Choose your country or region\" aria-label=\"Choose your country or region\" data-analytics-title=\"choose your country\">Choose your country or region</a>\n\t</div>\n\t<div class=\"ac-gf-footer-legal\">\n\t\t<div class=\"ac-gf-footer-legal-copyright\">Copyright &#xA9; 2023 Apple Inc. All rights reserved.\n\t\t</div>\n\t\t<ul class=\"ac-gf-footer-legal-links\">\n\t\t\t<li class=\"ac-gf-footer-legal-links-item\">\n\t\t\t\t<a class=\"ac-gf-footer-legal-link\" href=\"https://www.apple.com/legal/privacy/\" data-analytics-title=\"privacy policy\">Privacy Policy</a>\n\t\t\t</li>\n\t\t\t<li class=\"ac-gf-footer-legal-links-item\">\n\t\t\t\t<a class=\"ac-gf-footer-legal-link\" href=\"https://www.apple.com/legal/internet-services/terms/site.html\" data-analytics-title=\"terms of use\">Terms of Use</a>\n\t\t\t</li>\n\t\t\t<li class=\"ac-gf-footer-legal-links-item\">\n\t\t\t\t<a class=\"ac-gf-footer-legal-link\" href=\"https://www.apple.com/us/shop/goto/help/sales_refunds\" data-analytics-title=\"sales and refunds\">Sales and Refunds</a>\n\t\t\t</li>\n\t\t\t<li class=\"ac-gf-footer-legal-links-item\">\n\t\t\t\t<a class=\"ac-gf-footer-legal-link\" href=\"https://www.apple.com/legal/\" data-analytics-title=\"legal\">Legal</a>\n\t\t\t</li>\n\t\t\t<li class=\"ac-gf-footer-legal-links-item\">\n\t\t\t\t<a class=\"ac-gf-footer-legal-link\" href=\"https://www.apple.com/sitemap/\" data-analytics-title=\"site map\">Site Map</a>\n\t\t\t</li>\n\t\t</ul>\n\t</div>\n</section>\n</div></footer>",
        "styles": {
            "footer": "2306.1.0/en_US/ac-global-footer.4a7162bbfb49c42f9ba734511824ad69.css",
            "nav": "https://www.apple.com/api-www/global-elements/global-header/v1/assets/globalheader.css"
        },
        "scripts": {
            "footer": "2306.1.0/en_US/ac-global-footer.cdf596b6a09e2d33415c8429ad5ac858.js",
            "nav": "https://www.apple.com/api-www/global-elements/global-header/v1/assets/globalheader.umd.js"
        },
        "isLoaded": true
    },
    {
        "@context": "https://schema.org",
        "@id": "https://podcasts.apple.com/#organization",
        "@type": "Organization",
        "name": "Apple Podcasts",
        "url": "https://podcasts.apple.com",
        "logo": "https://podcasts.apple.com/assets/images/knowledge-graph/podcasts.png",
        "sameAs": [
            "https://twitter.com/ApplePodcasts",
            "https://www.facebook.com/ApplePodcasts/"
        ],
        "parentOrganization": {
            "@type": "Organization",
            "name": "Apple",
            "@id": "https://www.apple.com/#organization",
            "url": "https://www.apple.com/"
        }
    }
]